      *((program: SOCK10.cl2))
000001 IDENTIFICATION DIVISION.
000002
000003 PROGRAM-ID. SOCK10.
000004*                            VMOD=1.001.
000005*
000006*AUTHOR.     LOGIC INC.
000007*            DALLAS, TEXAS.
000008*REMARKS.
000009*         THIS PROGRAM IS STARTED VIA A SOCKET CALL FROM APP.
000010*         Designed to receive key, read thru claim stuff,
000011*         create a line sequential report. send back the
000012*         file name to the app thru socket.
000013
000014*       INPUT FILES-   ELMSTR-   CLAIM MASTER
000015*                      ELTRLR-   ACTIVITY TRAILERS
000016*                      ELCNTL-   CONTROL FILE
000017*                      ELCERT-   CERTIFICATE MASTER
000018*                      ERACCT-   ACCOUNT MASTER
000019*                      ELBENE-   BENEFICIARY MASTER
000020
000021*       OUTPUT-                  CLAIM STATUS REPORT
000022*                                (OPEN/CLOSE HISTORY)
000023
000024*       COMMARERA-     RECEIVED FROM THE CALLING SOCKET
000025*                      AND ENTRY CODE 1 FOR SHORT FORM AND
000026*                      2  FOR THE LONG FORM--
000027******************************************************************
000028*                   C H A N G E   L O G
000029*
000030* CHANGES ARE MARKED BY THE CHANGE EFFECTIVE DATE.
000031*-----------------------------------------------------------------
000032*  CHANGE   CHANGE REQUEST PGMR  DESCRIPTION OF CHANGE
000033* EFFECTIVE    NUMBER
000034*-----------------------------------------------------------------
000035* 042018  CR2017072700004  PEMA  New program from (EL008)
000036* 062121  CR2021021600001  PEMA  ADD PROCESSING FOR NEW COMP FNL
000037******************************************************************
000038
000039 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000041 FILE-CONTROL.
000042
000043 SELECT CLM-STAT-EXT-OUT ASSIGN TO dynamic ws-file-name
000044    FILE STATUS IS ws-ext-file-status
000045    organization is line sequential.
000046
000047 DATA DIVISION.
000048 FILE SECTION.
000049
000050 FD  CLM-STAT-EXT-OUT
000051     BLOCK CONTAINS 0
000052     RECORDING MODE F.
000053
000054 01  CLM-STAT-EXT-OUT-RECORD     PIC X(132).
000055
000056 WORKING-STORAGE SECTION.
       01  DFH-START PIC X(04).
000057 77  FILLER  PIC X(32) VALUE '********************************'.
000058 77  FILLER  PIC X(32) VALUE '    SOCK10  WORKING-STORAGE     '.
000059 77  FILLER  PIC X(32) VALUE '********* VMOD=1.001 ***********'.
000060
000061 77  ws-send-msg-size            pic s9(8) comp value 48000.
000062 77  ws-recv-msg-size            pic s9(8) comp value 19200.
000063 77  ws-recv-buf                 pic x(4096).
000064 77  ws-send-buf                 pic x(48000) VALUE SPACES.
000065 77  ws-recv-total               pic s9(8) comp value 0.
000066 77  ws-recv-left                pic s9(8) comp value 0.
000067 77  ws-seq-num                  pic s9(8) comp value 0.
000068 77  ws-flags                    pic s9(8) comp value 0.
000069 77  WS-COMP-CD                  PIC X  VALUE LOW-VALUES.
000070 77  WS-COMP-ID                  PIC XXX VALUE 'CID'.
000071 77  THIS-PGM               PIC X(5) VALUE 'EL008'.
000072 77  ws-line-cntr                pic 999  value 070.
000073
000074 77  WS-ELMSTR-EOF-SW       PIC X    VALUE SPACE.
000075     88  END-OF-MSTR-FILE            VALUE 'E'.
000076
000077 77  WS-ELACTQ-EOF-SW       PIC X    VALUE SPACE.
000078     88  END-OF-ACTQ-FILE            VALUE 'E'.
000079
000080 77  WS-ELTRLR-EOF-SW       PIC X    VALUE SPACE.
000081     88  END-OF-TRLR-FILE            VALUE 'E'.
000082
000083 77  WS-FULL-PRINT-SW       PIC X    VALUE SPACE.
000084     88  FULL-PRINT-REQUIRED         VALUE 'X'.
000085
000086 77  WS-TRAILER-KEY-CHG-SW  PIC X    VALUE SPACE.
000087     88  TRAILER-KEY-CHANGED         VALUE 'X'.
000088
000089 77  END-OC-TABLE-SW        PIC X    VALUE SPACE.
000090     88  END-OC-TABLE                VALUE 'E'.
000091     88  OC-TABLE-LOADED             VALUE 'X'.
000092
000093 77  END-AD-TABLE-SW        PIC X    VALUE SPACE.
000094     88  END-AD-TABLE                VALUE 'E'.
000095     88  AD-TABLE-LOADED             VALUE 'X'.
000096
000097 77  END-AP-TABLE-SW        PIC X    VALUE SPACE.
000098     88  END-AP-TABLE                VALUE 'E'.
000099     88  AP-TABLE-LOADED             VALUE 'X'.
000100
000101 77  WS-CNTL-ERROR-SW      PIC X    VALUE SPACE.
000102     88  NO-COMPANY-RECORD         VALUE 'X'.
000103
000104 77  WS-MSTR-READ-ERROR-SW PIC X    VALUE SPACE.
000105     88  MSTR-READ-ERROR           VALUE 'X'.
000106
000107 77  WS-CERT-READ-ERROR-SW PIC X    VALUE SPACE.
000108     88  CERT-READ-ERROR           VALUE 'X'.
000109
000110 77  WS-TRLR-BROWSE-ERROR-SW PIC X    VALUE SPACE.
000111     88  TRLR-BROWSE-ERROR           VALUE 'X'.
000112
000113 77  WS-ACCT-BROWSE-SW       PIC X    VALUE SPACE.
000114     88  ACCT-BROWSE-OKAY            VALUE 'X'.
000115
000116 77  WS-BENE-BROWSE-SW       PIC X    VALUE SPACE.
000117     88  BENE-BROWSE-OKAY            VALUE 'X'.
000118
000119 77  WS-LN-SW               PIC X    VALUE SPACE.
000120     88  LAST-NAME-LOADED            VALUE 'X'.
000121
000122 77  WS-FN-SW               PIC X    VALUE SPACE.
000123     88  FIRST-NAME-LOADED           VALUE 'X'.
000124
000125 77  WS-CANC-DT             PIC XX   VALUE LOW-VALUES.
000126 77  WS-STATUS              PIC X    VALUE SPACES.
000127
000128 77  OC-SUB                 PIC  S9(4)  VALUE ZEROS COMP.
000129
000130 77  SUB1                   PIC S9(4)   VALUE ZEROS COMP.
000131
000132 77  WS-SUB                 PIC 9       VALUE 0.
000133
000134 77  A1                     PIC S999 COMP-3 VALUE +0.
000135
000136 77  WS-RECORD-TYPE         PIC X     VALUE SPACE.
000137
000138 77  WS-SAVED-FORM-NO       PIC X(12) VALUE SPACE.
000139
000140 01  WS-DISP-RESP                PIC 9(5).
000141 01  WS-RESPONSE                 PIC S9(8)   COMP.
000142     88  RESP-NORMAL                  VALUE +00.
000143     88  RESP-NOTFND                  VALUE +13.
000144     88  RESP-NOTOPEN                 VALUE +19.
000145     88  RESP-ENDFILE                 VALUE +20.
000146
000147 01  P pointer.
000148 01  KIXSYS                      pic X(7)  VALUE Z"KIXSYS".
000149 01  var-ptr pointer.
000150 01  env-var-len                 pic 9(4)  binary.
000151 01  rc                          pic 9(9)  binary.
000152
000153 01  WS-KIXSYS.
000154     05  WS-KIX-FIL1             PIC X(10).
000155     05  WS-KIX-APPS             PIC X(10).
000156     05  WS-KIX-ENV              PIC X(10).
000157     05  WS-KIX-MYENV            PIC X(10).
000158     05  WS-KIX-SYS              PIC X(10).
000159 01  ws-ext-file-status          pic xx value '00'.
000160 01  ws-file-name                pic x(60) value spaces.
000161
000162
000163 01  ws-rm-return-cd         pic s9(8) comp-5 value +0.
000164
000165 01  ws-rm-string.
000166     05  f                       pic x(6) value
000167      'rm -f '.
000168     05  rm-filename             pic x(54) value spaces.
000169     05  f                       pic x value low-values.
000170
000171 01  ws-return-stuff             pic x(100).
000172
000173 01  ws-work-dynamic.
000174     05  ws-work-dir             pic x(31) value spaces.
000175     05  ws-work-env             pic x(8)  value spaces.
000176     05  ws-work-comp-id         pic xxx   value spaces.
000177     05  ws-work-rpt-out         pic x(30) value spaces.
000178     05  ws-work-job-name        pic x(8)  value spaces.
000179
000180
000181 01  WS-DATE-AREA.
000182     05  SAVE-DATE           PIC X(8)    VALUE SPACES.
000183     05  SAVE-BIN-DATE       PIC X(2)    VALUE SPACES.
000184
000185     05  WS-PHONE-BRKDN              PIC 9(11).
000186     05  FILLER   REDEFINES WS-PHONE-BRKDN.
000187         10  FILLER                  PIC 9.
000188         10  WS-PH-1                 PIC 999.
000189         10  WS-PH-2                 PIC 999.
000190         10  WS-PH-3                 PIC 9999.
000191
000192     05  WS-PHONE-EDIT.
000193         10  WS-PH-ED-1              PIC XXX.
000194         10  FILLER                  PIC X   VALUE '-'.
000195         10  WS-PH-ED-2              PIC XXX.
000196         10  FILLER                  PIC X   VALUE '-'.
000197         10  WS-PH-ED-3              PIC XXXX.
000198
000199     05  WS-ZIP-WORK.
000200         10  WS-ZIP-PRIME        PIC X(5).
000201         10  WS-ZIP-DASH         PIC X.
000202         10  WS-ZIP-PLUS4        PIC X(4).
000203     05  WS-CANADIAN-ZIP-WORK  REDEFINES  WS-ZIP-WORK.
000204         10  WS-CAN-POSTAL-1     PIC XXX.
000205         10  FILLER              PIC X.
000206         10  WS-CAN-POSTAL-2     PIC XXX.
000207         10  FILLER              PIC XXX.
000208     05  WS-WORK-PHONE           PIC X(10)  VALUE ZEROS.
000209     05  WS-NUMERIC-PHONE REDEFINES WS-WORK-PHONE
000210                                 PIC 9(10).
000211     05  SSP                         PIC X  VALUE ' '.
000212     05  DSP                         PIC X  VALUE '0'.
000213     05  TSP                         PIC X  VALUE '-'.
000214     05  TPG                         PIC X  VALUE '1'.
000215
000216     05  WS-TERMINAL-ID.
000217         10  WS-TERM-PREFIX      PIC XX.
000218         10  FILLER              PIC XX.
000219
000220     05  WS-LAST-NAME    PIC X(15).
000221     05  FILLER REDEFINES WS-LAST-NAME.
000222         10  WS-L-BYTE   PIC X  OCCURS 15
000223                         INDEXED BY L-IND.
000224     05  WS-FIRST-NAME   PIC X(12).
000225     05  FILLER REDEFINES WS-FIRST-NAME.
000226         10  WS-F-BYTE   PIC X  OCCURS 12
000227                         INDEXED BY F-IND.
000228     05  PREVIOUS-BYTE          PIC X  VALUE SPACES.
000229
000230     05  WS-AGE             PIC 9(04)  VALUE ZEROS.
000231     05  WS-AGE-R REDEFINES WS-AGE.
000232         10  WS-AGE-1-2     PIC 9(02).
000233         10  WS-AGE-3-4     PIC 9(02).
000234
000235     05  WS-ACCESS.
000236         10  FILLER         PIC XX  VALUE SPACES.
000237         10  WS-BEN-CODE    PIC XX.
000238
000239     05  WS-AT-CONTROL-PRIMARY.
000240         10  WS-AT-CONTROL-WO-SEQ.
000241             15  WS-AT-COMPANY-CD   PIC X.
000242             15  WS-AT-CARRIER      PIC X.
000243             15  WS-AT-CLAIM-NO     PIC X(7).
000244             15  WS-AT-CERT-NO      PIC X(11).
000245         10  WS-AT-SEQ-NO           PIC S9(4) COMP.
000246
000247     05  WS-NEW-AT-CONTROL-PRIMARY.
000248         10  WS-NEW-AT-CONTROL-WO-SEQ  PIC X(20).
000249         10  FILLER                    PIC S9(4) COMP.
000250
000251     05  WS-AT-CONTROL-SAVED.
000252         10  WS-AT-CONTROL-SAVED-WO-SEQ  PIC X(20).
000253         10  FILLER                    PIC S9(4) COMP.
000254
000255     05  WS-CF-CONTROL-PRIMARY.
000256         10  WS-CF-COMPANY-ID   PIC XXX.
000257         10  WS-CF-RECORD-TYPE  PIC X.
000258         10  WS-CF-PROCESSOR    PIC X(4).
000259         10  WS-CF-SEQUENCE-NO  PIC S9(4) COMP.
000260
000261     05  WS-CL-CONTROL-PRIMARY.
000262         10  WS-CL-COMPANY-CD   PIC X.
000263         10  WS-CL-CARRIER      PIC X.
000264         10  WS-CL-CLAIM-NO     PIC X(7).
000265         10  WS-CL-CERT-NO      PIC X(11).
000266
000267     05  WS-CM-CONTROL-PRIMARY.
000268         10  WS-CM-COMPANY-CD   PIC X.
000269         10  WS-CM-CERT-DATA    PIC X(21).
000270         10  WS-CM-CERT-NO      PIC X(11).
000271
000272     05  WS-AM-CONTROL-PRIMARY.
000273         10  WS-AM-COMPANY-CD    PIC X(1).
000274         10  WS-AM-CARRIER       PIC X(1).
000275         10  WS-AM-GROUPING      PIC X(6).
000276         10  WS-AM-STATE         PIC X(2).
000277         10  WS-AM-ACCOUNT       PIC X(10).
000278         10  WS-AM-EXPIRATION-DT PIC X(2).
000279
000280     05  WS-BE-CONTROL-PRIMARY.
000281         10  WS-BE-COMPANY-CD    PIC X(01).
000282         10  WS-BE-RECORD-TYPE   PIC X(01).
000283         10  WS-BE-BENEFICIARY   PIC X(10).
000284
000285*---- THIS IS USED SO THAT EL008 WILL COMPILE, THE
000286*---- PI-PRINTER-ID IS USED BY THE CHECK WRITER EL176 AND
000287*---- EL177
000288     05  WS-CHECK-ID.
000289         10  PI-PRINTER-ID PIC X(04).
000290
000291 01  PRINT-CONTROL-WORK-AREA.
000292     05  WS-MM-DD-YY.
000293         10  WS-MM     PIC 99.
000294         10  WS-DD     PIC 99.
000295         10  WS-YY     PIC 99.
000296
000297     05  WS-TERM-DATE.
000298         10  WS-TERM-MM   PIC 999  VALUE ZEROS.
000299         10  WS-TERM-YY   PIC 999  VALUE ZEROS.
000300
000301     05  WS-REM-DATE.
000302         10  WS-REM-MM    PIC S999  VALUE ZEROS.
000303
000304     05  WS-PAGE-CNT      PIC 9(4)   VALUE 1.
000305
000306     05  WS-BIN-CURRENT-DT    PIC XX.
000307
000308 01  HEAD-LINE-2.
000309     05  FILLER             PIC X(31) VALUE SPACE.
000310     05  FILLER             PIC X(16) VALUE
000311                            '- CLAIM STATUS -'.
000312     05  FILLER             PIC X(19) VALUE SPACES.
000313     05  HEAD-REPORT-NO     PIC X(10) VALUE SPACES.
000314
000315 01  HEAD-LINE-3.
000316     05  FILLER             PIC X(25) VALUE SPACE.
000317     05  HEAD-COMPANY       PIC X(30) VALUE SPACES.
000318     05  FILLER             PIC X(12) VALUE SPACES.
000319     05  HEAD-RUN-DATE      PIC X(8).
000320
000321 01  HEAD-LINE-4.
000322     05  FILLER             PIC X(31) VALUE SPACE.
000323     05  HEAD-RUN-DATE-FULL PIC X(18).
000324     05  FILLER             PIC X(18) VALUE SPACES.
000325     05  FILLER             PIC X(4) VALUE 'PAGE'.
000326     05  HEAD-PAGE-NO       PIC ZZZ9.
000327
000328 01  HEAD-LINE-7.
000329     05  FILLER             PIC X(40) VALUE
000330        'CLAIM NO CARR  CERT NO    TYPE  STATUS'.
000331     05  FILLER             PIC X(40) VALUE
000332        'NAME OF INSURED                PROCESSOR'.
000333
000334 01  LINE-9.
000335     05  FILLER             PIC X     VALUE SPACES.
000336     05  P-CLAIM-NO         PIC X(7).
000337     05  FILLER             PIC X(3)  VALUE SPACES.
000338     05  P-CARR             PIC X.
000339     05  FILLER             PIC X(2)  VALUE SPACES.
000340     05  P-CERT-NO          PIC X(11).
000341     05  FILLER             PIC XX    VALUE SPACES.
000342     05  P-TYPE             PIC XXXX.
000343     05  FILLER             PIC XX    VALUE  SPACES.
000344     05  P-STATUS           PIC X(6).
000345     05  FILLER             PIC X(2)  VALUE   SPACES.
000346     05  P-NAME-GRP         PIC X(31).
000347     05  P-NAME-ARR REDEFINES P-NAME-GRP
000348                            OCCURS 31  INDEXED BY P-IND.
000349         10  P-NAME         PIC X.
000350     05  FILLER             PIC X(3) VALUE  SPACES.
000351     05  P-PROCESSOR        PIC X(4).
000352
000353 01  HEAD-LINE-10.
000354     05  FILLER             PIC X(20) VALUE
000355        'CREDIT CARD NUMBER:'.
000356     05  HEAD-CREDIT-CARD   PIC X(16).
000357
000358 01  LINE-12.
000359     05  L-12-PD-THRU       PIC X(13) VALUE
000360         'PAID THRU  - '.
000361     05  P-PAID-THRU-DT     PIC X(8).
000362     05  FILLER             PIC X(5)  VALUE  SPACES.
000363     05  FILLER             PIC X(15) VALUE
000364         'LAST PMT AMT - '.
000365     05  P-LAST-PMT-AMT     PIC Z(7).99.
000366     05  FILLER             PIC X(3)  VALUE  SPACES.
000367     05  FILLER             PIC X(16) VALUE
000368         'LAST PMT DATE - '.
000369     05  P-LAST-PMT-DT      PIC X(8).
000370
000371 01  LINE-13.
000372     05  FILLER             PIC X(13) VALUE
000373         'INCURRED   - '.
000374     05  P-INCURRED-DT      PIC X(8).
000375     05  FILLER             PIC X(5) VALUE  SPACES.
000376     05  FILLER             PIC X(15) VALUE
000377         'REPORTED     - '.
000378     05  P-REPORTED-DT      PIC X(8).
000379     05  FILLER             PIC X(5) VALUE  SPACES.
000380     05  FILLER             PIC X(16) VALUE
000381         'ESTABLISHED   - '.
000382     05  P-ESTAB-DT         PIC X(8).
000383
000384 01  LINE-14.
000385     05  FILLER             PIC X(13) VALUE
000386         'NEXT AUTO  - '.
000387     05  P-NEXT-AUTO-DT     PIC X(8).
000388     05  FILLER             PIC X(5) VALUE  SPACES.
000389     05  FILLER             PIC X(15) VALUE
000390         'PMTS MADE    - '.
000391     05  P-PMTS-MADE        PIC XXX.
000392     05  FILLER             PIC X(10) VALUE  SPACES.
000393     05  FILLER             PIC X(16) VALUE
000394         'PREMIUM TYPE  - '.
000395     05  P-PREM-TYPE        PIC X(7).
000396
000397 01  LINE-15.
000398     05  FILLER             PIC X(13) VALUE
000399         'COVERAGE   - '.
000400     05  P-COVERAGE         PIC X(10).
000401     05  FILLER             PIC X(3) VALUE   SPACES.
000402     05  L15-ISSUE-LIT      PIC X(15) VALUE
000403         'CERT ISSUE   - '.
000404     05  P-CERT-ISSUE-DT    PIC X(8).
000405     05  FILLER             PIC X(5) VALUE  SPACES.
000406     05  FILLER             PIC X(15) VALUE
000407         'ORIG BENEFIT  -'.
000408     05  P-ORIG-BENEF-AMT   PIC Z(8).99.
000409
000410 01  LINE-16.
000411     05  FILLER             PIC X(13) VALUE
000412         'EXPIRE DATE- '.
000413     05  P-EXPIRE           PIC X(12).
000414     05  FILLER             PIC X(1)  VALUE  SPACES.
000415     05  FILLER             PIC X(15) VALUE
000416         'TERM/REMAIN  - '.
000417     05  P-TERM             PIC ZZ9.
000418     05  FILLER             PIC X     VALUE '/'.
000419     05  P-REM              PIC ZZ9.
000420     05  FILLER             PIC X(6)  VALUE  SPACES.
000421     05  L16-STATUS-LIT     PIC X(16) VALUE
000422         'CERT STATUS   - '.
000423     05  P-CERT-STAT        PIC X(8).
000424
000425 01  LINE-17.
000426     05  FILLER             PIC X(13) VALUE
000427         'TOTAL PAID - '.
000428     05  P-TOT-PAID         PIC Z(8).99.
000429     05  FILLER             PIC X(2)  VALUE  SPACES.
000430     05  FILLER             PIC X(15) VALUE
000431         'CAUSE/DIAG   - '.
000432     05  P-CAUSE-DIAG       PIC X(26).
000433
000434 01  LINE-19.
000435     05  FILLER             PIC X(13) VALUE
000436         'TOT EXPENSE- '.
000437     05  P-TOT-EXPENSE      PIC ZZZZZZZ.99.
000438     05  FILLER             PIC X(3)  VALUE  SPACES.
000439     05  FILLER             PIC X(15) VALUE
000440         'ORIG MANUAL  - '.
000441     05  P-ORIG-MANUAL      PIC ZZZZZZ.99.
000442     05  FILLER             PIC X(4)  VALUE  SPACES.
000443     05  L19-ACCT-LIT       PIC X(16) VALUE
000444         'ACCOUNT       - '.
000445     05  P-ACCT             PIC X(10).
000446
000447 01  LINE-20.
000448     05  FILLER             PIC X(13) VALUE
000449         'CHG EXPENSE- '.
000450     05  P-CHG-EXPENSE      PIC ZZZZZZ.99.
000451     05  FILLER             PIC X(4)  VALUE  SPACES.
000452     05  FILLER             PIC X(15) VALUE
000453         'REM MANUAL   - '.
000454     05  P-REM-MANUAL       PIC ZZZZZZ.99.
000455     05  FILLER             PIC X(4)  VALUE  SPACES.
000456     05  FILLER             PIC X(16) VALUE
000457         'STATE         - '.
000458     05  P-STATE            PIC X(8).
000459
000460 01  LINE-21.
000461     05  L21-CANC-LIT       PIC X(13) VALUE
000462         'CERT CANCEL- '.
000463     05  P-CERT-CANC-DT     PIC X(8).
000464     05  FILLER             PIC X(5)  VALUE  SPACES.
000465     05  FILLER             PIC X(15) VALUE
000466         'ADDL RESERVE - '.
000467     05  P-ADD-RESERVE      PIC ZZZZZZ.99.
000468     05  FILLER             PIC X(4)  VALUE  SPACES.
000469     05  FILLER             PIC X(16) VALUE
000470         'GROUPING      - '.
000471     05  P-GROUP            PIC X(8).
000472
000473 01  LINE-22.
000474     05  FILLER             PIC X(13) VALUE
000475         'REIN CODE  - '.
000476     05  P-REIN-CODE        PIC X(3).
000477     05  FILLER             PIC X(10) VALUE  SPACES.
000478     05  FILLER             PIC X(15) VALUE
000479         'CERT BATCH   - '.
000480     05  P-CERT-BATCH       PIC X(6).
000481     05  FILLER             PIC X(7)  VALUE  SPACES.
000482     05  L22-ENTRY-LIT      PIC X(16) VALUE
000483         'CERT ENTRY    - '.
000484     05  P-CERT-ENTRY.
000485         10  P-CERT-ENTRY-MM  PIC XX.
000486         10  P-CERT-SL        PIC X   VALUE '/'.
000487         10  P-CERT-ENTRY-YY  PIC XX.
000488
000489 01  LINE-23.
000490     05  FILLER             PIC X(13) VALUE
000491         'MEMBER NO. - '.
000492     05  P-MEMBER-NO        PIC X(12).
000493     05  FILLER             PIC X(16) VALUE
000494         ' INSURED AGE  - '.
000495     05  P-INSURED-AGE      PIC XX.
000496     05  FILLER             PIC X(11) VALUE SPACES.
000497     05  FILLER             PIC X(16) VALUE
000498         'INSURED SEX   - '.
000499     05  P-INSURED-SEX      PIC XX.
000500
000501 01  LINE-23A.
000502     05  P-USER-HD          PIC X(13) VALUE
000503         'USER CODE  - '.
000504     05  P-USER-CODE        PIC X.
000505     05  FILLER             PIC X(12) VALUE SPACES.
000506     05  P-PURGED-STMT      PIC X(15) VALUE 'PURGED DATE  - '.
000507     05  P-PURGED-DATE      PIC X(08) VALUE SPACES.
000508
000509 01  LINE-25.
000510     05  FILLER             PIC X(41) VALUE
000511         '- - CHRONOLOGICAL LISTING OF ACTIVITY - -'.
000512
000513 01  LINE-26.
000514     05  FILLER             PIC X(20) VALUE
000515         'TYPE    RECORDED  BY'.
000516****************
000517 01  PAYMENT-DESCRIPTION-TABLE.
000518     12  FILLER              PIC X(11)   VALUE 'PARTIAL PMT'.
000519     12  FILLER              PIC X(11)   VALUE 'FINAL PMT  '.
000520     12  FILLER              PIC X(11)   VALUE 'LUMP SM PMT'.
000521     12  FILLER              PIC X(11)   VALUE 'ADDITNL PMT'.
000522     12  FILLER              PIC X(11)   VALUE 'CHGABLE EXP'.
000523     12  FILLER              PIC X(11)   VALUE 'NON-CHG EXP'.
000524     12  FILLER              PIC X(11)   VALUE 'LF PRM RFND'.
000525     12  FILLER              PIC X(11)   VALUE 'AH PRM RFND'.
000526     12  FILLER              PIC X(11)   VALUE 'ENTRY CORR '.
000527 01  PAYMENT-DESC-R   REDEFINES PAYMENT-DESCRIPTION-TABLE.
000528     12  PAY-DESC            PIC X(11)   OCCURS 9.
000529
000530 01  P-PAY-LINE-1.
000531     05  P-PAY-ACT-TYPE     PIC X(11) VALUE SPACES.
000532*        'PAYMENT '.
000533     05  FILLER             PIC X(1)  VALUE SPACE.
000534     05  P-PAY-PMT-DT       PIC X(8).
000535     05  FILLER             PIC X     VALUE SPACES.
000536     05  P-PAY-BY           PIC X(4).
000537     05  FILLER             PIC X(10) VALUE
000538         '  PAYEE - '.
000539     05  P-PAY-PAYEE        PIC X(30).
000540     05  FILLER             PIC X(13) VALUE
000541         '  PAYEE CD - '.
000542     05  P-PAY-PAYEE-CD     PIC X(02).
000543
000544 01  P-PAY-LINE-2.
000545     05  FILLER             PIC X(23) VALUE  SPACES.
000546     05  FILLER             PIC X(9)  VALUE
000547         'AMOUNT - '.
000548     05  P-PAY-PMT-AMT      PIC Z(7).99.
000549     05  FILLER             PIC X(10) VALUE
000550         '  CHECK - '.
000551     05  P-PAY-CHECK        PIC X(7).
000552     05  FILLER             PIC X(12) VALUE
000553         '  WRITTEN - '.
000554     05  P-PAY-WRIT-DT      PIC X(8).
000555
000556 01  P-PAY-LINE-3.
000557     05  FILLER             PIC X(23) VALUE  SPACES.
000558     05  FILLER             PIC X(9)  VALUE
000559         'TYPE   - '.
000560     05  P-PAY-TYPE         PIC X(22).
000561     05  FILLER             PIC X(11) VALUE
000562         '  ORIGIN - '.
000563     05  P-PAY-ORIGIN       PIC X(7).
000564
000565 01  P-PAY-LINE-4.
000566     05  FILLER             PIC X(23) VALUE  SPACES.
000567     05  FILLER             PIC X(9)  VALUE
000568         'RESERVE- '.
000569     05  P-PAY-RESERVE      PIC Z(6).99.
000570     05  FILLER             PIC X(12) VALUE
000571         '  EXPENSE - '.
000572     05  P-PAY-EXPEN        PIC Z(5).99.
000573     05  FILLER             PIC X(11) VALUE
000574         '  CREDIT - '.
000575     05  P-PAY-CREDIT-DT    PIC X(8).
000576
000577 01  P-PAY-LINE-5A.
000578     05  FILLER             PIC X(23) VALUE  SPACES.
000579     05  FILLER             PIC X(7)  VALUE
000580         'VOID - '.
000581     05  P-PAY-VOID-DT      PIC X(8).
000582     05  FILLER             PIC X(11) VALUE
000583         '  REASON - '.
000584     05  P-PAY-REASON       PIC X(30).
000585
000586 01  P-PAY-LINE-5B.
000587     05  FILLER             PIC X(23) VALUE  SPACES.
000588     05  FILLER             PIC X(7)  VALUE
000589         'FROM - '.
000590     05  P-PAY-FROM-DT      PIC X(8).
000591     05  L-5B-PD-THRU       PIC X(8)  VALUE
000592         ' THRU - '.
000593     05  P-PAY-THRU-DT      PIC X(8).
000594     05  FILLER             PIC X(8)  VALUE
000595         '  DAYS -'.
000596     05  P-PAY-DAYS         PIC ZZZ9.
000597     05  FILLER             PIC X(8)  VALUE
000598         '  RATE -'.
000599     05  P-PAY-RATE         PIC ZZ9.99.
000600
000601 01  P-PAY-LINE-5C.
000602     05  FILLER             PIC X(23) VALUE  SPACES.
000603     05  FILLER             PIC X(15) VALUE 'EXPENSE TYPE - '.
000604     05  P-EXP-TYPE         PIC X.
000605     05  FILLER             PIC X(41) VALUE SPACES.
000606
000607 01  P-LET-LINE-1.
000608     05  P-LET-ACT-TYPE     PIC X(11) VALUE SPACES.
000609*        'LETTER  '.
000610     05  FILLER             PIC X     VALUE  SPACE.
000611     05  P-LET-LET-DT       PIC X(8).
000612     05  FILLER             PIC X     VALUE SPACE.
000613     05  P-LET-BY           PIC X(4).
000614     05  FILLER             PIC X(14) VALUE
000615         '  ADDRESSEE - '.
000616     05  P-LET-ADSEE        PIC X(30).
000617     05  FILLER             PIC X(8) VALUE
000618         ' CODE - '.
000619     05  P-LET-ADSEE-CD     PIC X(3).
000620
000621 01  P-LET-LINE-2.
000622     05  FILLER             PIC X(23) VALUE  SPACES.
000623     05  FILLER             PIC X(7)  VALUE
000624         'FORM - '.
000625     05  P-LET-FORM         PIC X(4).
000626     05  FILLER             PIC X(9)  VALUE
000627         '  SENT - '.
000628     05  P-LET-SENT-DT      PIC X(8).
000629     05  FILLER             PIC X(12) VALUE
000630         '  RE-SEND - '.
000631     05  P-LET-SEND-DT      PIC X(8).
000632
000633 01  P-LET-LINE-3.
000634     05  FILLER             PIC X(23) VALUE  SPACES.
000635     05  FILLER             PIC X(12) VALUE
000636         'FOLLOW UP - '.
000637     05  P-LET-FOL-DT       PIC X(8).
000638     05  FILLER             PIC X(13) VALUE
000639         '  ANSWERED - '.
000640     05  P-LET-ANS-DT       PIC X(8).
000641
000642 01  P-LET-LINE-4.
000643     05  FILLER             PIC X(23) VALUE  SPACES.
000644     05  FILLER             PIC X(9)  VALUE
000645         'ORIGIN - '.
000646     05  P-LET-ORIGIN       PIC X(7).
000647     05  FILLER             PIC X(12) VALUE
000648         '  ARCHIVE - '.
000649     05  P-LET-ARCH         PIC 9(6).
000650
000651 01  P-LET-LINE-5.
000652     05  FILLER             PIC X(10) VALUE
000653         '     RE - '.
000654     05  P-LET-RE           PIC X(70).
000655
000656 01  P-NOT-LINE-1.
000657     05  P-NOT-ACT-TYPE     PIC X(11) VALUE  SPACES.
000658*        'NOTES   '.
000659     05  FILLER             PIC X     VALUE  SPACE.
000660     05  P-NOT-NOTE-DT      PIC X(8).
000661     05  FILLER             PIC X     VALUE  SPACE.
000662     05  P-NOT-BY           PIC X(4).
000663
000664 01  P-NOT-LINE-2.
000665     05  FILLER             PIC X(10) VALUE  SPACES.
000666     05  P-NOT-TEXT-1       PIC X(70).
000667
000668 01  P-NOT-LINE-3.
000669     05  FILLER             PIC X(10) VALUE  SPACES.
000670     05  P-NOT-TEXT-2       PIC X(70).
000671
000672 01  P-PRO-LINE-1.
000673     05  FILLER             PIC X(11) VALUE
000674         'REMINDER   '.
000675     05  FILLER             PIC X     VALUE  SPACE.
000676     05  P-PRO-NOTE-DT      PIC X(8).
000677     05  FILLER             PIC X     VALUE  SPACE.
000678     05  P-PRO-BY           PIC X(4).
000679     05  FILLER             PIC X(17) VALUE
000680         '  START NOTIFY - '.
000681     05  P-PRO-START-DT     PIC X(8).
000682     05  FILLER             PIC X(15) VALUE
000683         '  END NOTIFY - '.
000684     05  P-PRO-END-DT       PIC X(8).
000685
000686 01  P-PRO-LINE-2.
000687     05  FILLER             PIC X(10) VALUE  SPACES.
000688     05  P-PRO-TEXT-1       PIC X(70).
000689
000690 01  P-PRO-LINE-3.
000691     05  FILLER             PIC X(10) VALUE  SPACES.
000692     05  P-PRO-TEXT-2       PIC X(70).
000693
000694 01  P-DEN-LINE-1.
000695     05  FILLER             PIC X(11) VALUE
000696         'DENIAL     '.
000697     05  FILLER             PIC X     VALUE  SPACE.
000698     05  P-DEN-DEN-DT       PIC X(8).
000699     05  FILLER             PIC X     VALUE  SPACE.
000700     05  P-DEN-BY           PIC X(4).
000701     05  FILLER             PIC X(17) VALUE
000702         '  RECONSIDERED - '.
000703     05  P-DEN-RECON-DT     PIC X(8).
000704     05  FILLER             PIC X(7)  VALUE
000705         '  CODE-'.
000706     05  P-DEN-CODE         PIC X(4).
000707
000708 01  P-DEN-LINE-2.
000709     05  FILLER             PIC X(10) VALUE  SPACES.
000710     05  P-DEN-TEXT-1       PIC X(60).
000711
000712 01  P-DEN-LINE-3.
000713     05  FILLER             PIC X(10) VALUE  SPACES.
000714     05  P-DEN-TEXT-2       PIC X(60).
000715
000716 01  P-CHG-LINE-1.
000717     05  FILLER             PIC X(11) VALUE
000718         'INCUR CHG  '.
000719     05  FILLER             PIC X     VALUE  SPACE.
000720     05  P-CHG-REC-DT       PIC X(8).
000721     05  FILLER             PIC X     VALUE SPACES.
000722     05  P-CHG-BY           PIC X(4).
000723     05  FILLER             PIC X(1)  VALUE  SPACES.
000724     05  FILLER             PIC X(8)  VALUE
000725         'INCURED-'.
000726     05  P-CHG-INC-DT       PIC X(8).
000727     05  FILLER             PIC X     VALUE  SPACES.
000728     05  L-1-PD-THRU        PIC X(8)  VALUE
000729         'PD THRU-'.
000730     05  P-CHG-PAID-TO-DT   PIC X(8).
000731     05  FILLER             PIC X(15) VALUE
000732         '  INIT MAN RES-'.
000733     05  P-CHG-INIT-RES     PIC Z(7).99.
000734
000735 01  P-CHG-LINE-2.
000736     05  FILLER             PIC X(22) VALUE  SPACES.
000737     05  FILLER             PIC X(9)  VALUE
000738         'REPORTED-'.
000739     05  P-CHG-REP-DT       PIC X(8).
000740     05  FILLER             PIC X(9)  VALUE
000741         ' TOT PD -'.
000742     05  P-CHG-TOT-PD       PIC Z(5).99.
000743     05  FILLER             PIC X(14) VALUE
000744         ' CUR MAN RES -'.
000745     05  P-CHG-CUR-RES      PIC Z(7).99.
000746
000747 01  P-CHG-LINE-3.
000748     05  FILLER             PIC X(13) VALUE
000749         'TOT EXPENSE -'.
000750     05  P-CHG-TOT-EXP      PIC Z(6).99.
000751     05  FILLER             PIC X(10) VALUE
000752         ' CREATED -'.
000753     05  P-CHG-CREAT-DT     PIC X(8).
000754     05  FILLER             PIC X(10) VALUE
000755         '  DAYS PD-'.
000756     05  P-CHG-DAYS-PD      PIC Z(5).
000757     05  FILLER             PIC X(5)  VALUE  SPACE.
000758     05  FILLER             PIC X(10) VALUE
000759         'ADD- RES -'.
000760     05  P-CHG-ADD-RES      PIC Z(7).99.
000761
000762 01  P-CHG-LINE-4.
000763     05  FILLER             PIC X(13) VALUE
000764         'CHG EXPENSE -'.
000765     05  P-CHG-CHG-EXP      PIC Z(6).99.
000766     05  FILLER             PIC X(10) VALUE
000767         ' LAST PMT-'.
000768     05  P-CHG-LAST-PMT-DT  PIC X(8).
000769     05  FILLER             PIC X     VALUE  SPACES.
000770     05  FILLER             PIC X(8)  VALUE
000771         'PMTS   -'.
000772     05  P-CHG-PMTS         PIC ZZ9.
000773     05  FILLER             PIC X(7)  VALUE   SPACES.
000774     05  FILLER             PIC X(17) VALUE
000775         'TOT TRLRS   -    '.
000776     05  P-CHG-TOT-TRLRS    PIC ZZZ9.
000777
000778 01  P-2-LINE-6.
000779     05  FILLER             PIC X(28) VALUE
000780         '- - OPEN / CLOSE HISTORY - -'.
000781
000782 01  P-2-LINE-8.
000783     05  FILLER             PIC X(27) VALUE
000784         '  DATE    OPEN/CLOSE  CAUSE'.
000785
000786 01  P-2-HIS-DETAIL.
000787     05  P-2-HIS-DATE       PIC X(8).
000788     05  FILLER             PIC X(4)  VALUE SPACES.
000789     05  P-2-HIS-OPCL       PIC X(6).
000790     05  FILLER             PIC X(4)  VALUE SPACES.
000791     05  P-2-HIS-CAUSE      PIC X(10).
000792
000793 01  P-2-AUT-LINE-1.
000794     05  FILLER             PIC X(35) VALUE
000795         '- - AUTOMATIC PAYMENT SCHEDULES - -'.
000796
000797 01  P-2-AUT-LINE-2.
000798     05  FILLER             PIC X(22) VALUE
000799         'ESTABLISHED ON      - '.
000800     05  P-2-EST-DT         PIC X(8).
000801     05  FILLER             PIC X(10)   VALUE SPACES.
000802     05  FILLER             PIC X(22)   VALUE
000803         'ESTABLISHED BY      - '.
000804     05  P-2-EST-BY         PIC X(8).
000805
000806 01  P-2-AUT-LINE-3.
000807     05  FILLER             PIC X(22)   VALUE
000808         'EFFECTIVE DATE      - '.
000809     05  P-2-EFF-DT         PIC X(8).
000810     05  FILLER             PIC X(10)   VALUE SPACES.
000811     05  FILLER             PIC X(22)   VALUE
000812         'ENDED / REPLACED    - '.
000813     05  P-2-END-DT         PIC X(8).
000814
000815 01  P-2-AUT-LINE-4.
000816     05  P-2-1ST-PMT-DT     PIC X(22)   VALUE
000817         'FIRST PAYMENT DATE  - '.
000818     05  P-2-1ST-PMT-ON     PIC X(8).
000819     05  FILLER             PIC X(10)   VALUE SPACES.
000820     05  P-2-LST-PMT-DT     PIC X(22)   VALUE
000821         'LAST PAYMENT ON     - '.
000822     05  P-2-LST-PMT-ON     PIC X(8).
000823
000824 01  P-2-AUT-LINE-5.
000825     05  FILLER             PIC X(22)   VALUE
000826         'FIRST PAYMENT AMT   - '.
000827     05  P-2-1ST-PMT        PIC ZZZZ,ZZZ.99.
000828     05  FILLER             PIC X(7)    VALUE SPACES.
000829     05  FILLER             PIC X(22)   VALUE
000830         'REGULAR PAYMENT AMT - '.
000831     05  P-2-REG-PMT        PIC ZZZZ,ZZZ.99.
000832
000833 01  P-2-AUT-LINE-6.
000834     05  FILLER             PIC X(22)   VALUE
000835         'DAYS IN 1ST PERIOD  - '.
000836     05  P-2-DAYS-1ST       PIC 9(4).
000837*    05  FILLER             PIC X(14)   VALUE SPACES.
000838*    05  FILLER             PIC X(22)   VALUE
000839*        'DAYS IN REGULAR PMT - '.
000840*    05  P-2-DAYS-REG       PIC X(3).
000841
000842 01  P-2-AUT-LINE-7.
000843     05  FILLER             PIC X(22)   VALUE
000844         'LAST PAYMENT FINAL  - '.
000845     05  P-2-LAST-FINAL     PIC X(3).
000846     05  FILLER             PIC X(15)   VALUE SPACES.
000847     05  FILLER             PIC X(22)   VALUE
000848         'PAYEE               - '.
000849     05  P-2-PAYEE          PIC X(17).
000850
000851 01  P-2-AUT-LINE-8.
000852     05  FILLER             PIC X(40)   VALUE  SPACES.
000853     05  FILLER             PIC X(22)   VALUE
000854         'MONTHS BETWEEN PMTS - '.
000855     05  P-2-MOS-BET        PIC 9(3).
000856
000857 01  P-2-ADD-LINE-1.
000858     05  FILLER             PIC X(25)   VALUE
000859         '- - ADDRESSES ON FILE - -'.
000860
000861 01  P-2-ADD-LINE-2.
000862     05  FILLER             PIC X(7)    VALUE
000863         'TYPE - '.
000864     05  P-2-ADD-TYPE       PIC X(15).
000865     05  FILLER             PIC X(2)    VALUE SPACES.
000866     05  FILLER             PIC X(7)    VALUE
000867         'CODE - '.
000868     05  P-2-ADD-CODE       PIC X.
000869     05  FILLER             PIC X(02)   VALUE SPACES.
000870     05  FILLER             PIC X(15)   VALUE
000871         'MAIL TO NAME - '.
000872     05  P-2-ADD-NAME       PIC X(30).
000873
000874 01  P-2-ADD-LINE-3.
000875     05  FILLER             PIC X(34)   VALUE  SPACES.
000876     05  FILLER             PIC X(13)   VALUE
000877         'ADDRESS 1  - '.
000878     05  P-2-ADD-ADDR-1     PIC X(30).
000879
000880 01  P-2-ADD-LINE-4.
000881     05  FILLER             PIC X(34)   VALUE  SPACES.
000882     05  FILLER             PIC X(13)   VALUE
000883         'ADDRESS 2  - '.
000884     05  P-2-ADD-ADDR-2     PIC X(30).
000885
000886 01  P-2-ADD-LINE-5.
000887     05  FILLER             PIC X(34)   VALUE  SPACES.
000888     05  FILLER             PIC X(13)   VALUE
000889         'CITY STATE - '.
000890     05  P-2-ADD-CITY       PIC X(30).
000891
000892 01  P-2-ADD-LINE-6.
000893     05  FILLER             PIC X(34)   VALUE  SPACES.
000894     05  FILLER             PIC X(13)   VALUE
000895         'ZIP  PHONE - '.
000896     05  P-2-ADD-ZIP        PIC X(10).
000897     05  FILLER             PIC X(8)    VALUE   SPACES.
000898     05  P-2-ADD-PHONE      PIC X(12).
000899
000900
000901 01  P-FORM-LINE-1.
000902     05  FILLER              PIC X(11)  VALUE
000903         'FORM CTL'.
000904     05  FILLER             PIC X     VALUE  SPACE.
000905     05  P-FORM-LET-DT       PIC X(8).
000906     05  FILLER              PIC X      VALUE SPACE.
000907     05  P-FORM-BY           PIC X(4).
000908     05  FILLER              PIC X(14)  VALUE
000909         '  ADDRESSEE - '.
000910     05  P-FORM-ADSEE        PIC X(30).
000911     05  FILLER              PIC X(8)   VALUE
000912         ' CODE - '.
000913     05  P-FORM-ADSEE-CD     PIC X(3).
000914
000915 01  P-FORM-LINE-2.
000916     05  FILLER              PIC X(23)  VALUE  SPACES.
000917     05  FILLER              PIC X(7)   VALUE
000918         'FORM - '.
000919     05  P-FORM-FORM         PIC X(4).
000920     05  FILLER              PIC X(9)   VALUE
000921         '  SENT - '.
000922     05  P-FORM-SENT-DT      PIC X(8).
000923     05  FILLER              PIC X(12)  VALUE
000924         '  RE-SEND - '.
000925     05  P-FORM-SEND-DT      PIC X(8).
000926
000927 01  P-FORM-LINE-3.
000928     05  FILLER              PIC X(23)  VALUE  SPACES.
000929     05  FILLER              PIC X(12)  VALUE
000930         'FOLLOW UP - '.
000931     05  P-FORM-FOL-DT       PIC X(8).
000932     05  FILLER              PIC X(25)  VALUE
000933         '     CLAIMANT ANSWERED - '.
000934     05  P-CLM-FORM-ANS-DT   PIC X(8).
000935
000936 01  P-FORM-LINE-4.
000937     05  FILLER              PIC X(23)  VALUE  SPACES.
000938     05  P-PHY-FORM-COMM     PIC X(17)  VALUE
000939         'PHY.  ANSWERED - '.
000940     05  P-PHY-FORM-ANS-DT   PIC X(8).
000941     05  P-EMP-FORM-COMM     PIC X(20)  VALUE
000942         '   EMP.  ANSWERED - '.
000943     05  P-EMP-FORM-ANS-DT   PIC X(8).
000944
000945 01  P-FORM-LINE-5.
000946     05  FILLER             PIC X(23)   VALUE SPACES.
000947     05  FILLER             PIC X(15)   VALUE
000948         'INSTRUCTIONS - '.
000949     05  P-FORM-INSTRUCT    PIC X(28).
000950
000951 01  P-FORM-LINE-6.
000952     05  FILLER             PIC X(38)   VALUE SPACES.
000953     05  P-FORM-INSTRUCT-1  PIC X(28).
000954
000955 01  P-FORM-LINE-7.
000956     05  FILLER             PIC X(23)   VALUE SPACES.
000957     05  FILLER             PIC X(16)   VALUE
000958         'RELATED CLAIM - '.
000959     05  P-FORM-CLAIM       PIC X(7).
000960     05  FILLER             PIC X(12)   VALUE
000961         '  CARRIER - '.
000962     05  P-FORM-CARRIER     PIC X.
000963     05  FILLER             PIC X(9)    VALUE
000964         '  CERT - '.
000965     05  P-FORM-CERT        PIC X(8).
000966
000967 01  AUTO-PAY-TABLE.
000968     05  AUTO-PAY-RECORD    OCCURS 10 TIMES  INDEXED BY AP-INDEX.
000969         10  AP-TBL-EST-DT             PIC XX.
000970         10  AP-TBL-EST-BY             PIC XXXX.
000971         10  AP-TBL-SCHED-START-DT     PIC XX.
000972         10  AP-TBL-SCHED-END-DT       PIC XX.
000973         10  AP-TBL-TERM-DT            PIC XX.
000974         10  AP-TBL-LAST-TYPE          PIC X.
000975         10  AP-TBL-FIRST-AMT          PIC S9(7)V99 COMP-3.
000976         10  AP-TBL-FIRST-DAYS         PIC S9(4) COMP.
000977         10  AP-TBL-FIRST-DT           PIC XX.
000978         10  AP-TBL-REG-AMT            PIC S9(7)V99  COMP-3.
000979         10  AP-TBL-REG-MO             PIC S9(4) COMP.
000980         10  AP-TBL-INT-MO             PIC XX.
000981
000982 01  ADDRESS-TABLE.
000983     05  ADDRESS-RECORD    OCCURS 60 TIMES  INDEXED BY AD-INDEX.
000984         10  AD-TBL-TYPE               PIC X.
000985         10  AD-TBL-NAME               PIC X(30).
000986         10  AD-TBL-ADDR-1             PIC X(30).
000987         10  AD-TBL-ADDR-2             PIC X(30).
000988         10  AD-TBL-CITY               PIC X(30).
000989         10  AD-TBL-ZIP                PIC X(10).
000990         10  AD-TBL-PHONE              PIC 9(11) COMP-3.
000991
000992 01  OPEN-CLOSE-TABLE.
000993     05  AUTO-PAY-RECORD    OCCURS 6 TIMES  INDEXED BY OC-INDEX.
000994         10  OC-TBL-OPCL-DT            PIC XX.
000995         10  OC-TBL-OPCL-TYPE          PIC X.
000996         10  OC-TBL-OPCL-REASON        PIC X(5).
000997
000998*                                    COPY ELCAID.
      *>>((file: ELCAID))
000001******************************************************************
000002*                                                                *
000003*                            ELCAID.                             *
000004*                            VMOD=2.001                          *
000005*                                                                *
000006*   DESCRIPTION:  ATTENTION IDENTIFER CHARACTERS.                *
000007*                                                                *
000008*  NO  CID  MODS  IN  COPYBOOK  ELCAID                           *
000009*  051007  2007041300002 Change PF22 from x'D5' to x'5B'
000010******************************************************************
000011
000012 01  DFHAID.
000013   02  DFHNULL   PIC  X  VALUE  ' '.
000014   02  DFHENTER  PIC  X  VALUE  QUOTE.
000015   02  DFHCLEAR  PIC  X  VALUE  '_'.
000016   02  DFHPEN    PIC  X  VALUE  '='.
000017   02  DFHOPID   PIC  X  VALUE  'W'.
000018   02  DFHPA1    PIC  X  VALUE  '%'.
000019   02  DFHPA2    PIC  X  VALUE  '>'.
000020   02  DFHPA3    PIC  X  VALUE  ','.
000021   02  DFHPF1    PIC  X  VALUE  '1'.
000022   02  DFHPF2    PIC  X  VALUE  '2'.
000023   02  DFHPF3    PIC  X  VALUE  '3'.
000024   02  DFHPF4    PIC  X  VALUE  '4'.
000025   02  DFHPF5    PIC  X  VALUE  '5'.
000026   02  DFHPF6    PIC  X  VALUE  '6'.
000027   02  DFHPF7    PIC  X  VALUE  '7'.
000028   02  DFHPF8    PIC  X  VALUE  '8'.
000029   02  DFHPF9    PIC  X  VALUE  '9'.
000030   02  DFHPF10   PIC  X  VALUE  ':'.
000031   02  DFHPF11   PIC  X  VALUE  '#'.
000032   02  DFHPF12   PIC  X  VALUE  '@'.
000033   02  DFHPF13   PIC  X  VALUE  'A'.
000034   02  DFHPF14   PIC  X  VALUE  'B'.
000035   02  DFHPF15   PIC  X  VALUE  'C'.
000036   02  DFHPF16   PIC  X  VALUE  'D'.
000037   02  DFHPF17   PIC  X  VALUE  'E'.
000038   02  DFHPF18   PIC  X  VALUE  'F'.
000039   02  DFHPF19   PIC  X  VALUE  'G'.
000040   02  DFHPF20   PIC  X  VALUE  'H'.
000041   02  DFHPF21   PIC  X  VALUE  'I'.
000042*00039    02  DFHPF22   PIC  X  VALUE  'Õ'.
000043   02  DFHPF22   PIC  X  VALUE  '['.
000044   02  DFHPF23   PIC  X  VALUE  '.'.
000045   02  DFHPF24   PIC  X  VALUE  '<'.
000046   02  DFHMSRE   PIC  X  VALUE  'X'.
000047   02  DFHSTRF   PIC  X  VALUE  'h'.
000048   02  DFHTRIG   PIC  X  VALUE  '"'.
      *<<((file: ELCAID))
000999 01  PF-AID REDEFINES DFHAID.
001000     05  FILLER                      PIC X(8).
001001     05  PF-VALUES  OCCURS 24    PIC X.
001002     EJECT
001003*                                COPY ELCALGND.
      *>>((file: ELCALGND))
000001******************************************************************
000002*                                                                *
000003*                            ELCALGND.                           *
000004*                            VMOD=2.001                          *
000005*                                                                *
000006*  NO  CID  MODS  IN  COPYBOOK  ELCALGND                         *
000007******************************************************************
000008***   WORK AREAS  FOR FIELD ALIGN  ROUTINE
000009***                 -ELALGND-
000010***   TO BE USED WITH PROCEDURE COPY MEMBER -ELALGNP-
000011***   SEE DESCRIPTION OF FUNCTION AND INSTRUCTIONS IN -ELALGNP-
000012******************************************************************
000013
000014 01  REQUIRED-FIELDS.
000015***         WS-UNALIGNED-FIELD    (PRESET TO BLANKS)
000016***         WS-ALIGNED-FIELD      (THE FIELD TO BE ALIGNED)
000017***         WS-NAME-LENGTH      (LENGTH OF FIELD TO BE ALIGNED)
000018*************************************
000019*************************************
000020     05  WS-UNALIGNED-FIELD              PIC X(30) VALUE SPACES.
000021     05  WS-UNALIGNED-BYTE  REDEFINES WS-UNALIGNED-FIELD
000022                  OCCURS 30  INDEXED BY NAME-IND  PIC X.
000023
000024     05  WS-ALIGNED-FIELD             PIC X(30) VALUE SPACES.
000025     05  WS-UNALIGNED-BYTE-A  REDEFINES WS-ALIGNED-FIELD
000026                  OCCURS 30  INDEXED BY NAME-IND-A  PIC X.
000027
000028     05  WS-LENGTH-FOUND-SW          PIC X   VALUE LOW-VALUES.
000029         88  LENGTH-FOUND            VALUE HIGH-VALUES.
000030
000031     05  WS-SPACE-COUNTER            PIC S9(4)       VALUE ZEROS.
000032
000033     05  WS-NAME-LENGTH              PIC S9(4)       VALUE +30.
000034
000035     05  WS-ACTUAL-NAME-LENGTH       PIC S9(4)       VALUE ZEROS.
000036
000037     05  WS-HALF-BLANKS              PIC S9(4)       VALUE ZEROS.
000038
000039******************************************************************
      *<<((file: ELCALGND))
001004     EJECT
001005*                                COPY ELPRTCVD.
      *>>((file: ELPRTCVD))
000001*****************************************************************
000002*                                                               *
000003*                            ELPRTCVD.                          *
000004*                            VMOD=2.001                         *
000005*****************************************************************.
000006
000007******************************************************************
000008***   WORK AREAS  FOR TERMINAL ONLINE PRINT ROUTINE
000009***                 -ELPRTCVD-
000010***   TO BE USED WITH PROCEDURE COPY MEMBER -ELPRTCVP-
000011******************************************************************
000012
000013 01  S-WORK-AREA                     SYNC.
000014     12  WS-LINE-LEN                 PIC S9(4)       VALUE +80
000015                                     COMP.
000016
000017     12  WS-LINE-LENGTH              PIC S9(4)       VALUE ZERO
000018                                     COMP.
000019
000020     12  WS-BUFFER-SIZE              PIC S9(4)       VALUE +1916
000021                                     COMP.
000022
000023     12  WS-BUFFER-LENGTH            PIC S9(4)       VALUE ZERO
000024                                     COMP.
000025
000026     12  WS-PROG-END                 PIC X           VALUE SPACES.
000027
000028     12  WS-PRINT-AREA.
000029         16  WS-PASSED-CNTL-CHAR     PIC X           VALUE SPACES.
000030           88  SINGLE-SPACE                          VALUE ' '.
000031           88  DOUBLE-SPACE                          VALUE '0'.
000032           88  TRIPLE-SPACE                          VALUE '-'.
000033           88  TOP-PAGE                              VALUE '1'.
000034
000035         16  WS-PASSED-DATA.
000036             20  WS-PRINT-BYTE       PIC X
000037                 OCCURS 132 TIMES    INDEXED BY PRT-INDEX.
000038
000039     12  WS-LINE-CNT                 PIC S9(3)        VALUE ZERO
000040                                     COMP-3.
000041     12  WS-WCC-CNTL                 PIC X(1)         VALUE 'H'.
000042
000043     12  WS-EM                       PIC S9(4)        VALUE +25
000044                                     COMP.
000045     12  FILLER   REDEFINES WS-EM.
000046         16  FILLER                  PIC X.
000047         16  T-EM                    PIC X.
000048
000049*    12  WS-SS                       PIC S9(4)        VALUE +21
000050     12  WS-SS                       PIC S9(4)        VALUE +10
000051                                     COMP.
000052     12  FILLER   REDEFINES WS-SS.
000053         16  FILLER                  PIC X.
000054         16  T-SS                    PIC X.
000055
000056     12  WS-TP                       PIC S9(4)      VALUE +12
000057                                     COMP.
000058     12  FILLER   REDEFINES WS-TP.
000059         16  FILLER                  PIC X.
000060         16  T-TP                    PIC X.
000061
000062     12  WS-FIRST-TIME-SW            PIC X           VALUE '1'.
000063         88  FIRST-TIME                              VALUE '1'.
000064         88  FIRST-LINE-NEXT-BUFFER                  VALUE '2'.
000065
000066     12  WS-BUFFER-AREA.
000067         16  WS-BUFFER-BYTE          PIC X
000068             OCCURS 1920 TIMES       INDEXED BY BUFFER-INDEX
000069                                                BUFFER-INDEX2.
000070
000071******************************************************************
      *<<((file: ELPRTCVD))
001006     EJECT
001007*                                COPY ELCINTF.
      *>>((file: ELCINTF))
000001******************************************************************
000002*                                                                *
000003*                                                                *
000004*                            ELCINTF.                            *
000005*                            VMOD=2.017                          *
000006*                                                                *
000007*   FILE DESCRIPTION = C.I.C.S. COMMON DATA AREA                 *
000008*                                                                *
000009*       LENGTH = 1024                                            *
000010*                                                                *
000011******************************************************************
000012*                   C H A N G E   L O G
000013*
000014* CHANGES ARE MARKED BY THE CHANGE EFFECTIVE DATE.
000015*-----------------------------------------------------------------
000016*  CHANGE   CHANGE REQUEST PGMR  DESCRIPTION OF CHANGE
000017* EFFECTIVE    NUMBER
000018*-----------------------------------------------------------------
000019* 011812    2011022800001  AJRA  ADD CSR IND TO USER SECURITY
000020******************************************************************
000021 01  PROGRAM-INTERFACE-BLOCK.
000022     12  PI-COMM-LENGTH                PIC S9(4) COMP VALUE +1024.
000023     12  PI-CALLING-PROGRAM              PIC X(8).
000024     12  PI-SAVED-PROGRAM-1              PIC X(8).
000025     12  PI-SAVED-PROGRAM-2              PIC X(8).
000026     12  PI-SAVED-PROGRAM-3              PIC X(8).
000027     12  PI-SAVED-PROGRAM-4              PIC X(8).
000028     12  PI-SAVED-PROGRAM-5              PIC X(8).
000029     12  PI-SAVED-PROGRAM-6              PIC X(8).
000030     12  PI-RETURN-TO-PROGRAM            PIC X(8).
000031     12  PI-COMPANY-ID                   PIC XXX.
000032     12  PI-COMPANY-CD                   PIC X.
000033
000034     12  PI-COMPANY-PASSWORD             PIC X(8).
000035
000036     12  PI-JOURNAL-FILE-ID              PIC S9(4) COMP.
000037
000038     12  PI-CONTROL-IN-PROGRESS.
000039         16  PI-CARRIER                  PIC X.
000040         16  PI-GROUPING                 PIC X(6).
000041         16  PI-STATE                    PIC XX.
000042         16  PI-ACCOUNT                  PIC X(10).
000043         16  PI-PRODUCER REDEFINES PI-ACCOUNT
000044                                         PIC X(10).
000045         16  PI-CLAIM-CERT-GRP.
000046             20  PI-CLAIM-NO             PIC X(7).
000047             20  PI-CERT-NO.
000048                 25  PI-CERT-PRIME       PIC X(10).
000049                 25  PI-CERT-SFX         PIC X.
000050             20  PI-CERT-EFF-DT          PIC XX.
000051         16  PI-PLAN-DATA REDEFINES PI-CLAIM-CERT-GRP.
000052             20  PI-PLAN-CODE            PIC X(2).
000053             20  PI-REVISION-NUMBER      PIC X(3).
000054             20  PI-PLAN-EFF-DT          PIC X(2).
000055             20  PI-PLAN-EXP-DT          PIC X(2).
000056             20  FILLER                  PIC X(11).
000057         16  PI-OE-REFERENCE-1 REDEFINES PI-CLAIM-CERT-GRP.
000058             20  PI-OE-REFERENCE-1.
000059                 25  PI-OE-REF-1-PRIME   PIC X(18).
000060                 25  PI-OE-REF-1-SUFF    PIC XX.
000061
000062     12  PI-SESSION-IN-PROGRESS          PIC X.
000063         88  CLAIM-SESSION                   VALUE '1'.
000064         88  CREDIT-SESSION                  VALUE '2'.
000065         88  WARRANTY-SESSION                VALUE '3'.
000066         88  MORTGAGE-SESSION                VALUE '4'.
000067         88  GENERAL-LEDGER-SESSION          VALUE '5'.
000068
000069
000070*THE FOLLOWING TWO FIELDS ARE USED ONLY WITH MULTI COMPANY CLIENTS
000071
000072     12  PI-ORIGINAL-COMPANY-ID          PIC X(3).
000073     12  PI-ORIGINAL-COMPANY-CD          PIC X.
000074
000075     12  PI-CREDIT-USER                  PIC X.
000076         88  PI-NOT-CREDIT-USER              VALUE 'N'.
000077         88  PI-HAS-CLAS-IC-CREDIT           VALUE 'Y'.
000078
000079     12  PI-CLAIM-USER                   PIC X.
000080         88  PI-NOT-CLAIM-USER               VALUE 'N'.
000081         88  PI-HAS-CLAS-IC-CLAIM            VALUE 'Y'.
000082
000083     12  PI-PROCESSOR-SYS-ACCESS         PIC X.
000084         88  PI-ACCESS-TO-BOTH-SYSTEMS       VALUE ' '.
000085         88  PI-ACCESS-TO-ALL-SYSTEMS        VALUE ' '.
000086         88  PI-ACCESS-TO-CLAIM-ONLY         VALUE '1'.
000087         88  PI-ACCESS-TO-CREDIT-ONLY        VALUE '2'.
000088         88  PI-ACCESS-TO-MORTGAGE-ONLY      VALUE '3'.
000089
000090     12  PI-PROCESSOR-ID                 PIC X(4).
000091
000092     12  PI-PROCESSOR-PASSWORD           PIC X(11).
000093
000094     12  PI-MEMBER-CAPTION               PIC X(10).
000095
000096     12  PI-PROCESSOR-USER-ALMIGHTY      PIC X.
000097         88  PI-USER-ALMIGHTY-YES            VALUE 'Y'.
000098
000099     12  PI-LIFE-OVERRIDE-L1             PIC X.
000100     12  PI-LIFE-OVERRIDE-L2             PIC XX.
000101     12  PI-LIFE-OVERRIDE-L6             PIC X(6).
000102     12  PI-LIFE-OVERRIDE-L12            PIC X(12).
000103
000104     12  PI-AH-OVERRIDE-L1               PIC X.
000105     12  PI-AH-OVERRIDE-L2               PIC XX.
000106     12  PI-AH-OVERRIDE-L6               PIC X(6).
000107     12  PI-AH-OVERRIDE-L12              PIC X(12).
000108
000109     12  PI-NEW-SYSTEM                   PIC X(2).
000110
000111     12  PI-PRIMARY-CERT-NO              PIC X(11).
000112     12  PI-CLAIM-PAID-THRU-TO           PIC X(01).
000113         88  PI-USES-PAID-TO                 VALUE '1'.
000114     12  PI-CRDTCRD-SYSTEM.
000115         16  PI-CRDTCRD-USER             PIC X.
000116             88  PI-NOT-CRDTCRD-USER         VALUE 'N'.
000117             88  PI-HAS-CLAS-IC-CRDTCRD      VALUE 'Y'.
000118         16  PI-CC-MONTH-END-DT          PIC XX.
000119     12  PI-PROCESSOR-PRINTER            PIC X(4).
000120
000121     12  PI-OE-REFERENCE-2.
000122         16  PI-OE-REF-2-PRIME           PIC X(10).
000123         16  PI-OE-REF-2-SUFF            PIC X.
000124
000125     12  PI-REM-TRM-CALC-OPTION          PIC X.
000126
000127     12  PI-LANGUAGE-TYPE                PIC X.
000128             88  PI-LANGUAGE-IS-ENG          VALUE 'E'.
000129             88  PI-LANGUAGE-IS-FR           VALUE 'F'.
000130             88  PI-LANGUAGE-IS-SPAN         VALUE 'S'.
000131
000132     12  PI-POLICY-LINKAGE-IND           PIC X.
000133         88  PI-USE-POLICY-LINKAGE           VALUE 'Y'.
000134         88  PI-POLICY-LINKAGE-NOT-USED      VALUE 'N'
000135                                                   LOW-VALUES.
000136
000137     12  PI-ALT-DMD-PRT-ID               PIC X(4).
000138     12  PI-CLAIM-PW-SESSION             PIC X(1).
000139         88  PI-CLAIM-CREDIT                 VALUE '1'.
000140         88  PI-CLAIM-CONVEN                 VALUE '2'.
000141
000142     12  PI-PROCESSOR-CSR-IND            PIC X.
000143         88  PI-PROCESSOR-IS-CSR             VALUE 'Y' 'S'.
000144         88  PI-PROCESSOR-IS-CSR-SUPER       VALUE 'S'.
000145
000146     12  FILLER                          PIC X(3).
000147
000148     12  PI-SYSTEM-LEVEL                 PIC X(145).
000149
000150     12  PI-CLAIMS-CREDIT-LEVEL          REDEFINES
000151         PI-SYSTEM-LEVEL.
000152
000153         16  PI-ENTRY-CODES.
000154             20  PI-ENTRY-CD-1           PIC X.
000155             20  PI-ENTRY-CD-2           PIC X.
000156
000157         16  PI-RETURN-CODES.
000158             20  PI-RETURN-CD-1          PIC X.
000159             20  PI-RETURN-CD-2          PIC X.
000160
000161         16  PI-UPDATE-STATUS-SAVE.
000162             20  PI-UPDATE-BY            PIC X(4).
000163             20  PI-UPDATE-HHMMSS        PIC S9(7)     COMP-3.
000164
000165         16  PI-LOWER-CASE-LETTERS       PIC X.
000166             88  LOWER-CASE-LETTERS-USED     VALUE 'Y'.
000167
000168*        16  PI-CLAIM-ACCESS-CONTROL     PIC X.
000169*            88  CLAIM-NO-UNIQUE             VALUE '1'.
000170*            88  CARRIER-CLM-CNTL            VALUE '2'.
000171
000172         16  PI-CERT-ACCESS-CONTROL      PIC X.
000173             88  ST-ACCNT-CNTL               VALUE ' '.
000174             88  CARR-GROUP-ST-ACCNT-CNTL    VALUE '1'.
000175             88  CARR-ST-ACCNT-CNTL          VALUE '2'.
000176             88  ACCNT-CNTL                  VALUE '3'.
000177             88  CARR-ACCNT-CNTL             VALUE '4'.
000178
000179         16  PI-PROCESSOR-CAP-LIST.
000180             20  PI-SYSTEM-CONTROLS.
000181                24 PI-SYSTEM-DISPLAY     PIC X.
000182                 88  SYSTEM-DISPLAY-CAP      VALUE 'Y'.
000183                24 PI-SYSTEM-MODIFY      PIC X.
000184                 88  SYSTEM-MODIFY-CAP       VALUE 'Y'.
000185             20  FILLER                  PIC XX.
000186             20  PI-DISPLAY-CAP          PIC X.
000187                 88  DISPLAY-CAP             VALUE 'Y'.
000188             20  PI-MODIFY-CAP           PIC X.
000189                 88  MODIFY-CAP              VALUE 'Y'.
000190             20  PI-MSG-AT-LOGON-CAP     PIC X.
000191                 88  MSG-AT-LOGON-CAP        VALUE 'Y'.
000192             20  PI-FORCE-CAP            PIC X.
000193                 88  FORCE-CAP               VALUE 'Y'.
000194
000195         16  PI-PROGRAM-CONTROLS.
000196             20  PI-PGM-PRINT-OPT        PIC X.
000197             20  PI-PGM-FORMAT-OPT       PIC X.
000198             20  PI-PGM-PROCESS-OPT      PIC X.
000199             20  PI-PGM-TOTALS-OPT       PIC X.
000200
000201         16  PI-HELP-INTERFACE.
000202             20  PI-LAST-ERROR-NO        PIC X(4).
000203             20  PI-CURRENT-SCREEN-NO    PIC X(4).
000204
000205         16  PI-CARRIER-CONTROL-LEVEL    PIC X.
000206             88  CONTROL-IS-ACTUAL-CARRIER   VALUE SPACE.
000207
000208         16  PI-CR-CONTROL-IN-PROGRESS.
000209             20  PI-CR-CARRIER           PIC X.
000210             20  PI-CR-GROUPING          PIC X(6).
000211             20  PI-CR-STATE             PIC XX.
000212             20  PI-CR-ACCOUNT           PIC X(10).
000213             20  PI-CR-FIN-RESP          PIC X(10).
000214             20  PI-CR-TYPE              PIC X.
000215
000216         16  PI-CR-BATCH-NUMBER          PIC X(6).
000217
000218         16  PI-CR-MONTH-END-DT          PIC XX.
000219
000220         16  PI-CAR-GROUP-ACCESS-CNTL    PIC X.
000221             88  PI-USE-ACTUAL-CARRIER       VALUE ' '.
000222             88  PI-ZERO-CARRIER             VALUE '1'.
000223             88  PI-ZERO-GROUPING            VALUE '2'.
000224             88  PI-ZERO-CAR-GROUP           VALUE '3'.
000225
000226         16  PI-CARRIER-SECURITY         PIC X.
000227             88  PI-NO-CARRIER-SECURITY      VALUE ' '.
000228
000229         16  PI-ACCOUNT-SECURITY         PIC X(10).
000230             88  PI-NO-ACCOUNT-SECURITY      VALUE SPACES.
000231             88  PI-NO-PRODUCER-SECURITY     VALUE SPACES.
000232
000233         16  PI-CODE-SECURITY REDEFINES PI-ACCOUNT-SECURITY.
000234             20  PI-ACCESS-CODE          OCCURS 10 TIMES
000235                                         INDEXED BY PI-ACCESS-NDX
000236                                         PIC X.
000237
000238         16  PI-GA-BILLING-CONTROL       PIC X.
000239             88  PI-GA-BILLING               VALUE '1'.
000240
000241         16  PI-MAIL-PROCESSING          PIC X.
000242             88  PI-MAIL-YES                 VALUE 'Y'.
000243
000244         16  PI-SECURITY-TEMP-STORE-ID   PIC X(8).
000245
000246         16  PI-AR-SYSTEM.
000247             20  PI-AR-PROCESSING-CNTL   PIC X.
000248                 88  PI-AR-PROCESSING        VALUE 'Y'.
000249             20  PI-AR-SUMMARY-CODE      PIC X(6).
000250             20  PI-AR-MONTH-END-DT      PIC XX.
000251
000252         16  PI-MP-SYSTEM.
000253             20  PI-MORTGAGE-USER            PIC X.
000254                 88  PI-NOT-MORTGAGE-USER            VALUE 'N'.
000255                 88  PI-HAS-CLAS-IC-MORTGAGE         VALUE 'Y'.
000256             20  PI-MORTGAGE-ACCESS-CONTROL  PIC X.
000257                 88  PI-MP-ST-PROD-CNTL              VALUE ' '.
000258                 88  PI-MP-CARR-GRP-ST-PROD-CNTL     VALUE '1'.
000259                 88  PI-MP-CARR-ST-PROD-CNTL         VALUE '2'.
000260                 88  PI-MP-PROD-CNTL                 VALUE '3'.
000261                 88  PI-MP-CARR-PROD-CNTL            VALUE '4'.
000262             20  PI-MP-MONTH-END-DT          PIC XX.
000263             20  PI-MP-REFERENCE-NO.
000264                 24  PI-MP-REFERENCE-PRIME   PIC X(18).
000265                 24  PI-MP-REFERENCE-SFX     PIC XX.
000266
000267         16  PI-LABEL-CONTROL            PIC X(01).
000268             88  PI-CREATE-LABELS                    VALUE 'Y'.
000269             88  PI-BYPASS-LABELS                    VALUE 'N'.
000270
000271         16  PI-BILL-GROUPING-CODE       PIC X(01).
000272             88  PI-CO-HAS-BILL-GROUPING             VALUE 'Y'.
000273
000274         16  PI-RATE-DEV-AUTHORIZATION   PIC X(01).
000275             88  PI-RATE-DEV-AUTHORIZED              VALUE 'Y'.
000276             88  PI-RATE-DEV-NOT-AUTHORIZED          VALUE 'N'.
000277
000278         16  FILLER                      PIC X(14).
000279
000280     12  PI-PROGRAM-WORK-AREA            PIC X(640).
000281******************************************************************
      *<<((file: ELCINTF))
001008     12  WS-INT-BLK REDEFINES PI-PROGRAM-WORK-AREA.
001009         16  FILLER                 PIC X.
001010         16  WS-PI-NAME             PIC X(30).
001011         16  FILLER                 PIC X(609).
001012
001013     EJECT
001014*                                COPY ELCATTR.
      *>>((file: ELCATTR))
000001******************************************************************
000002*                                                                *
000003*                            ELCATTR.                            *
000004*                            VMOD=2.001                          *
000005*                                                                *
000006*             LIST OF STANDARD ATTRIBUTE VALUES                  *
000007*                                                                *
000008*   THE DATA NAMES IN THIS COPY BOOK WERE ASSIGNED AS FOLLOWS:   *
000009*                                                                *
000010*                   POS 1   P=PROTECTED                          *
000011*                           U=UNPROTECTED                        *
000012*                           S=ASKIP                              *
000013*                   POS 2   A=ALPHA/NUMERIC                      *
000014*                           N=NUMERIC                            *
000015*                   POS 3   N=NORMAL                             *
000016*                           B=BRIGHT                             *
000017*                           D=DARK                               *
000018*                   POS 4-5 ON=MODIFIED DATA TAG ON              *
000019*                           OF=MODIFIED DATA TAG OFF             *
000020*                                                                *
000021*  NO  CID  MODS  IN  COPYBOOK  ELCATTR                          *
000022******************************************************************
000023 01  ATTRIBUTE-LIST.
000024     12  AL-PABOF            PIC X       VALUE 'Y'.
000025     12  AL-PABON            PIC X       VALUE 'Z'.
000026     12  AL-PADOF            PIC X       VALUE '%'.
000027     12  AL-PADON            PIC X       VALUE '_'.
000028     12  AL-PANOF            PIC X       VALUE '-'.
000029     12  AL-PANON            PIC X       VALUE '/'.
000030     12  AL-SABOF            PIC X       VALUE '8'.
000031     12  AL-SABON            PIC X       VALUE '9'.
000032     12  AL-SADOF            PIC X       VALUE '@'.
000033     12  AL-SADON            PIC X       VALUE QUOTE.
000034     12  AL-SANOF            PIC X       VALUE '0'.
000035     12  AL-SANON            PIC X       VALUE '1'.
000036     12  AL-UABOF            PIC X       VALUE 'H'.
000037     12  AL-UABON            PIC X       VALUE 'I'.
000038     12  AL-UADOF            PIC X       VALUE '<'.
000039     12  AL-UADON            PIC X       VALUE '('.
000040     12  AL-UANOF            PIC X       VALUE ' '.
000041     12  AL-UANON            PIC X       VALUE 'A'.
000042     12  AL-UNBOF            PIC X       VALUE 'Q'.
000043     12  AL-UNBON            PIC X       VALUE 'R'.
000044     12  AL-UNDOF            PIC X       VALUE '*'.
000045     12  AL-UNDON            PIC X       VALUE ')'.
000046     12  AL-UNNOF            PIC X       VALUE '&'.
000047     12  AL-UNNON            PIC X       VALUE 'J'.
      *<<((file: ELCATTR))
001015*                                COPY ELCDATE.
      *>>((file: ELCDATE))
000001******************************************************************
000002*                                                                *
000003*                                                                *
000004*                            ELCDATE.                            *
000005*           COPYBOOK REVIEWED FOR YEAR 2000 COMPLIANCE
000006*                            VMOD=2.003
000007*                                                                *
000008*                                                                *
000009*   DESCRIPTION:  DATA PASSED TO DATE CONVERSION ROUTINE.        *
000010*                 LENGTH = 200                                   *
000011******************************************************************
000012
000013 01  DATE-CONVERSION-DATA.
000014     12  DC-COMM-LENGTH                PIC S9(4) COMP VALUE +200.
000015     12  DC-OPTION-CODE                PIC X.
000016         88  BIN-TO-GREG                VALUE ' '.
000017         88  ELAPSED-BETWEEN-BIN        VALUE '1'.
000018         88  EDIT-GREG-TO-BIN           VALUE '2'.
000019         88  YMD-GREG-TO-BIN            VALUE '3'.
000020         88  MDY-GREG-TO-BIN            VALUE '4'.
000021         88  JULIAN-TO-BIN              VALUE '5'.
000022         88  BIN-PLUS-ELAPSED           VALUE '6'.
000023         88  FIND-CENTURY               VALUE '7'.
000024         88  ELAPSED-BETWEEN-BIN-3      VALUE '8'.
000025         88  EDIT-GREG-TO-BIN-3         VALUE '9'.
000026         88  YMD-GREG-TO-BIN-3          VALUE 'A'.
000027         88  MDY-GREG-TO-BIN-3          VALUE 'B'.
000028         88  JULIAN-TO-BIN-3            VALUE 'C'.
000029         88  BIN-PLUS-ELAPSED-3         VALUE 'D'.
000030         88  JULIAN-EXPANDED-TO-BIN     VALUE 'E'.
000031         88  JULIAN-EXPANDED-TO-BIN-3   VALUE 'F'.
000032         88  BIN-TO-JULIAN-EXPANDED     VALUE 'G'.
000033         88  JULIAN-EXPANDED            VALUE 'E', 'F', 'G'.
000034         88  CHECK-LEAP-YEAR            VALUE 'H'.
000035         88  BIN-3-TO-GREG              VALUE 'I'.
000036         88  CYMD-GREG-TO-BIN-3         VALUE 'J'.
000037         88  MDCY-GREG-TO-BIN-3         VALUE 'K'.
000038         88  CYMD-GREG-TO-BIN           VALUE 'L'.
000039         88  MDCY-GREG-TO-BIN           VALUE 'M'.
000040         88  MDY-GREG-TO-JULIAN         VALUE 'N'.
000041         88  MDCY-GREG-TO-JULIAN        VALUE 'O'.
000042         88  YMD-GREG-TO-JULIAN         VALUE 'P'.
000043         88  CYMD-GREG-TO-JULIAN        VALUE 'Q'.
000044         88  THREE-CHARACTER-BIN
000045                  VALUES  '8' '9' 'A' 'B' 'C' 'D' 'I' 'J' 'K'.
000046         88  GREGORIAN-TO-BIN
000047                  VALUES '2' '3' '4' '9' 'A' 'B' 'J' 'K' 'L' 'M'.
000048         88  BIN-TO-GREGORIAN
000049                  VALUES ' ' '1' 'I' '8' 'G'.
000050         88  JULIAN-TO-BINARY
000051                  VALUES '5' 'C' 'E' 'F'.
000052     12  DC-ERROR-CODE                 PIC X.
000053         88  NO-CONVERSION-ERROR        VALUE ' '.
000054         88  DATE-CONVERSION-ERROR
000055                  VALUES '1' '2' '3' '4' '5' '9' 'A' 'B' 'C'.
000056         88  DATE-IS-ZERO               VALUE '1'.
000057         88  DATE-IS-NON-NUMERIC        VALUE '2'.
000058         88  DATE-IS-INVALID            VALUE '3'.
000059         88  DATE1-GREATER-DATE2        VALUE '4'.
000060         88  ELAPSED-PLUS-NEGATIVE      VALUE '5'.
000061         88  DATE-INVALID-OPTION        VALUE '9'.
000062         88  INVALID-CENTURY            VALUE 'A'.
000063         88  ONLY-CENTURY               VALUE 'B'.
000064         88  ONLY-LEAP-YEAR             VALUE 'C'.
000065         88  VALID-CENTURY-LEAP-YEAR    VALUE 'B', 'C'.
000066     12  DC-END-OF-MONTH               PIC X.
000067         88  CALCULATE-END-OF-MONTH     VALUE '1'.
000068     12  DC-CENTURY-ADJUSTMENT         PIC X   VALUE SPACES.
000069         88  USE-NORMAL-PROCESS         VALUE ' '.
000070         88  ADJUST-DOWN-100-YRS        VALUE '1'.
000071         88  ADJUST-UP-100-YRS          VALUE '2'.
000072     12  FILLER                        PIC X.
000073     12  DC-CONVERSION-DATES.
000074         16  DC-BIN-DATE-1             PIC XX.
000075         16  DC-BIN-DATE-2             PIC XX.
000076         16  DC-GREG-DATE-1-EDIT       PIC X(08).
000077         16  DC-GREG-DATE-1-EDIT-R REDEFINES
000078                       DC-GREG-DATE-1-EDIT.
000079             20  DC-EDIT1-MONTH        PIC 99.
000080             20  SLASH1-1              PIC X.
000081             20  DC-EDIT1-DAY          PIC 99.
000082             20  SLASH1-2              PIC X.
000083             20  DC-EDIT1-YEAR         PIC 99.
000084         16  DC-GREG-DATE-2-EDIT       PIC X(08).
000085         16  DC-GREG-DATE-2-EDIT-R REDEFINES
000086                     DC-GREG-DATE-2-EDIT.
000087             20  DC-EDIT2-MONTH        PIC 99.
000088             20  SLASH2-1              PIC X.
000089             20  DC-EDIT2-DAY          PIC 99.
000090             20  SLASH2-2              PIC X.
000091             20  DC-EDIT2-YEAR         PIC 99.
000092         16  DC-GREG-DATE-1-YMD        PIC 9(06).
000093         16  DC-GREG-DATE-1-YMD-R  REDEFINES
000094                     DC-GREG-DATE-1-YMD.
000095             20  DC-YMD-YEAR           PIC 99.
000096             20  DC-YMD-MONTH          PIC 99.
000097             20  DC-YMD-DAY            PIC 99.
000098         16  DC-GREG-DATE-1-MDY        PIC 9(06).
000099         16  DC-GREG-DATE-1-MDY-R REDEFINES
000100                      DC-GREG-DATE-1-MDY.
000101             20  DC-MDY-MONTH          PIC 99.
000102             20  DC-MDY-DAY            PIC 99.
000103             20  DC-MDY-YEAR           PIC 99.
000104         16  DC-GREG-DATE-1-ALPHA.
000105             20  DC-ALPHA-MONTH        PIC X(10).
000106             20  DC-ALPHA-DAY          PIC 99.
000107             20  FILLER                PIC XX.
000108             20  DC-ALPHA-CENTURY.
000109                 24 DC-ALPHA-CEN-N     PIC 99.
000110             20  DC-ALPHA-YEAR         PIC 99.
000111         16  DC-ELAPSED-MONTHS         PIC S9(4)     COMP.
000112         16  DC-ODD-DAYS-OVER          PIC S9(4)     COMP.
000113         16  DC-ELAPSED-DAYS           PIC S9(4)     COMP.
000114         16  DC-JULIAN-DATE            PIC 9(05).
000115         16  DC-JULIAN-YYDDD REDEFINES DC-JULIAN-DATE
000116                                       PIC 9(05).
000117         16  DC-JULIAN-DT REDEFINES DC-JULIAN-DATE.
000118             20  DC-JULIAN-YEAR        PIC 99.
000119             20  DC-JULIAN-DAYS        PIC 999.
000120         16  DC-DAYS-IN-MONTH          PIC S9(3)       COMP-3.
000121         16  DC-DAY-OF-WEEK            PIC S9  VALUE ZERO COMP-3.
000122         16  DC-DAY-OF-WEEK2           PIC S9  VALUE ZERO COMP-3.
000123     12  DATE-CONVERSION-VARIBLES.
000124         16  HOLD-CENTURY-1            PIC 9(11) VALUE 0.
000125         16  HOLD-CENTURY-1-SPLIT REDEFINES HOLD-CENTURY-1.
000126             20  FILLER                PIC 9(3).
000127             20  HOLD-CEN-1-CCYY.
000128                 24  HOLD-CEN-1-CC     PIC 99.
000129                 24  HOLD-CEN-1-YY     PIC 99.
000130             20  HOLD-CEN-1-MO         PIC 99.
000131             20  HOLD-CEN-1-DA         PIC 99.
000132         16  HOLD-CENTURY-1-R   REDEFINES HOLD-CENTURY-1.
000133             20  HOLD-CEN-1-R-MO       PIC 99.
000134             20  HOLD-CEN-1-R-DA       PIC 99.
000135             20  HOLD-CEN-1-R-CCYY.
000136                 24  HOLD-CEN-1-R-CC   PIC 99.
000137                 24  HOLD-CEN-1-R-YY   PIC 99.
000138             20  FILLER                PIC 9(3).
000139         16  HOLD-CENTURY-1-X.
000140             20  FILLER                PIC X(3)  VALUE SPACES.
000141             20  HOLD-CEN-1-X-CCYY.
000142                 24  HOLD-CEN-1-X-CC   PIC XX VALUE SPACES.
000143                 24  HOLD-CEN-1-X-YY   PIC XX VALUE SPACES.
000144             20  HOLD-CEN-1-X-MO       PIC XX VALUE SPACES.
000145             20  HOLD-CEN-1-X-DA       PIC XX VALUE SPACES.
000146         16  HOLD-CENTURY-1-R-X REDEFINES HOLD-CENTURY-1-X.
000147             20  HOLD-CEN-1-R-X-MO     PIC XX.
000148             20  HOLD-CEN-1-R-X-DA     PIC XX.
000149             20  HOLD-CEN-1-R-X-CCYY.
000150                 24  HOLD-CEN-1-R-X-CC PIC XX.
000151                 24  HOLD-CEN-1-R-X-YY PIC XX.
000152             20  FILLER                PIC XXX.
000153         16  DC-BIN-DATE-EXPAND-1      PIC XXX.
000154         16  DC-BIN-DATE-EXPAND-2      PIC XXX.
000155         16  DC-JULIAN-DATE-1          PIC 9(07).
000156         16  DC-JULIAN-DATE-1-R REDEFINES DC-JULIAN-DATE-1.
000157             20  DC-JULIAN-1-CCYY.
000158                 24  DC-JULIAN-1-CC    PIC 99.
000159                 24  DC-JULIAN-1-YR    PIC 99.
000160             20  DC-JULIAN-DA-1        PIC 999.
000161         16  DC-JULIAN-DATE-2          PIC 9(07).
000162         16  DC-JULIAN-DATE-2-R REDEFINES DC-JULIAN-DATE-2.
000163             20  DC-JULIAN-2-CCYY.
000164                 24  DC-JULIAN-2-CC    PIC 99.
000165                 24  DC-JULIAN-2-YR    PIC 99.
000166             20  DC-JULIAN-DA-2        PIC 999.
000167         16  DC-GREG-DATE-A-EDIT.
000168             20  DC-EDITA-MONTH        PIC 99.
000169             20  SLASHA-1              PIC X VALUE '/'.
000170             20  DC-EDITA-DAY          PIC 99.
000171             20  SLASHA-2              PIC X VALUE '/'.
000172             20  DC-EDITA-CCYY.
000173                 24  DC-EDITA-CENT     PIC 99.
000174                 24  DC-EDITA-YEAR     PIC 99.
000175         16  DC-GREG-DATE-B-EDIT.
000176             20  DC-EDITB-MONTH        PIC 99.
000177             20  SLASHB-1              PIC X VALUE '/'.
000178             20  DC-EDITB-DAY          PIC 99.
000179             20  SLASHB-2              PIC X VALUE '/'.
000180             20  DC-EDITB-CCYY.
000181                 24  DC-EDITB-CENT     PIC 99.
000182                 24  DC-EDITB-YEAR     PIC 99.
000183         16  DC-GREG-DATE-CYMD         PIC 9(08).
000184         16  DC-GREG-DATE-CYMD-R REDEFINES
000185                              DC-GREG-DATE-CYMD.
000186             20  DC-CYMD-CEN           PIC 99.
000187             20  DC-CYMD-YEAR          PIC 99.
000188             20  DC-CYMD-MONTH         PIC 99.
000189             20  DC-CYMD-DAY           PIC 99.
000190         16  DC-GREG-DATE-MDCY         PIC 9(08).
000191         16  DC-GREG-DATE-MDCY-R REDEFINES
000192                              DC-GREG-DATE-MDCY.
000193             20  DC-MDCY-MONTH         PIC 99.
000194             20  DC-MDCY-DAY           PIC 99.
000195             20  DC-MDCY-CEN           PIC 99.
000196             20  DC-MDCY-YEAR          PIC 99.
000197    12  DC-FORCE-EL310-DATE-SW         PIC X    VALUE SPACE.
000198        88  DC-FORCE-EL310-DATE                 VALUE 'Y'.
000199    12  DC-EL310-DATE                  PIC X(21).
000200    12  FILLER                         PIC X(28).
      *<<((file: ELCDATE))
001016*                                COPY ELCEMIB.
      *>>((file: ELCEMIB))
000001******************************************************************
000002*                                                                *
000003*                                                                *
000004*                            ELCEMIB.                            *
000005*           COPYBOOK REVIEWED FOR YEAR 2000 COMPLIANCE
000006*                            VMOD=2.005                          *
000007*                                                                *
000008*    STANDARD CLAS-IC ERROR MESSAGE COMMUNICATIONS AREA          *
000009*                                                                *
000010******************************************************************
000011 01  ERROR-MESSAGE-INTERFACE-BLOCK.
000012     12  EMI-COMM-LENGTH         PIC S9(4)    VALUE +400 COMP.
000013     12  EMI-NUMBER-OF-LINES     PIC 9        VALUE 1.
000014     12  EMI-ERROR               PIC 9(4)     VALUE ZEROS.
000015     12  EMI-SUB                 PIC 99       VALUE 1 COMP-3.
000016     12  EMI-NOTE-CTR            PIC 999      VALUE 0 COMP-3.
000017     12  EMI-WARNING-CTR         PIC 999      VALUE 0 COMP-3.
000018     12  EMI-FORCABLE-CTR        PIC 999      VALUE 0 COMP-3.
000019     12  EMI-FATAL-CTR           PIC 999      VALUE 0 COMP-3.
000020     12  EMI-SWITCH1             PIC X        VALUE '1'.
000021         88  EMI-NO-ERRORS                    VALUE '1'.
000022         88  EMI-ERRORS-NOT-COMPLETE          VALUE '2'.
000023         88  EMI-ERRORS-COMPLETE              VALUE '3'.
000024     12  EMI-SWITCH2             PIC X        VALUE '1'.
000025         88  EMI-FORMAT-CODES-ONLY            VALUE '2'.
000026     12  EMI-SWITCH-AREA-1       PIC X        VALUE '1'.
000027         88  EMI-AREA1-EMPTY                  VALUE '1'.
000028         88  EMI-AREA1-FULL                   VALUE '2'.
000029     12  EMI-SWITCH-AREA-2       PIC X        VALUE '1'.
000030         88  EMI-AREA2-EMPTY                  VALUE '1'.
000031         88  EMI-AREA2-FULL                   VALUE '2'.
000032     12  EMI-ACTION-SWITCH       PIC X        VALUE ' '.
000033         88  EMI-PROCESS-ALL-ERRORS           VALUE ' '.
000034         88  EMI-BYPASS-NOTES                 VALUE 'N'.
000035         88  EMI-BYPASS-WARNINGS              VALUE 'W'.
000036         88  EMI-BYPASS-FORCABLES             VALUE 'F'.
000037         88  EMI-BYPASS-FATALS                VALUE 'X'.
000038     12  EMI-ERROR-LINES.
000039         16  EMI-LINE1           PIC X(72)   VALUE SPACES.
000040         16  EMI-LINE2           PIC X(72)   VALUE SPACES.
000041         16  EMI-LINE3           PIC X(72)   VALUE SPACES.
000042         16  EMI-CODE-LINE REDEFINES EMI-LINE3.
000043             20  EMI-ERR-CODES OCCURS 10 TIMES.
000044                 24  EMI-ERR-NUM         PIC X(4).
000045                 24  EMI-FILLER          PIC X.
000046                 24  EMI-SEV             PIC X.
000047                 24  FILLER              PIC X.
000048             20  FILLER                  PIC X(02).
000049     12  EMI-ERR-LINES REDEFINES EMI-ERROR-LINES.
000050         16  EMI-MESSAGE-AREA OCCURS 3 TIMES INDEXED BY EMI-INDX.
000051             20  EMI-ERROR-NUMBER    PIC X(4).
000052             20  EMI-FILL            PIC X.
000053             20  EMI-SEVERITY        PIC X.
000054             20  FILLER              PIC X.
000055             20  EMI-ERROR-TEXT.
000056                 24  EMI-TEXT-VARIABLE   PIC X(10).
000057                 24  FILLER          PIC X(55).
000058     12  EMI-SEVERITY-SAVE           PIC X.
000059         88  EMI-NOTE                    VALUE 'N'.
000060         88  EMI-WARNING                 VALUE 'W'.
000061         88  EMI-FORCABLE                VALUE 'F'.
000062         88  EMI-FATAL                   VALUE 'X'.
000063     12  EMI-MESSAGE-FLAG            PIC X.
000064         88  EMI-MESSAGE-FORMATTED       VALUE 'Y'.
000065         88  EMI-NO-MESSAGE-FORMATTED    VALUE 'N'.
000066     12  EMI-ROLL-SWITCH             PIC X       VALUE SPACES.
000067     12  EMI-LANGUAGE-IND            PIC X       VALUE SPACES.
000068         88  EMI-LANGUAGE-IS-FR                  VALUE 'F'.
000069         88  EMI-LANGUAGE-IS-ENG                 VALUE 'E'.
000070         88  EMI-LANGUAGE-IS-SPAN                VALUE 'S'.
000071     12  emi-claim-no                pic x(7).
000072     12  emi-claim-type              pic x(6).
000073     12  FILLER                      PIC X(124)  VALUE SPACES.
000074     12  EMI-DATE-FIELD              PIC X(06)   VALUE SPACES.
000075     12  EMI-CLIENT-ID               PIC X(3)    VALUE SPACES.
000076     12  EMI-LIFE-OVERRIDE-L6        PIC X(6).
000077     12  EMI-AH-OVERRIDE-L6          PIC X(6).
      *<<((file: ELCEMIB))
001017*                                COPY ELCCALC.
      *>>((file: ELCCALC))
000001******************************************************************
000002*                                                                *
000003*                           ELCCALC.                            *
000004*           COPYBOOK REVIEWED FOR YEAR 2000 COMPLIANCE
000005*                            VMOD=2.025                          *
000006*                                                                *
000007*   DESCRIPTION:  DATA TO BE PASSED TO REMAINING TERM ROUTINE    *
000008*                 REMAINING AMOUNT ROUTINE, LOSS RESERVE ROUTINE *
000009*                 REFUND CALCULATIONS ROUTINE, EARNINGS CALCU -  *
000010*                 LATIONS ROUTINE, AND THE RATING ROUTINE.       *
000011*                                                                *
000012*  PASSED TO ELRTRM                                              *
000013*  -----------------                                             *
000014*  METHOD CODE (I.E. FULL MONTH, HALF ADJ, ETC)                  *
000015*  ORIGINAL TERM                                                 *
000016*  BEGINNING DATE                                                *
000017*  ENDING DATE                                                   *
000018*  COMPANY I.D.                                                  *
000019*  ACCOUNT MASTER USER FIELD                                     *
000020*  PROCESS SWITCH (CANCEL, CLAIM)                                *
000021*  FREE LOOK DAYS                                                *
000022*                                                                *
000023*  RETURNED FROM ELRTRM                                          *
000024*  ---------------------                                         *
000025*  REMAINING TERM 1 - USED FOR EARNINGS                          *
000026*  REMAINING TERM 2 - USED FOR BENEFIT CALCULATIONS              *
000027*  REMAINING TERM 3 - USED FOR CLAIM BENEFITS                    *
000028*  ODD DAYS - REMAINING DAYS PAST FULL MONTHS                    *
000029*----------------------------------------------------------------*
000030*  PASSED TO ELRAMT                                              *
000031*  ----------------                                              *
000032*  REMAINING TERM 1 OR 2 OR 3 (FROM ELRTRM)                      *
000033*  ORIGINAL TERM (ADJUSTED IF SKIP MONTHS ARE USED)              *
000034*  ORIGINAL AMOUNT                                               *
000035*  ALTERNATE BENEFIT (BALLON)                                    *
000036*  A.P.R. - NET PAY ONLY                                         *
000037*  METHOD
000038*  PAYMENT FREQUENCY - FOR FARM PLAN                             *
000039*  COMPANY I.D.                                                  *
000040*  BENEFIT TYPE                                                  *
000041*                                                                *
000042*  RETURNED FROM ELRAMT                                          *
000043*  --------------------                                          *
000044*  REMAINING AMOUNT 1 - CURRENT                                  *
000045*  REMAINING AMOUNT 2 - PREVIOUS MONTH                           *
000046*  REMAINING AMOUNT FACTOR
000047*----------------------------------------------------------------*
000048*  PASSED TO ELRESV                                              *
000049*  -----------------                                             *
000050*  CERTIFICATE EFFECTIVE DATE                                    *
000051*  VALUATION DATE                                                *
000052*  PAID THRU DATE                                                *
000053*  BENEFIT                                                       *
000054*  INCURRED DATE                                                 *
000055*  REPORTED DATE                                                 *
000056*  ISSUE AGE                                                     *
000057*  TERM                                                          *
000058*  CDT PERCENT                                                   *
000059*  CDT METHOD (I.E. INTERPOLATED, AVERAGE, ETC)                  *
000060* *CLAIM TYPE (LIFE, A/H)                                        *
000061* *REMAINING BENEFIT (FROM ELRAMT)                               *
000062* *ONLY FIELDS REQUIRED FOR LIFE CLAIMS                          *
000063*                                                                *
000064*  RETURNED FROM ELRESV                                          *
000065*  --------------------                                          *
000066*  CDT TABLE USED                                                *
000067*  CDT FACTOR USED                                               *
000068*  PAY TO CURRENT RESERVE                                        *
000069*  I.B.N.R. - A/H ONLY                                           *
000070*  FUTURE (ACCRUED) AH ONLY                                      *
000071*----------------------------------------------------------------*
000072*  PASSED TO ELRATE                                              *
000073*  ----------------                                              *
000074*  CERT ISSUE DATE                                               *
000075*  ORIGINAL TERM (ADJUSTED IF SKIP MONTHS ARE USED)              *
000076*  TERM OR EXT DAYS  (DAY TERM FOR SP CALC = 'D', ELSE EXT DAYS) *
000077*  CAPPED TERM   (ONLY FOR TRUNCATED LIFE)                       *
000078*  STATE CODE (CLIENT DEFINED)                                   *
000079*  STATE CODE (STANDARD P.O. ABBRV)                              *
000080*  CLASS CODE (FROM CERT OR ACCOUNT IF CERT ZERO OR SPACES)      *
000081*  DEVIATION CODE                                                *
000082*  ISSUE AGE                                                     *
000083*  ORIGINAL BENEFIT AMOUNT                                       *
000084*  RATING BENEFIT AMT (TOTAL BENEFIT AMT FOR BALLOONS)           *
000085*  PROCESS TYPE (ISSUE OR CANCEL)                                *
000086*  BENEFIT KIND (LIFE OR A/H)                                    *
000087*  A.P.R.                                                        *
000088*  METHOD
000089*  SPECIAL METHOD - (SPECIAL CODE FROM BENEFIT RECORD)           *
000090*  PAYMENT FREQUENCY  (FOR TEXAS IRREGULAR)                      *
000091*  COMPANY I.D. (3 CHARACTER)                                    *
000092*  BENEFIT CODE                                                  *
000093*  BENEFIT OVERRIDE CODE                                         *
000094*  MAXIMUM MONTHLY BENEFIT (FROM ACCT MASTER - CSL ONLY)         *
000095*  MAXIMUM TOTAL BENEFIT (FROM ACCT MASTER - CSL ONLY)           *
000096*  JOINT INDICATOR (CSL ONLY)                                    *
000097*  FIRST PAYMENT DATE (CSL ONLY)                                 *
000098*  PERIODIC PAYMENT AMOUNT (IN CP-REMAINING-TERM - CSL ONLY)     *
000099*                                                                *
000100*  RETURNED FROM ELRATE                                          *
000101*  --------------------                                          *
000102*  CALCULATED PREMIUM                                            *
000103*  PREMIUM RATE                                                  *
000104*  MORTALITY CODE                                                *
000105*  MAX ATTAINED AGE                                              *
000106*  MAX AGE                                                       *
000107*  MAX TERM                                                      *
000108*  MAX MONTHLY BENEFIT                                           *
000109*  MAX TOTAL BENIFIT                                             *
000110*  COMPOSITE RATE (OPEN-END ONLY)                                *
000111*----------------------------------------------------------------*
000112*  PASSED TO ELRFND                                              *
000113*  ----------------                                              *
000114*  CERT ISSUE DATE                                               *
000115*  REFUND DATE                                                   *
000116*  RULE OF 78 OPTION (FROM CONTROL RECORD)                       *
000117*  ORIGINAL TERM (ADJUSTED IF SKIP MONTHS ARE USED)              *
000118*  TERM OR EXT DAYS  (DAY TERM FOR SP CALC = 'D', ELSE EXT DAYS) *
000119*  REMAINING TERM (REMAINING TERM 1 FROM ELTERM)                 *
000120*  STATE CODE (CLIENT DEFINED)                                   *
000121*  STATE CODE (STANDARD P.O. ABBRV)                              *
000122*  CLASS CODE (FROM CERT OR ACCOUNT IF CERT ZERO OR SPACES)      *
000123*  DEVIATION CODE                                                *
000124*  ISSUE AGE                                                     *
000125*  ORIGINAL BENEFIT AMOUNT                                       *
000126*  RATING BENEFIT AMT (TOTAL BENEFIT AMT FOR BALLOONS)           *
000127*  PROCESS TYPE (CANCEL)                                         *
000128*  BENEFIT KIND (LIFE OR A/H)                                    *
000129*  A.P.R.                                                        *
000130*  EARNING METHOD - (CODE FROM BENEFIT, STATE OR ACCOUNT RECORD) *
000131*  RATING METHOD -  (CODE FROM BENEFIT)                          *
000132*  SPECIAL METHOD - (SPECIAL CODE FROM BENEFIT RECORD)           *
000133*  PAYMENT FREQUENCY  (FOR TEXAS IRREGULAR)                      *
000134*  COMPANY I.D. (3 CHARACTER)                                    *
000135*  BENEFIT CODE                                                  *
000136*  BENEFIT OVERRIDE CODE                                         *
000137*                                                                *
000138*  RETURNED FROM ELRFND                                          *
000139*  --------------------                                          *
000140*  CALCULATED REFUND                                             *
000141*----------------------------------------------------------------*
000142*  PASSED TO ELEARN                                              *
000143*  ----------------                                              *
000144*  CERT ISSUE DATE                                               *
000145*  ORIGINAL TERM (ADJUSTED IF SKIP MONTHS ARE USED)              *
000146*  REMAINING TERM (REMAINING TERM 1 FROM ELTERM)                 *
000147*  RULE OF 78 OPTION (FROM CONTROL RECORD)                       *
000148*  STATE CODE (CLIENT DEFINED)                                   *
000149*  STATE CODE (STANDARD P.O. ABBRV)                              *
000150*  CLASS CODE (FROM CERT OR ACCOUNT IF CERT ZERO OR SPACES)      *
000151*  DEVIATION CODE                                                *
000152*  ISSUE AGE                                                     *
000153*  ORIGINAL BENEFIT AMOUNT                                       *
000154*  BENEFIT KIND (LIFE OR A/H)                                    *
000155*  A.P.R.                                                        *
000156*  METHOD - (EARNING CODE FROM BENEFIT RECORD)                   *
000157*  SPECIAL METHOD - (SPECIAL CODE FROM BENEFIT RECORD)           *
000158*  PAYMENT FREQUENCY  (FOR TEXAS IRREGULAR)                      *
000159*  COMPANY I.D. (3 CHARACTER)                                    *
000160*  BENEFIT CODE                                                  *
000161*  BENEFIT OVERRIDE CODE                                         *
000162*                                                                *
000163*  RETURNED FROM ELEARN                                          *
000164*  --------------------                                          *
000165*  INDICATED  EARNINGS                                           *
000166*----------------------------------------------------------------*
000167*                 LENGTH = 450                                   *
000168*                                                                *
000169******************************************************************
000170******************************************************************
000171*                   C H A N G E   L O G
000172*
000173* CHANGES ARE MARKED BY THE CHANGE EFFECTIVE DATE.
000174*-----------------------------------------------------------------
000175*  CHANGE   CHANGE REQUEST PGMR  DESCRIPTION OF CHANGE
000176* EFFECTIVE    NUMBER
000177*-----------------------------------------------------------------
000178* 010303    2001061800003  PEMA  ADD DCC/MONTHLY PROCESSING
000179* 033104    2003080800002  PEMA  ADD GAP NON REFUNDABLE OPTION
000180* 101807    2007100100007  PEMA  EXPAND CLM RESERVE FIELDS
000181* 010410    2008021200005  PEMA  ADD FIELDS FOR MN NET PAY BALLOON
000182* 010410    2009050700003  PEMA  ADD FIELDS FOR SPP-DD
000183* 041310  CR2008021200005  PEMA  ADD CODE FOR MN LEVEL
000184* 041710    2007111300001  AJRA  ADD CLAIM CALC SW FOR SC NP+6
000185* 101110  CR2010012700001  PEMA ADD DDF REFUND/UEP PROCESSING
000186* 071211  CR2009050700003  PEMA  ADD SPP DEALER DIRECT
000187* 040615  CR2013072200002  PEMA  ADD EXTRA PERIODS
000188* 010716    2015082500001  PEMA CHG POLICY FEE TO CANCEL FEE
000189* 012820  CR2020012800001  PEMA ADD MIN LOAN TERM FOR EXT TERM.
000190******************************************************************
000191
000192 01  CALCULATION-PASS-AREA.
000193     12  CP-COMM-LENGTH            PIC S9(4)         VALUE +450
000194                                     COMP.
000195
000196     12  CP-RETURN-CODE            PIC X             VALUE ZERO.
000197       88  NO-CP-ERROR                             VALUE ZERO.
000198       88  CP-ERROR-OCCURED VALUE '1' '2' '3' '4' '5' '6' '7' '8'
000199                                  '9' 'A' 'B' 'C' 'D' 'E' 'H' 'I'.
000200       88  CP-ERROR-IN-AMOUNTS                     VALUE '1'.
000201       88  CP-ERROR-IN-DATES                       VALUE '2'.
000202       88  CP-ERROR-IN-OPTIONS                     VALUE '3'.
000203       88  CP-ERROR-IN-TERMS                       VALUE '4'.
000204       88  CP-ERROR-IN-FREQUENCY                   VALUE '5'.
000205       88  CP-ERROR-RATE-NOT-FOUND                 VALUE '6'.
000206       88  CP-ERROR-RATE-IS-ZERO                   VALUE '7'.
000207       88  CP-ERROR-AMT-OUTSIDE-LIMIT              VALUE '8'.
000208       88  CP-ERROR-TERM-OUTSIDE-LIMIT             VALUE '9'.
000209       88  CP-ERROR-AGE-OUTSIDE-LIMIT              VALUE 'A'.
000210       88  CP-ERROR-ATT-OUTSIDE-LIMIT              VALUE 'B'.
000211       88  CP-ERROR-TOT-OUTSIDE-LIMIT              VALUE 'C'.
000212       88  CP-ERROR-RATE-FILE-NOTOPEN              VALUE 'D'.
000213       88  CP-ERROR-ISSUE-AGE-ZERO                 VALUE 'E'.
000214       88  CP-ERROR-NO-LIMITS-CRI                  VALUE 'F'.
000215       88  CP-ERROR-DIV-BY-ZERO                    VALUE 'G'.
000216       88  CP-ERROR-LOAN-TERM                      VALUE 'H'.
000217       88  CP-ERROR-TERM-BELOW-MINIMUM             VALUE 'I'.
000218
000219     12  CP-RETURN-CODE-2          PIC X             VALUE ZERO.
000220       88  NO-CP-ERROR-2                           VALUE ZERO.
000221***********************  INPUT AREAS ****************************
000222
000223     12  CP-CALCULATION-AREA.
000224         16  CP-ACCOUNT-NUMBER     PIC X(10)       VALUE SPACES.
000225         16  CP-CERT-EFF-DT        PIC XX.
000226         16  CP-VALUATION-DT       PIC XX.
000227         16  CP-PAID-THRU-DT       PIC XX.
000228         16  CP-BENEFIT-TYPE       PIC X.
000229           88  CP-AH                               VALUE 'A' 'D'
000230                                                   'I' 'U'.
000231           88  CP-REDUCING-LIFE                    VALUE 'R'.
000232           88  CP-LEVEL-LIFE                       VALUE 'L' 'P'.
000233         16  CP-INCURRED-DT        PIC XX.
000234         16  CP-REPORTED-DT        PIC XX.
000235         16  CP-ACCT-FLD-5         PIC XX            VALUE SPACE.
000236         16  CP-COMPANY-ID         PIC XXX           VALUE SPACE.
000237         16  CP-ISSUE-AGE          PIC S9(3)         VALUE ZERO
000238                                     COMP-3.
000239         16  CP-CDT-PERCENT        PIC S9(3)V99      VALUE ZERO
000240                                     COMP-3.
000241         16  CP-CDT-METHOD         PIC X.
000242           88  CP-CDT-ROUND-NEAR                   VALUE '1'.
000243           88  CP-CDT-ROUND-HIGH                   VALUE '2'.
000244           88  CP-CDT-INTERPOLATED                 VALUE '3'.
000245         16  CP-CLAIM-TYPE         PIC X.
000246           88  CP-AH-CLAIM                         VALUE 'A'.
000247           88  CP-LIFE-CLAIM                       VALUE 'L'.
000248         16  CP-ORIGINAL-TERM      PIC S9(3)         VALUE ZERO
000249                                     COMP-3.
000250         16  CP-ORIGINAL-BENEFIT   PIC S9(9)V99      VALUE ZERO
000251                                     COMP-3.
000252         16  CP-ORIGINAL-PREMIUM   PIC S9(7)V99      VALUE ZERO
000253                                     COMP-3.
000254         16  CP-REMAINING-TERM     PIC S9(3)V99      VALUE ZERO
000255                                     COMP-3.
000256         16  CP-REMAINING-BENEFIT  PIC S9(9)V99      VALUE ZERO
000257                                     COMP-3.
000258         16  CP-LOAN-APR           PIC S9(3)V9(4)    VALUE ZERO
000259                                     COMP-3.
000260         16  CP-PAY-FREQUENCY      PIC S9(3)         VALUE ZERO
000261                                     COMP-3.
000262         16  CP-REM-TERM-METHOD    PIC X.
000263           88  CP-EARN-AFTER-15TH                  VALUE '1'.
000264           88  CP-EARN-ON-HALF-MONTH               VALUE '2'.
000265           88  CP-EARN-ON-1ST-DAY                  VALUE '3'.
000266           88  CP-EARN-ON-FULL-MONTH               VALUE '4'.
000267           88  CP-EARN-WITH-NO-DAYS                VALUE '5'.
000268           88  CP-EARN-AFTER-14TH                  VALUE '6'.
000269           88  CP-EARN-AFTER-16TH                  VALUE '7'.
000270         16  CP-EARNING-METHOD     PIC X.
000271           88  CP-EARN-BY-R78                      VALUE '1' 'R'.
000272           88  CP-EARN-BY-PRORATA                  VALUE '2' 'P'.
000273           88  CP-EARN-AS-CALIF                    VALUE '3' 'C'.
000274           88  CP-EARN-AS-TEXAS                    VALUE '4' 'T'.
000275           88  CP-EARN-AS-FARM-PLAN                VALUE '4' 'T'.
000276           88  CP-EARN-AS-NET-PAY                  VALUE '5' 'N'.
000277           88  CP-EARN-ANTICIPATION                VALUE '6' 'A'.
000278           88  CP-EARN-AS-MEAN                     VALUE '8' 'M'.
000279           88  CP-EARN-AS-SUM-OF-DIGITS            VALUE '9'.
000280           88  CP-EARN-AS-REG-BALLOON              VALUE 'B'.
000281           88  CP-GAP-NON-REFUNDABLE               VALUE 'G'.
000282           88  CP-GAP-ACTUARIAL                    VALUE 'S'.
000283           88  CP-DCC-SPP-DDF                      VALUE 'D' 'I'.
000284           88  CP-DCC-SPP-DDF-IU                   VALUE 'I'.
000285         16  CP-PROCESS-TYPE       PIC X.
000286           88  CP-CLAIM                            VALUE '1'.
000287           88  CP-CANCEL                           VALUE '2'.
000288           88  CP-ISSUE                            VALUE '3'.
000289         16  CP-SPECIAL-CALC-CD    PIC X.
000290           88  CP-OUTSTANDING-BAL              VALUE 'O'.
000291           88  CP-1-MTH-INTEREST               VALUE ' '.
000292           88  CP-0-MTH-INTEREST               VALUE 'A'.
000293           88  CP-OB-OFFLINE-RESERVED          VALUE 'B'.
000294           88  CP-CRITICAL-PERIOD              VALUE 'C'.
000295           88  CP-TERM-IS-DAYS                 VALUE 'D'.
000296           88  CP-USE-PREM-AS-ENTERED          VALUE 'E'.
000297           88  CP-FARM-PLAN                    VALUE 'F'.
000298           88  CP-RATE-AS-STANDARD             VALUE 'G'.
000299           88  CP-2-MTH-INTEREST               VALUE 'I'.
000300           88  CP-3-MTH-INTEREST               VALUE 'J'.
000301           88  CP-4-MTH-INTEREST               VALUE 'K'.
000302           88  CP-BALLOON-LAST-PMT             VALUE 'L'.
000303           88  CP-MORTGAGE-REC                 VALUE 'M'.
000304           88  CP-OUTSTANDING-BALANCE          VALUE 'O'.
000305           88  CP-NET-PAY-PRUDENTIAL           VALUE 'P'.
000306           88  CP-NET-PAY-SIMPLE               VALUE 'S'.
000307           88  CP-TRUNCATED-LIFE               VALUE 'T' 'U' 'V'
000308                                                     'W' 'X'.
000309           88  CP-TRUNCATE-0-MTH               VALUE 'T'.
000310           88  CP-TRUNCATE-1-MTH               VALUE 'U'.
000311           88  CP-TRUNCATE-2-MTH               VALUE 'V'.
000312           88  CP-TRUNCATE-3-MTH               VALUE 'W'.
000313           88  CP-TRUNCATE-4-MTH               VALUE 'X'.
000314           88  CP-SUMMARY-REC                  VALUE 'Z'.
000315           88  CP-PROPERTY-BENEFIT             VALUE '2'.
000316           88  CP-UNEMPLOYMENT-BENEFIT         VALUE '3'.
000317           88  CP-AD-D-BENEFIT                 VALUE '4'.
000318           88  CP-CSL-METH-1                   VALUE '5'.
000319           88  CP-CSL-METH-2                   VALUE '6'.
000320           88  CP-CSL-METH-3                   VALUE '7'.
000321           88  CP-CSL-METH-4                   VALUE '8'.
000322
000323         16  CP-LOAN-TERM          PIC S9(3)       VALUE ZERO
000324                                     COMP-3.
000325         16  CP-CLASS-CODE         PIC XX          VALUE ZERO.
000326         16  CP-DEVIATION-CODE     PIC XXX         VALUE ZERO.
000327         16  CP-STATE              PIC XX          VALUE SPACE.
000328         16  CP-STATE-STD-ABBRV    PIC XX          VALUE SPACE.
000329         16  CP-BENEFIT-CD         PIC XX          VALUE ZERO.
000330           88  CP-CSL-VALID-NP-BENEFIT-CD VALUES '12' '13'
000331               '34' '35' '36' '37' '44' '45' '46' '47' '72' '73'.
000332         16  CP-R78-OPTION         PIC X.
000333           88  CP-TERM-TIMES-TERM-PLUS-1           VALUE ' '.
000334           88  CP-TERM-TIMES-TERM                  VALUE '1'.
000335
000336         16  CP-COMPANY-CD         PIC X             VALUE SPACE.
000337         16  CP-IBNR-RESERVE-SW    PIC X.
000338         16  CP-CLAIM-STATUS       PIC X.
000339         16  CP-RATE-FILE          PIC X.
000340         16  CP-TERM-OR-EXT-DAYS   PIC S9(05)        VALUE ZERO
000341                                     COMP-3.
000342
000343         16  CP-LIFE-OVERRIDE-CODE PIC X.
000344         16  CP-AH-OVERRIDE-CODE   PIC X.
000345
000346         16  CP-RATE-DEV-PCT       PIC S9V9(6)       VALUE ZERO
000347                                     COMP-3.
000348         16  CP-CLP-RATE-UP        REDEFINES CP-RATE-DEV-PCT
000349                                   PIC S9(5)V99 COMP-3.
000350         16  CP-CRITICAL-MONTHS    PIC S9(3)         VALUE ZERO
000351                                     COMP-3.
000352         16  CP-ALTERNATE-BENEFIT  PIC S9(9)V99      VALUE ZERO
000353                                     COMP-3.
000354         16  CP-ALTERNATE-PREMIUM  PIC S9(7)V99      VALUE ZERO
000355                                     COMP-3.
000356         16  CP-DDF-CSO-ADMIN-FEE REDEFINES CP-ALTERNATE-PREMIUM
000357                                  PIC S9(7)V99 COMP-3.
000358
000359         16  CP-PAID-FROM-DATE     PIC X(02).
000360         16  CP-CLAIM-CALC-METHOD  PIC X(01).
000361         16  CP-EXT-DAYS-CALC      PIC X.
000362           88  CP-EXT-NO-CHG                   VALUE ' '.
000363           88  CP-EXT-CHG-LF                   VALUE '1'.
000364           88  CP-EXT-CHG-AH                   VALUE '2'.
000365           88  CP-EXT-CHG-LF-AH                VALUE '3'.
000366         16  CP-DOMICILE-STATE     PIC XX.
000367         16  CP-CARRIER            PIC X.
000368         16  CP-REIN-FLAG          PIC X.
000369         16  CP-REM-TRM-CALC-OPTION PIC X.
000370           88  VALID-REM-TRM-CALC-OPTION    VALUE '1'
000371                      '2' '3' '4' '5'.
000372           88  CP-CALC-OPTION-DEFAULT       VALUE '4'.
000373           88  CP-CONSIDER-EXTENSION        VALUE '3' '4' '5'.
000374           88  CP-30-DAY-MONTH              VALUE '1' '3' '5'.
000375           88  CP-NO-EXT-30-DAY-MONTH       VALUE '1'.
000376           88  CP-NO-EXT-ACTUAL-DAYS        VALUE '2'.
000377           88  CP-EXT-30-DAY-MONTH          VALUE '3'.
000378           88  CP-EXT-ACTUAL-DAYS           VALUE '4'.
000379           88  CP-USE-EXP-AND-1ST-PMT       VALUE '5'.
000380         16  CP-SIG-SWITCH         PIC X.
000381         16  CP-RATING-METHOD      PIC X.
000382           88  CP-RATE-AS-R78                      VALUE '1' 'R'.
000383           88  CP-RATE-AS-PRORATA                  VALUE '2' 'P'.
000384           88  CP-RATE-AS-CALIF                    VALUE '3' 'C'.
000385           88  CP-RATE-AS-TEXAS                    VALUE '4' 'T'.
000386           88  CP-RATE-AS-FARM-PLAN                VALUE '4' 'T'.
000387           88  CP-RATE-AS-NET-PAY                  VALUE '5' 'N'.
000388           88  CP-RATE-AS-ANTICIPATION             VALUE '6' 'A'.
000389           88  CP-RATE-AS-MEAN                     VALUE '8' 'M'.
000390           88  CP-RATE-AS-REG-BALLOON              VALUE 'B'.
000391         16  CP-SALES-TAX          PIC S9V9999     VALUE  ZEROS
000392                                     COMP-3.
000393         16  CP-BEN-CATEGORY       PIC X.
000394         16  CP-DCC-LF-RATE        PIC S99V9(5) COMP-3 VALUE +0.
000395         16  CP-DCC-ACT-COMM REDEFINES CP-DCC-LF-RATE
000396                                   PIC S99V9(5) COMP-3.
000397         16  CP-DCC-AH-RATE        PIC S99V9(5) COMP-3 VALUE +0.
000398         16  CP-DCC-PMF-COMM REDEFINES CP-DCC-AH-RATE
000399                                   PIC S99V9(5) COMP-3.
000400         16  CP-DAYS-TO-1ST-PMT    PIC S999     COMP-3 VALUE +0.
000401         16  CP-AH-BALLOON-SW      PIC X  VALUE ' '.
000402         16  CP-EXPIRE-DT          PIC XX.
000403         16  CP-LF-CLAIM-CALC-SW   PIC X  VALUE ' '.
000404         16  CP-DDF-HI-FACT        PIC S9V999   COMP-3 VALUE +0.
000405         16  CP-DDF-LO-FACT        PIC S9V999   COMP-3 VALUE +0.
000406         16  CP-DDF-CLP            PIC S9(5)V99 COMP-3 VALUE +0.
000407         16  CP-DDF-SPEC-CALC      PIC X.
000408             88  CP-CALC-GROSS-FEE        VALUE 'G'.
000409             88  CP-CALC-CLP              VALUE 'C'.
000410         16  CP-IU-RATE-UP         PIC S9(5)V99   COMP-3 VALUE +0.
000411         16  CP-CANCEL-REASON      PIC X.
000412         16  CP-DDF-ADMIN-FEES     PIC S9(5)V99 COMP-3 VALUE +0.
000413         16  CP-PMT-MODE           PIC X.
000414         16  CP-NO-OF-PMTS         PIC S999 COMP-3 VALUE +0.
000415         16  CP-1ST-YR-ALLOW       PIC S999V99 COMP-3 VALUE +0.
000416         16  CP-DDF-COMM-AND-MFEE  PIC S9(5)V99 COMP-3 VALUE +0.
000417         16  CP-DDF-YR1AF          PIC S9(5)V99 COMP-3 VALUE +0.
000418         16  FILLER                PIC X.
000419
000420***************    OUTPUT FROM ELRESV   ************************
000421
000422         16  CP-CDT-TABLE          PIC 9             VALUE ZERO.
000423
000424         16  CP-CDT-FACTOR         PIC S9(5)V9(6)    VALUE ZERO
000425                                     COMP-3.
000426         16  CP-PTC-RESERVE        PIC S9(7)V99   VALUE ZERO
000427                                     COMP-3.
000428         16  CP-IBNR-RESERVE       PIC S9(7)V99   VALUE ZERO
000429                                     COMP-3.
000430         16  CP-FUTURE-RESERVE     PIC S9(7)V99   VALUE ZERO
000431                                     COMP-3.
000432         16  FILLER                PIC X(09).
000433***************    OUTPUT FROM ELRTRM   *************************
000434
000435         16  CP-REMAINING-TERM-1   PIC S9(4)V9    VALUE ZERO
000436                                     COMP-3.
000437         16  CP-REMAINING-TERM-2   PIC S9(4)V9    VALUE ZERO
000438                                     COMP-3.
000439         16  CP-REMAINING-TERM-3   PIC S9(4)V9    VALUE ZERO
000440                                     COMP-3.
000441         16  CP-ODD-DAYS           PIC S9(3)      VALUE ZERO
000442                                     COMP-3.
000443         16  FILLER                PIC X(12).
000444
000445***************    OUTPUT FROM ELRAMT   *************************
000446
000447         16  CP-REMAINING-AMT      PIC S9(9)V99   VALUE ZERO
000448                                     COMP-3.
000449         16  CP-REMAINING-AMT-PRV  PIC S9(9)V99   VALUE ZERO
000450                                     COMP-3.
000451         16  FILLER                PIC X(12).
000452
000453***************    OUTPUT FROM ELRATE   *************************
000454
000455         16  CP-CALC-PREMIUM       PIC S9(7)V99   VALUE ZERO
000456                                     COMP-3.
000457         16  CP-PREMIUM-RATE       PIC S9(2)V9(5) VALUE ZERO
000458                                     COMP-3.
000459         16  CP-MORTALITY-CODE     PIC X(4).
000460         16  CP-RATE-EDIT-FLAG     PIC X.
000461             88  CP-RATES-NEED-APR                  VALUE '1'.
000462         16  CP-COMPOSITE-RATE     PIC S99V999    VALUE ZERO
000463                                     COMP-3.
000464         16  CP-CANCEL-FEE         PIC S9(3)V99 VALUE +0 COMP-3.
000465         16  CP-LF-PREM            PIC S9(7)V99 VALUE +0 COMP-3.
000466         16  CP-LF-BALLOON-PREM REDEFINES CP-LF-PREM
000467                                   PIC S9(7)V99 COMP-3.
000468         16  FILLER                PIC X(07).
000469
000470***************    OUTPUT FROM ELRFND   *************************
000471
000472         16  CP-CALC-REFUND        PIC S9(7)V99   VALUE ZERO
000473                                     COMP-3.
000474         16  CP-REFUND-TYPE-USED   PIC X.
000475           88  CP-R-AS-R78                         VALUE '1'.
000476           88  CP-R-AS-PRORATA                     VALUE '2'.
000477           88  CP-R-AS-CALIF                       VALUE '3'.
000478           88  CP-R-AS-TEXAS                       VALUE '4'.
000479           88  CP-R-AS-FARM-PLAN                   VALUE '4'.
000480           88  CP-R-AS-NET-PAY                     VALUE '5'.
000481           88  CP-R-AS-ANTICIPATION                VALUE '6'.
000482           88  CP-R-AS-MEAN                        VALUE '8'.
000483           88  CP-R-AS-SUM-OF-DIGITS               VALUE '9'.
000484           88  CP-R-AS-GAP-NON-REFUND              VALUE 'G'.
000485           88  CP-R-AS-GAP-ACTUARIAL               VALUE 'S'.
000486           88  CP-R-AS-SPP-DDF                     VALUE 'D'.
000487           88  CP-R-AS-SPP-DDF-IU                  VALUE 'I'.
000488           88  CP-R-AS-REPOSSESSION                VALUE 'R'.
000489         16  FILLER                PIC X(12).
000490
000491***************    OUTPUT FROM ELEARN   *************************
000492
000493         16  CP-R78-U-PRM          PIC S9(7)V99   VALUE ZERO
000494                                     COMP-3.
000495         16  CP-R78-U-PRM-ALT      PIC S9(7)V99   VALUE ZERO
000496                                     COMP-3.
000497         16  CP-PRORATA-U-PRM      PIC S9(7)V99   VALUE ZERO
000498                                     COMP-3.
000499         16  CP-PRORATA-U-PRM-ALT  PIC S9(7)V99   VALUE ZERO
000500                                     COMP-3.
000501         16  CP-STATE-U-PRM        PIC S9(7)V99   VALUE ZERO
000502                                     COMP-3.
000503         16  CP-DOMICILE-U-PRM     PIC S9(7)V99   VALUE ZERO
000504                                     COMP-3.
000505         16  CP-EARNING-TYPE-USED  PIC X.
000506           88  CP-E-AS-SPECIAL                     VALUE 'S'.
000507           88  CP-E-AS-R78                         VALUE '1'.
000508           88  CP-E-AS-PRORATA                     VALUE '2'.
000509           88  CP-E-AS-TEXAS                       VALUE '4'.
000510           88  CP-E-AS-FARM-PLAN                   VALUE '4'.
000511           88  CP-E-AS-NET-PAY                     VALUE '5'.
000512           88  CP-E-AS-ANTICIPATION                VALUE '6'.
000513           88  CP-E-AS-MEAN                        VALUE '8'.
000514           88  CP-E-AS-SUM-OF-DIGITS               VALUE '9'.
000515         16  FILLER                PIC X(12).
000516
000517***************    OUTPUT FROM ELPMNT   *************************
000518
000519         16  CP-ACTUAL-DAYS        PIC S9(05)     VALUE ZERO
000520                                     COMP-3.
000521         16  CP-CLAIM-PAYMENT      PIC S9(7)V99   VALUE ZERO
000522                                     COMP-3.
000523         16  FILLER                PIC X(12).
000524
000525***************   MISC WORK AREAS    *****************************
000526         16  CP-TOTAL-PAID         PIC S9(7)V99   VALUE ZERO
000527                                     COMP-3.
000528         16  CP-R-MAX-ATT-AGE      PIC S9(3)      VALUE ZERO
000529                                     COMP-3.
000530         16  CP-R-MAX-AGE          PIC S9(3)      VALUE ZERO
000531                                     COMP-3.
000532         16  CP-R-MAX-TERM         PIC S9(5)      VALUE ZERO
000533                                     COMP-3.
000534         16  CP-R-MAX-TOT-BEN      PIC S9(7)V99   VALUE ZERO
000535                                     COMP-3.
000536         16  CP-R-MAX-MON-BEN      PIC S9(7)V99   VALUE ZERO
000537                                     COMP-3.
000538         16  CP-IO-FUNCTION        PIC X          VALUE SPACE.
000539             88  OPEN-RATE-FILE                   VALUE 'O'.
000540             88  CLOSE-RATE-FILE                  VALUE 'C'.
000541             88  IO-ERROR                         VALUE 'E'.
000542
000543         16  CP-FIRST-PAY-DATE     PIC XX.
000544
000545         16  CP-JOINT-INDICATOR    PIC X.
000546
000547         16  CP-RESERVE-REMAINING-TERM
000548                                   PIC S9(4)V9    VALUE ZERO
000549                                     COMP-3.
000550
000551         16  CP-INSURED-BIRTH-DT   PIC XX.
000552
000553         16  CP-INCURRED-AGE       PIC S9(3)      VALUE ZERO
000554                                     COMP-3.
000555
000556         16  CP-MONTHLY-PAYMENT    PIC S9(5)V99   VALUE ZERO
000557                                     COMP-3.
000558
000559         16  CP-RATING-BENEFIT-AMT PIC S9(9)V99   VALUE ZERO
000560                                     COMP-3.
000561
000562         16  CP-ODD-DAYS-TO-PMT    PIC S9(3)      VALUE ZERO
000563                                     COMP-3.
000564
000565         16  CP-MNTHS-TO-FIRST-PMT PIC S9(3)      VALUE ZERO
000566                                     COMP-3.
000567
000568         16  CP-REMAMT-FACTOR      PIC S9(4)V9(9) VALUE ZEROS
000569                                     COMP-3.
000570
000571         16  CP-FREE-LOOK          PIC S9(3)      VALUE ZERO
000572                                     COMP-3.
000573
000574         16  CP-ROA-REFUND         PIC X          VALUE 'N'.
000575             88  CP-ROA-PREM-AT-REFUND            VALUE 'Y'.
000576
000577         16  CP-NET-BENEFIT-AMT    PIC S9(9)V99   VALUE ZERO
000578                                     COMP-3.
000579         16  CP-SCNP-6MO-AMT       PIC S9(9)V99   VALUE ZERO
000580                                     COMP-3.
000581         16  CP-MONTH              PIC S999     COMP-3 VALUE +0.
000582         16  cp-extra-periods      pic 9 value zeros.
000583         16  cp-net-only-state     pic x value spaces.
000584         16  FILLER                PIC X(13).
000585******************************************************************
      *<<((file: ELCCALC))
001018
001019*                                COPY ELCCNTL.
      *>>((file: ELCCNTL))
000001******************************************************************
000002*                                                                *
000003*                                                                *
000004*                            ELCCNTL.                            *
000005*           COPYBOOK REVIEWED FOR YEAR 2000 COMPLIANCE
000006*                            VMOD=2.059                          *
000007*                                                                *
000008*   FILE DESCRIPTION = SYSTEM CONTROL FILE                       *
000009*                                                                *
000010*   FILE TYPE = VSAM,KSDS                                        *
000011*   RECORD SIZE = 750  RECFORM = FIXED                           *
000012*                                                                *
000013*   BASE CLUSTER = ELCNTL                        RKP=2,LEN=10    *
000014*       ALTERNATE INDEX = NONE                                   *
000015*                                                                *
000016*   LOG = YES                                                    *
000017*   SERVREQ = BROWSE, DELETE, UPDATE, NEWREC                     *
000018******************************************************************
000019*                   C H A N G E   L O G
000020*
000021* CHANGES ARE MARKED BY THE CHANGE EFFECTIVE DATE.
000022*-----------------------------------------------------------------
000023*  CHANGE   CHANGE REQUEST PGMR  DESCRIPTION OF CHANGE
000024* EFFECTIVE    NUMBER
000025*-----------------------------------------------------------------
000026* 082503                   PEMA  ADD BENEFIT GROUP
000027* 100703    2003080800002  PEMA  ADD SUPERGAP PROCESSING
000028* 033104    2003080800002  PEMA  ADD GAP NON REFUNDABLE OPTION
000029* 092705    2005050300006  PEMA  ADD SPP LEASES
000030* 031808    2006032200004  AJRA  ADD APPROVAL LEVEL 4
000031* 071508  CR2007110500003  PEMA  ADD NH INTEREST REFUND PROCESSING
000032* 091808    2008022800002  AJRA  ADD CHECK NUMBER TO STATE CNTL FO
000033* 011410    2009061500002  AJRA  ADD REFUND IND FOR AH AND DEATH C
000034* 061511    2011042000002  AJRA  ADD IND TO VERIFY 2ND BENEFICIARY
000035* 011812    2011022800001  AJRA  ADD CSR IND TO USER SECURITY
000036* 012913    2012092400007  AJRA  ADD CAUSAL STATE IND
000037* 032813    2011013100001  AJRA  ADD CLAIM REAUDIT FIELDS
000038* 091813    2013082900001  AJRA  ADD APPROVAL LEVEL 5
000039* 051414  CR2013021100002  PEMA  RECURRENT CLAIM CHANGES
000040* 102717  CR2017062000003  PEMA  COMM CAP CHANGES
000041******************************************************************
000042*
000043 01  CONTROL-FILE.
000044     12  CF-RECORD-ID                       PIC XX.
000045         88  VALID-CF-ID                        VALUE 'CF'.
000046
000047     12  CF-CONTROL-PRIMARY.
000048         16  CF-COMPANY-ID                  PIC XXX.
000049         16  CF-RECORD-TYPE                 PIC X.
000050             88  CF-COMPANY-MASTER              VALUE '1'.
000051             88  CF-PROCESSOR-MASTER            VALUE '2'.
000052             88  CF-STATE-MASTER                VALUE '3'.
000053             88  CF-LF-BENEFIT-MASTER           VALUE '4'.
000054             88  CF-AH-BENEFIT-MASTER           VALUE '5'.
000055             88  CF-CARRIER-MASTER              VALUE '6'.
000056             88  CF-MORTALITY-MASTER            VALUE '7'.
000057             88  CF-BUSINESS-TYPE-MASTER        VALUE '8'.
000058             88  CF-TERMINAL-MASTER             VALUE '9'.
000059             88  CF-AH-EDIT-MASTER              VALUE 'A'.
000060             88  CF-CREDIBILITY-FACTOR-MASTER   VALUE 'B'.
000061             88  CF-CUSTOM-REPORT-MASTER        VALUE 'C'.
000062             88  CF-MORTGAGE-HT-WT-CHART        VALUE 'H'.
000063             88  CF-LIFE-EDIT-MASTER            VALUE 'L'.
000064             88  CF-MORTGAGE-PLAN-MASTER        VALUE 'M'.
000065             88  CF-MORTGAGE-COMPANY-MASTER     VALUE 'N'.
000066             88  CF-REMINDERS-MASTER            VALUE 'R'.
000067             88  CF-AUTO-ACTIVITY-MASTER        VALUE 'T'.
000068         16  CF-ACCESS-CD-GENL              PIC X(4).
000069         16  CF-ACCESS-OF-PROCESSOR  REDEFINES CF-ACCESS-CD-GENL.
000070             20  CF-PROCESSOR               PIC X(4).
000071         16  CF-ACCESS-OF-STATE  REDEFINES  CF-ACCESS-CD-GENL.
000072             20  CF-STATE-CODE              PIC XX.
000073             20  FILLER                     PIC XX.
000074         16  CF-ACCESS-OF-BENEFIT  REDEFINES  CF-ACCESS-CD-GENL.
000075             20  FILLER                     PIC XX.
000076             20  CF-HI-BEN-IN-REC           PIC XX.
000077         16  CF-ACCESS-OF-CARRIER  REDEFINES  CF-ACCESS-CD-GENL.
000078             20  FILLER                     PIC XXX.
000079             20  CF-CARRIER-CNTL            PIC X.
000080         16  CF-ACCESS-OF-BUS-TYPE REDEFINES  CF-ACCESS-CD-GENL.
000081             20  FILLER                     PIC XX.
000082             20  CF-HI-TYPE-IN-REC          PIC 99.
000083         16  CF-ACCESS-OF-CRDB-TBL REDEFINES  CF-ACCESS-CD-GENL.
000084             20  CF-CRDB-TABLE-INDICATOR    PIC X.
000085                 88  CF-CRDB-NAIC-TABLE         VALUE '9'.
000086             20  CF-CRDB-BENEFIT-TYPE       PIC X.
000087             20  CF-CRDB-WAITING-PERIOD     PIC XX.
000088         16  CF-ACCESS-OF-CUST-RPT REDEFINES  CF-ACCESS-CD-GENL.
000089             20  FILLER                     PIC X.
000090             20  CF-CUSTOM-REPORT-NO        PIC 999.
000091         16  CF-ACCESS-OF-PLAN   REDEFINES  CF-ACCESS-CD-GENL.
000092             20  FILLER                     PIC XX.
000093             20  CF-MORTGAGE-PLAN           PIC XX.
000094         16  CF-SEQUENCE-NO                 PIC S9(4)   COMP.
000095
000096     12  CF-LAST-MAINT-DT                   PIC XX.
000097     12  CF-LAST-MAINT-BY                   PIC X(4).
000098     12  CF-LAST-MAINT-HHMMSS               PIC S9(6)   COMP-3.
000099
000100     12  CF-RECORD-BODY                     PIC X(728).
000101
000102
000103****************************************************************
000104*             COMPANY MASTER RECORD                            *
000105****************************************************************
000106
000107     12  CF-COMPANY-MASTER-REC  REDEFINES  CF-RECORD-BODY.
000108         16  CF-COMPANY-ADDRESS.
000109             20  CF-CL-MAIL-TO-NAME         PIC X(30).
000110             20  CF-CL-IN-CARE-OF           PIC X(30).
000111             20  CF-CL-ADDR-LINE-1          PIC X(30).
000112             20  CF-CL-ADDR-LINE-2          PIC X(30).
000113             20  CF-CL-CITY-STATE           PIC X(30).
000114             20  CF-CL-ZIP-CODE-NUM         PIC 9(9)    COMP-3.
000115             20  CF-CL-PHONE-NO             PIC 9(11)   COMP-3.
000116         16  CF-COMPANY-CD                  PIC X.
000117         16  CF-COMPANY-PASSWORD            PIC X(8).
000118         16  CF-SECURITY-OPTION             PIC X.
000119             88  ALL-SECURITY                   VALUE '1'.
000120             88  COMPANY-VERIFY                 VALUE '2'.
000121             88  PROCESSOR-VERIFY               VALUE '3'.
000122             88  NO-SECURITY                    VALUE '4'.
000123             88  ALL-BUT-TERM                   VALUE '5'.
000124         16  CF-CARRIER-CONTROL-LEVEL       PIC X.
000125             88  USE-ACTUAL-CARRIER             VALUE SPACE.
000126         16  CF-LGX-INTERFACE-CNTL          PIC X.
000127             88  LGX-TIME-SHR-COMPANY           VALUE '1'.
000128         16  CF-INFORCE-LOCATION            PIC X.
000129             88  CERTS-ARE-ONLINE               VALUE '1'.
000130             88  CERTS-ARE-OFFLINE              VALUE '2'.
000131             88  NO-CERTS-AVAILABLE             VALUE '3'.
000132         16  CF-LOWER-CASE-LETTERS          PIC X.
000133         16  CF-CERT-ACCESS-CONTROL         PIC X.
000134             88  CF-ST-ACCNT-CNTL               VALUE ' '.
000135             88  CF-CARR-GROUP-ST-ACCNT-CNTL    VALUE '1'.
000136             88  CF-CARR-ST-ACCNT-CNTL          VALUE '2'.
000137             88  CF-ACCNT-CNTL                  VALUE '3'.
000138             88  CF-CARR-ACCNT-CNTL             VALUE '4'.
000139
000140         16  CF-FORMS-PRINTER-ID            PIC X(4).
000141         16  CF-CHECK-PRINTER-ID            PIC X(4).
000142
000143         16  CF-LGX-CREDIT-USER             PIC X.
000144             88  CO-IS-NOT-USER                 VALUE 'N'.
000145             88  CO-HAS-CLAS-IC-CREDIT          VALUE 'Y'.
000146
000147         16 CF-CREDIT-CALC-CODES.
000148             20  CF-CR-REM-TERM-CALC PIC X.
000149               88  CR-EARN-AFTER-15TH           VALUE '1'.
000150               88  CR-EARN-ON-HALF-MO           VALUE '2'.
000151               88  CR-EARN-ON-1ST-DAY           VALUE '3'.
000152               88  CR-EARN-ON-FULL-MO           VALUE '4'.
000153               88  CR-EARN-WITH-NO-DAYS         VALUE '5'.
000154               88  CR-EARN-AFTER-14TH           VALUE '6'.
000155               88  CR-EARN-AFTER-16TH           VALUE '7'.
000156             20  CF-CR-R78-METHOD           PIC X.
000157               88  USE-TERM-PLUS-ONE            VALUE SPACE.
000158               88  DONT-USE-PLUS-ONE            VALUE '1'.
000159
000160         16  CF-CLAIM-CONTROL-COUNTS.
000161             20  CF-CO-CLAIM-COUNTER        PIC S9(8)   COMP.
000162                 88  CO-CLM-COUNT-RESET         VALUE +99999.
000163
000164             20  CF-CO-ARCHIVE-COUNTER      PIC S9(8)   COMP.
000165                 88  CO-ARCHIVE-COUNT-RESET     VALUE +999999.
000166
000167             20  CF-CO-CHECK-COUNTER        PIC S9(8)   COMP.
000168                 88  CO-CHECK-COUNT-RESET       VALUE +9999999.
000169
000170             20  CF-CO-CHECK-QUE-COUNTER    PIC S9(8)   COMP.
000171                 88  CO-QUE-COUNT-RESET         VALUE +9999999.
000172
000173         16  CF-CURRENT-MONTH-END           PIC XX.
000174
000175         16  CF-CO-CALC-QUOTE-TOLERANCE.
000176             20  CF-CO-TOL-CLAIM            PIC S999V99   COMP-3.
000177             20  CF-CO-TOL-PREM             PIC S999V99   COMP-3.
000178             20  CF-CO-TOL-REFUND           PIC S999V99   COMP-3.
000179             20  CF-CO-CLAIM-REJECT-SW      PIC X.
000180                 88 CO-WARN-IF-CLAIM-OUT        VALUE SPACE.
000181                 88 CO-FORCE-IF-CLAIM-OUT       VALUE '1'.
000182             20  CF-CO-PREM-REJECT-SW       PIC X.
000183                 88 CO-WARN-IF-PREM-OUT         VALUE SPACE.
000184                 88 CO-FORCE-IF-PREM-OUT        VALUE '1'.
000185             20  CF-CO-REF-REJECT-SW        PIC X.
000186                 88 CO-WARN-IF-REF-OUT          VALUE SPACE.
000187                 88 CO-FORCE-IF-REF-OUT         VALUE '1'.
000188
000189         16  CF-CO-REPORTING-DT             PIC XX.
000190         16  CF-CO-REPORTING-MONTH-DT       PIC XX.
000191         16  CF-CO-REPORTING-MONTH-END-SW   PIC X.
000192           88  CF-CO-NOT-MONTH-END              VALUE SPACES.
000193           88  CF-CO-MONTH-END                  VALUE '1'.
000194
000195         16  CF-LGX-CLAIM-USER              PIC X.
000196             88  CO-IS-NOT-CLAIM-USER           VALUE 'N'.
000197             88  CO-HAS-CLAS-IC-CLAIM           VALUE 'Y'.
000198
000199         16  CF-CREDIT-EDIT-CONTROLS.
000200             20  CF-MIN-PREMIUM             PIC S999V99   COMP-3.
000201             20  CF-MIN-AGE                 PIC 99.
000202             20  CF-DEFAULT-AGE             PIC 99.
000203             20  CF-MIN-TERM                PIC S999      COMP-3.
000204             20  CF-MAX-TERM                PIC S999      COMP-3.
000205             20  CF-DEFAULT-SEX             PIC X.
000206             20  CF-JOINT-AGE-INPUT         PIC X.
000207                 88 CF-JOINT-AGE-IS-INPUT       VALUE '1'.
000208             20  CF-BIRTH-DATE-INPUT        PIC X.
000209                 88 CF-BIRTH-DATE-IS-INPUT      VALUE '1'.
000210             20  CF-CAR-GROUP-ACCESS-CNTL   PIC X.
000211                 88  CF-USE-ACTUAL-CARRIER      VALUE ' '.
000212                 88  CF-ZERO-CARRIER            VALUE '1'.
000213                 88  CF-ZERO-GROUPING           VALUE '2'.
000214                 88  CF-ZERO-CAR-GROUP          VALUE '3'.
000215             20  CF-EDIT-SW                 PIC X.
000216                 88  CF-START-EDIT-TONIGHT      VALUE '1'.
000217             20  CF-EDIT-RESTART-BATCH      PIC X(6).
000218             20  CF-CR-PR-METHOD            PIC X.
000219               88  USE-NORMAL-PR-METHOD         VALUE SPACE.
000220               88  ADJUST-ORIG-TERM-BY-5        VALUE '1'.
000221             20  FILLER                     PIC X.
000222
000223         16  CF-CREDIT-MISC-CONTROLS.
000224             20  CF-REIN-TABLE-SW           PIC X.
000225                 88 REIN-TABLES-ARE-USED        VALUE '1'.
000226             20  CF-COMP-TABLE-SW           PIC X.
000227                 88 COMP-TABLES-ARE-USED        VALUE '1'.
000228             20  CF-EXPERIENCE-RETENTION-AGE
000229                                            PIC S9        COMP-3.
000230             20  CF-CONVERSION-DT           PIC XX.
000231             20  CF-COMP-WRITE-OFF-AMT      PIC S999V99   COMP-3.
000232             20  CF-RUN-FREQUENCY-SW        PIC X.
000233                 88 CO-IS-PROCESSED-MONTHLY     VALUE SPACE.
000234                 88 CO-IS-PROCESSED-ON-QTR      VALUE '1'.
000235
000236             20  CF-CR-CHECK-NO-CONTROL.
000237                 24  CF-CR-CHECK-NO-METHOD    PIC X.
000238                     88  CR-CHECK-NO-MANUAL       VALUE '1'.
000239                     88  CR-CHECK-NO-AUTO-SEQ     VALUE '2'.
000240                     88  CR-CHECK-NO-AT-PRINT     VALUE '4'.
000241                 24  CF-CR-CHECK-COUNTER      PIC S9(8)   COMP.
000242                     88  CR-CHECK-CNT-RESET-VALUE VALUE +999999.
000243
000244                 24  CF-CR-CHECK-COUNT       REDEFINES
000245                     CF-CR-CHECK-COUNTER      PIC X(4).
000246
000247                 24  CF-CR-CHECK-QUE-COUNTER  PIC S9(8)  COMP.
000248                     88  CR-QUE-COUNT-RESET      VALUE +9999999.
000249
000250                 24  CF-CR-CHECK-QUE-COUNT   REDEFINES
000251                     CF-CR-CHECK-QUE-COUNTER  PIC X(4).
000252                 24  CF-MAIL-PROCESSING       PIC X.
000253                     88  MAIL-PROCESSING          VALUE 'Y'.
000254
000255         16  CF-MISC-SYSTEM-CONTROL.
000256             20  CF-SYSTEM-C                 PIC X.
000257                 88  CONFIRMATION-SYS-USED       VALUE '1'.
000258             20  CF-SYSTEM-D                 PIC X.
000259                 88  DAILY-BILL-SYS-USED         VALUE '1'.
000260             20  CF-SOC-SEC-NO-SW            PIC X.
000261                 88  SOC-SEC-NO-USED             VALUE '1'.
000262             20  CF-MEMBER-NO-SW             PIC X.
000263                 88  MEMBER-NO-USED              VALUE '1'.
000264             20  CF-TAX-ID-NUMBER            PIC X(11).
000265             20  CF-JOURNAL-FILE-ID          PIC S9(4) COMP.
000266             20  CF-PAYMENT-APPROVAL-SW      PIC X.
000267                 88  CF-PMT-APPROVAL-USED        VALUE 'Y' 'G'.
000268                 88  CF-NO-APPROVAL              VALUE ' ' 'N'.
000269                 88  CF-ALL-APPROVED             VALUE 'Y'.
000270                 88  CF-GRADUATED-APPROVAL       VALUE 'G'.
000271             20  CF-SYSTEM-E                 PIC X.
000272                 88  CF-AR-SYSTEM-USED           VALUE 'Y'.
000273
000274         16  CF-LGX-LIFE-USER               PIC X.
000275             88  CO-IS-NOT-LIFE-USER            VALUE 'N'.
000276             88  CO-HAS-CLAS-IC-LIFE            VALUE 'Y'.
000277
000278         16  CF-CR-MONTH-END-DT             PIC XX.
000279
000280         16  CF-FILE-MAINT-DATES.
000281             20  CF-LAST-BATCH-NO           PIC S9(8)   COMP.
000282                 88  CF-LAST-BATCH-RESET        VALUE +999999.
000283             20  CF-LAST-BATCH       REDEFINES
000284                 CF-LAST-BATCH-NO               PIC X(4).
000285             20  CF-RATES-FILE-MAINT-DT         PIC XX.
000286             20  CF-RATES-FILE-CREATE-DT        PIC XX.
000287             20  CF-COMMISSION-TAB-MAINT-DT     PIC XX.
000288             20  CF-COMMISSION-TAB-CREATE-DT    PIC XX.
000289             20  CF-ACCOUNT-MSTR-MAINT-DT       PIC XX.
000290             20  CF-ACCOUNT-MSTR-CREATE-DT      PIC XX.
000291             20  CF-REINSURANCE-TAB-MAINT-DT    PIC XX.
000292             20  CF-REINSURANCE-TAB-CREATE-DT   PIC XX.
000293             20  CF-COMPENSATION-MSTR-MAINT-DT  PIC XX.
000294             20  CF-COMPENSATION-MSTR-CREATE-DT PIC XX.
000295
000296         16  CF-NEXT-COMPANY-ID             PIC XXX.
000297         16  FILLER                         PIC X.
000298
000299         16  CF-ALT-MORT-CODE               PIC X(4).
000300         16  CF-MEMBER-CAPTION              PIC X(10).
000301
000302         16  CF-LIFE-ACCESS-CONTROL         PIC X.
000303             88  CF-LIFE-ST-ACCNT-CNTL          VALUE ' '.
000304             88  CF-LIFE-CARR-GRP-ST-ACCNT-CNTL VALUE '1'.
000305             88  CF-LIFE-CARR-ST-ACCNT-CNTL     VALUE '2'.
000306             88  CF-LIFE-ACCNT-CNTL             VALUE '3'.
000307             88  CF-LIFE-CARR-ACCNT-CNTL        VALUE '4'.
000308
000309         16  CF-STARTING-ARCH-NO            PIC S9(8) COMP.
000310
000311         16  CF-LIFE-OVERRIDE-L1            PIC X.
000312         16  CF-LIFE-OVERRIDE-L2            PIC XX.
000313         16  CF-LIFE-OVERRIDE-L6            PIC X(6).
000314         16  CF-LIFE-OVERRIDE-L12           PIC X(12).
000315
000316         16  CF-AH-OVERRIDE-L1              PIC X.
000317         16  CF-AH-OVERRIDE-L2              PIC XX.
000318         16  CF-AH-OVERRIDE-L6              PIC X(6).
000319         16  CF-AH-OVERRIDE-L12             PIC X(12).
000320
000321         16  CF-REPORT-CD1-CAPTION          PIC X(10).
000322         16  CF-REPORT-CD2-CAPTION          PIC X(10).
000323
000324         16  CF-CLAIM-CUTOFF-DATE           PIC XX.
000325         16  CF-AR-LAST-EL860-DT            PIC XX.
000326         16  CF-MP-MONTH-END-DT             PIC XX.
000327
000328         16  CF-MAX-NUM-PMTS-CHECK          PIC 99.
000329         16  CF-CLAIM-PAID-THRU-TO          PIC X.
000330             88  CF-CLAIM-PAID-TO               VALUE '1'.
000331
000332         16  CF-AR-MONTH-END-DT             PIC XX.
000333
000334         16  CF-CRDTCRD-USER                PIC X.
000335             88  CO-IS-NOT-CRDTCRD-USER         VALUE 'N'.
000336             88  CO-HAS-CLAS-IC-CRDTCRD         VALUE 'Y'.
000337
000338         16  CF-CC-MONTH-END-DT             PIC XX.
000339
000340         16  CF-PRINT-ADDRESS-LABELS        PIC X.
000341
000342         16  CF-MORTALITY-AGE-CALC-METHOD   PIC X.
000343             88  CF-USE-TABLE-ASSIGNED-METHOD   VALUE '1' ' '.
000344             88  CF-USE-ALL-AGE-LAST            VALUE '2'.
000345             88  CF-USE-ALL-AGE-NEAR            VALUE '3'.
000346         16  CF-CO-TOL-PREM-PCT             PIC S9V9(4)   COMP-3.
000347         16  CF-CO-TOL-REFUND-PCT           PIC S9V9(4)   COMP-3.
000348         16  CF-CO-TOL-CAP                  PIC S9(3)V99  COMP-3.
000349         16  CF-CO-RESERVE-OPTION-SWITCH    PIC  X.
000350             88  OPTIONAL-RESERVE-METHOD-AUTH    VALUE 'Y'.
000351             88  OPTIONAL-RESERVE-MTHD-NOT-AUTH  VALUE ' ' 'N'.
000352         16  CF-CO-IBNR-LAG-MONTHS          PIC S9(3)     COMP-3.
000353         16  CF-CO-CIDA-TABLE-DISCOUNT-PCT  PIC S9V9(4)   COMP-3.
000354         16  CF-CO-CRDB-TABLE-SELECTION     PIC  X.
000355             88  NIAC-CREDIBILITY-TABLE          VALUE '9'.
000356         16  CF-CO-ST-CALL-RPT-CNTL         PIC  X.
000357
000358         16  CF-CL-ZIP-CODE.
000359             20  CF-CL-ZIP-PRIME.
000360                 24  CF-CL-ZIP-1ST          PIC X.
000361                     88  CF-CL-CAN-POST-CODE  VALUE 'A' THRU 'Z'.
000362                 24  FILLER                 PIC X(4).
000363             20  CF-CL-ZIP-PLUS4            PIC X(4).
000364         16  CF-CL-CANADIAN-POSTAL-CODE REDEFINES CF-CL-ZIP-CODE.
000365             20  CF-CL-CAN-POSTAL-1         PIC XXX.
000366             20  CF-CL-CAN-POSTAL-2         PIC XXX.
000367             20  FILLER                     PIC XXX.
000368
000369         16  CF-CO-CALCULATION-INTEREST     PIC S9V9(4)  COMP-3.
000370         16  CF-CO-IBNR-AH-FACTOR           PIC S9V9(4)  COMP-3.
000371         16  CF-CO-IBNR-LIFE-FACTOR         PIC S9V9(4)  COMP-3.
000372         16  CF-CO-OPTION-START-DATE        PIC XX.
000373         16  CF-REM-TRM-CALC-OPTION         PIC X.
000374           88  CF-VALID-REM-TRM-OPTION          VALUE '1' '2'
000375                                                      '3' '4'.
000376           88  CF-CONSIDER-EXTENSION            VALUE '3' '4'.
000377           88  CF-30-DAY-MONTH                  VALUE '1' '3'.
000378           88  CF-NO-EXT-30-DAY-MONTH           VALUE '1'.
000379           88  CF-NO-EXT-ACTUAL-DAYS            VALUE '2'.
000380           88  CF-EXT-30-DAY-MONTH              VALUE '3'.
000381           88  CF-EXT-ACTUAL-DAYS               VALUE '4'.
000382
000383         16  CF-DEFAULT-APR                 PIC S999V9(4) COMP-3.
000384
000385         16  CF-PAYMENT-APPROVAL-LEVELS.
000386             20  CF-LIFE-PAY-APP-LEVEL-1    PIC S9(7)   COMP-3.
000387             20  CF-LIFE-PAY-APP-LEVEL-2    PIC S9(7)   COMP-3.
000388             20  CF-LIFE-PAY-APP-LEVEL-3    PIC S9(7)   COMP-3.
000389             20  CF-AH-PAY-APP-LEVEL-1      PIC S9(7)   COMP-3.
000390             20  CF-AH-PAY-APP-LEVEL-2      PIC S9(7)   COMP-3.
000391             20  CF-AH-PAY-APP-LEVEL-3      PIC S9(7)   COMP-3.
000392
000393         16  CF-END-USER-REPORTING-USER     PIC X.
000394             88  CO-NO-END-USER-REPORTING       VALUE 'N'.
000395             88  CO-USES-END-USER-REPORTING     VALUE 'Y'.
000396
000397         16  CF-CLAIMS-CHECK-RECON-USER     PIC X.
000398             88  CO-NO-USE-CLAIMS-RECON         VALUE 'N'.
000399             88  CO-USES-CLAIMS-RECON           VALUE 'Y'.
000400
000401         16  CF-CLAIMS-LAST-PROCESS-DT      PIC XX.
000402
000403         16  CF-CREDIT-REF-SSN-CNT          PIC S9(5)  COMP-3.
000404         16  FILLER                         PIC X.
000405
000406         16  CF-CREDIT-ARCHIVE-CNTL.
000407             20  CF-CREDIT-LAST-ARCH-NUM    PIC S9(9)  COMP-3.
000408             20  CF-CREDIT-START-ARCH-NUM   PIC S9(9)  COMP-3.
000409             20  CF-CREDIT-ARCH-PURGE-YR    PIC S9     COMP-3.
000410
000411         16  CF-CR-PRINT-ADDRESS-LABELS     PIC X.
000412
000413         16  CF-CLAIMS-AUDIT-CHANGES        PIC X.
000414             88  CO-NO-USE-AUDIT-CHANGES        VALUE 'N'.
000415             88  CO-USES-AUDIT-CHANGES          VALUE 'Y'.
000416
000417         16  CF-CLAIMS-CREDIT-CARD-INDEX    PIC X.
000418             88  CO-NO-USE-CREDIT-CARD-INDEX    VALUE 'N'.
000419             88  CO-USES-CREDIT-CARD-INDEX      VALUE 'Y'.
000420
000421         16  CF-CLAIMS-LETTER-MAINT-DAYS    PIC 99.
000422
000423         16  CF-CO-ACH-ID-CODE              PIC  X.
000424             88  CF-CO-ACH-ICD-IRS-EIN          VALUE '1'.
000425             88  CF-CO-ACH-ICD-DUNS             VALUE '2'.
000426             88  CF-CO-ACH-ICD-USER-NO          VALUE '3'.
000427         16  CF-CO-ACH-CLAIM-SEND-NAME      PIC X(23).
000428         16  CF-CO-ACH-CLAIM-BK-NO          PIC X(09).
000429         16  CF-CO-ACH-ADMIN-SEND-NAME      PIC X(23).
000430         16  CF-CO-ACH-ADMIN-NO             PIC X(09).
000431         16  CF-CO-ACH-RECV-NAME            PIC X(23).
000432         16  CF-CO-ACH-RECV-NO              PIC X(08).
000433         16  CF-CO-ACH-ORIGINATOR-NO        PIC X(08).
000434         16  CF-CO-ACH-COMPANY-ID           PIC X(09).
000435         16  CF-CO-ACH-TRACE-NO             PIC 9(07) COMP.
000436                 88  CO-ACH-TRACE-NO-RESET      VALUE 9999999.
000437         16  CF-CO-ACH-TRACE-SPACE REDEFINES
000438                 CF-CO-ACH-TRACE-NO         PIC X(4).
000439
000440         16  CF-CO-OVER-SHORT.
000441             20 CF-CO-OVR-SHT-AMT           PIC S999V99   COMP-3.
000442             20 CF-CO-OVR-SHT-PCT           PIC S9V9(4)   COMP-3.
000443
000444*         16  FILLER                         PIC X(102).
000445         16  CF-PAYMENT-APPROVAL-LEVELS-2.
000446             20  CF-LIFE-PAY-APP-LEVEL-4    PIC S9(7)   COMP-3.
000447             20  CF-AH-PAY-APP-LEVEL-4      PIC S9(7)   COMP-3.
000448
000449         16  CF-AH-APPROVAL-DAYS.
000450             20  CF-AH-APP-DAY-LEVEL-1     PIC S9(5)   COMP-3.
000451             20  CF-AH-APP-DAY-LEVEL-2     PIC S9(5)   COMP-3.
000452             20  CF-AH-APP-DAY-LEVEL-3     PIC S9(5)   COMP-3.
000453             20  CF-AH-APP-DAY-LEVEL-4     PIC S9(5)   COMP-3.
000454
000455         16  CF-CO-REAUDIT-INTERVAL        PIC S9(5)   COMP-3.
000456
000457         16  CF-APPROV-LEV-5.
000458             20  CF-LIFE-PAY-APP-LEVEL-5    PIC S9(7)   COMP-3.
000459             20  CF-AH-PAY-APP-LEVEL-5      PIC S9(7)   COMP-3.
000460             20  CF-AH-APP-DAY-LEVEL-5      PIC S9(5)   COMP-3.
000461
000462         16  FILLER                         PIC X(68).
000463****************************************************************
000464*             PROCESSOR/USER RECORD                            *
000465****************************************************************
000466
000467     12  CF-PROCESSOR-MASTER-REC  REDEFINES  CF-RECORD-BODY.
000468         16  CF-PROCESSOR-NAME              PIC X(30).
000469         16  CF-PROCESSOR-PASSWORD          PIC X(11).
000470         16  CF-PROCESSOR-TITLE             PIC X(26).
000471         16  CF-MESSAGE-AT-LOGON-CAP        PIC X.
000472                 88  MESSAGE-YES                VALUE 'Y'.
000473                 88  MESSAGE-NO                 VALUE ' ' 'N'.
000474
000475*****************************************************
000476****  OCCURRENCE (1) CREDIT APPLICATIONS         ****
000477****  OCCURRENCE (2) CLAIMS APPLICATIONS         ****
000478****  OCCURRENCE (3) CREDIT CARD APPLICATIONS    ****
000479****  OCCURRENCE (4) ACCT RECV APPLICATIONS      ****
000480*****************************************************
000481
000482         16  CF-SYSTEM-SECURITY  OCCURS  4 TIMES.
000483             20  CF-ADMINISTRATION-CONTROLS PIC XX.
000484             20  CF-APPLICATION-FORCE       PIC X.
000485             20  CF-INDIVIDUAL-APP.
000486                 24  CF-APP-SWITCHES  OCCURS  44 TIMES.
000487                     28  CF-BROWSE-APP      PIC X.
000488                     28  CF-UPDATE-APP      PIC X.
000489
000490         16  CF-CURRENT-TERM-ON             PIC X(4).
000491         16  CF-PROCESSOR-LIMITS-CLAIMS.
000492             20  CF-PROC-CALC-AMT-TOL       PIC S999V99   COMP-3.
000493             20  CF-PROC-MAX-REG-PMT        PIC S9(7)V99  COMP-3.
000494             20  CF-PROC-MAX-REG-DAYS       PIC S999      COMP-3.
000495             20  CF-PROC-MAX-AUTO-PMT       PIC S9(7)V99  COMP-3.
000496             20  CF-PROC-MAX-AUTO-MOS       PIC S999      COMP-3.
000497             20  CF-PROC-CALC-DAYS-TOL      PIC S999      COMP-3.
000498             20  CF-PROC-MAX-LF-PMT         PIC S9(7)V99  COMP-3.
000499         16  CF-PROCESSOR-CARRIER           PIC X.
000500             88  NO-CARRIER-SECURITY            VALUE ' '.
000501         16  CF-PROCESSOR-ACCOUNT           PIC X(10).
000502             88  NO-ACCOUNT-SECURITY            VALUE SPACES.
000503         16  CF-PROCESSOR-LIFE-ACCESS       PIC X.
000504             88  PROCESSOR-HAS-LIFE-ACCESS      VALUE 'Y'.
000505         16  CF-PROCESSOR-USER-ALMIGHTY     PIC X.
000506             88  PROCESSOR-USER-IS-ALMIGHTY     VALUE 'Y'.
000507
000508         16  CF-PROC-SYS-ACCESS-SW.
000509             20  CF-PROC-CREDIT-CLAIMS-SW.
000510                 24  CF-PROC-SYS-ACCESS-CREDIT  PIC X.
000511                     88  ACCESS-TO-CREDIT           VALUE 'Y'.
000512                 24  CF-PROC-SYS-ACCESS-CLAIMS  PIC X.
000513                     88  ACCESS-TO-CLAIMS           VALUE 'Y'.
000514             20  CF-PROC-CREDIT-CLAIMS   REDEFINES
000515                 CF-PROC-CREDIT-CLAIMS-SW       PIC XX.
000516                 88  ACCESS-TO-CLAIM-CREDIT         VALUE 'YY'.
000517             20  CF-PROC-LIFE-GNRLDGR-SW.
000518                 24  CF-PROC-SYS-ACCESS-LIFE    PIC X.
000519                     88  ACCESS-TO-LIFE             VALUE 'Y'.
000520                 24  CF-PROC-SYS-ACCESS-GNRLDGR PIC X.
000521                     88  ACCESS-TO-GNRLDGR          VALUE 'Y'.
000522             20  CF-PROC-LIFE-GNRLDGR    REDEFINES
000523                 CF-PROC-LIFE-GNRLDGR-SW        PIC XX.
000524                 88  ACCESS-TO-LIFE-GNRLDGR         VALUE 'YY'.
000525         16  CF-PROC-SYS-ACCESS-ALL      REDEFINES
000526             CF-PROC-SYS-ACCESS-SW              PIC X(4).
000527             88  ACCESS-TO-ALL-SYSTEMS              VALUE 'YYYY'.
000528         16  CF-PROCESSOR-PRINTER               PIC X(4).
000529
000530         16  CF-APPROVAL-LEVEL                  PIC X.
000531             88  APPROVAL-LEVEL-1                   VALUE '1'.
000532             88  APPROVAL-LEVEL-2                   VALUE '2'.
000533             88  APPROVAL-LEVEL-3                   VALUE '3'.
000534             88  APPROVAL-LEVEL-4                   VALUE '4'.
000535             88  APPROVAL-LEVEL-5                   VALUE '5'.
000536
000537         16  CF-PROC-MAX-EXP-PMT            PIC S9(7)V99  COMP-3.
000538
000539         16  CF-LANGUAGE-TYPE                   PIC X.
000540             88  CF-LANG-IS-ENG                     VALUE 'E'.
000541             88  CF-LANG-IS-FR                      VALUE 'F'.
000542
000543         16  CF-CSR-IND                         PIC X.
000544         16  FILLER                             PIC X(239).
000545
000546****************************************************************
000547*             PROCESSOR/REMINDERS RECORD                       *
000548****************************************************************
000549
000550     12  CF-PROCESSOR-REMINDER-REC  REDEFINES  CF-RECORD-BODY.
000551         16  CF-PROCESSOR-REMINDERS  OCCURS 8 TIMES.
000552             20  CF-START-REMIND-DT         PIC XX.
000553             20  CF-END-REMIND-DT           PIC XX.
000554             20  CF-REMINDER-TEXT           PIC X(50).
000555         16  FILLER                         PIC X(296).
000556
000557
000558****************************************************************
000559*             STATE MASTER RECORD                              *
000560****************************************************************
000561
000562     12  CF-STATE-MASTER-REC  REDEFINES  CF-RECORD-BODY.
000563         16  CF-STATE-ABBREVIATION          PIC XX.
000564         16  CF-STATE-NAME                  PIC X(25).
000565         16  CF-ST-CALC-INTEREST            PIC S9V9(4)   COMP-3.
000566         16  CF-ST-CALC-QUOTE-TOLERANCE.
000567             20  CF-ST-TOL-CLAIM            PIC S999V99   COMP-3.
000568             20  CF-ST-TOL-PREM             PIC S999V99   COMP-3.
000569             20  CF-ST-TOL-REFUND           PIC S999V99   COMP-3.
000570             20  CF-ST-CLAIM-REJECT-SW      PIC X.
000571                 88 ST-WARN-IF-CLAIM-OUT        VALUE SPACE.
000572                 88 ST-FORCE-IF-CLAIM-OUT       VALUE '1'.
000573             20  CF-ST-PREM-REJECT-SW       PIC X.
000574                 88 ST-WARN-IF-PREM-OUT         VALUE SPACE.
000575                 88 ST-FORCE-IF-PREM-OUT        VALUE '1'.
000576             20  CF-ST-REF-REJECT-SW        PIC X.
000577                 88 ST-WARN-IF-REF-OUT          VALUE SPACE.
000578                 88 ST-FORCE-IF-REF-OUT         VALUE '1'.
000579         16  CF-ST-LF-EXP-PCT               PIC S999V9(4) COMP-3.
000580         16  CF-ST-AH-EXP-PCT               PIC S999V9(4) COMP-3.
000581         16  CF-ST-REFUND-RULES.
000582             20  CF-ST-REFUND-MIN           PIC S999V99    COMP-3.
000583             20  CF-ST-REFUND-DAYS-FIRST    PIC 99.
000584             20  CF-ST-REFUND-DAYS-SUBSEQ   PIC 99.
000585         16  CF-ST-FST-PMT-EXTENSION.
000586             20  CF-ST-FST-PMT-DAYS-MAX     PIC 999.
000587             20  CF-ST-FST-PMT-DAYS-CHG     PIC X.
000588                 88  CF-ST-EXT-NO-CHG           VALUE ' '.
000589                 88  CF-ST-EXT-CHG-LF           VALUE '1'.
000590                 88  CF-ST-EXT-CHG-AH           VALUE '2'.
000591                 88  CF-ST-EXT-CHG-LF-AH        VALUE '3'.
000592         16  CF-ST-STATE-CALL.
000593             20  CF-ST-CALL-UNEARNED        PIC X.
000594             20  CF-ST-CALL-RPT-CNTL        PIC X.
000595             20  CF-ST-CALL-RATE-DEV        PIC XXX.
000596         16  CF-REPLACEMENT-LAW-SW          PIC X.
000597             88  CF-REPLACEMENT-LAW-APPLIES     VALUE 'Y'.
000598             88  CF-REPL-LAW-NOT-APPLICABLE     VALUE 'N'.
000599         16  CF-REPLACEMENT-LETTER          PIC X(4).
000600         16  CF-ST-TOL-PREM-PCT             PIC S9V9999 COMP-3.
000601         16  CF-ST-TOL-REF-PCT              PIC S9V9999 COMP-3.
000602         16  CF-ST-TARGET-LOSS-RATIO        PIC S9V9(4) COMP-3.
000603         16  CF-ST-SPLIT-PAYMENT            PIC X.
000604         16  FILLER                         PIC X.
000605         16  CF-STATE-BENEFIT-CNTL  OCCURS 50 TIMES.
000606             20  CF-ST-BENEFIT-CD           PIC XX.
000607             20  CF-ST-BENEFIT-KIND         PIC X.
000608                 88  CF-ST-LIFE-KIND            VALUE 'L'.
000609                 88  CF-ST-AH-KIND              VALUE 'A'.
000610             20  CF-ST-REM-TERM-CALC        PIC X.
000611                 88  ST-REM-TERM-NOT-USED       VALUE SPACE.
000612                 88  ST-EARN-AFTER-15TH         VALUE '1'.
000613                 88  ST-EARN-ON-HALF-MO         VALUE '2'.
000614                 88  ST-EARN-ON-1ST-DAY         VALUE '3'.
000615                 88  ST-EARN-ON-FULL-MO         VALUE '4'.
000616                 88  ST-EARN-WITH-NO-DAYS       VALUE '5'.
000617                 88  ST-EARN-AFTER-14TH         VALUE '6'.
000618                 88  ST-EARN-AFTER-16TH         VALUE '7'.
000619
000620             20  CF-ST-REFUND-CALC          PIC X.
000621                 88  ST-REFUND-NOT-USED         VALUE SPACE.
000622                 88  ST-REFD-BY-R78             VALUE '1'.
000623                 88  ST-REFD-BY-PRO-RATA        VALUE '2'.
000624                 88  ST-REFD-AS-CALIF           VALUE '3'.
000625                 88  ST-REFD-AS-TEXAS           VALUE '4'.
000626                 88  ST-REFD-IS-NET-PAY         VALUE '5'.
000627                 88  ST-REFD-ANTICIPATION       VALUE '6'.
000628                 88  ST-REFD-UTAH               VALUE '7'.
000629                 88  ST-REFD-SUM-OF-DIGITS      VALUE '9'.
000630                 88  ST-REFD-REG-BALLOON        VALUE 'B'.
000631                 88  ST-REFD-GAP-NON-REFUND     VALUE 'G'.
000632
000633             20  CF-ST-EARNING-CALC         PIC X.
000634                 88  ST-EARNING-NOT-USED        VALUE SPACE.
000635                 88  ST-EARN-BY-R78             VALUE '1'.
000636                 88  ST-EARN-BY-PRO-RATA        VALUE '2'.
000637                 88  ST-EARN-AS-CALIF           VALUE '3'.
000638                 88  ST-EARN-AS-TEXAS           VALUE '4'.
000639                 88  ST-EARN-IS-NET-PAY         VALUE '5'.
000640                 88  ST-EARN-ANTICIPATION       VALUE '6'.
000641                 88  ST-EARN-MEAN               VALUE '8'.
000642                 88  ST-EARN-REG-BALLOON        VALUE 'B'.
000643
000644             20  CF-ST-OVRD-EARNINGS-CALC   PIC X.
000645                 88  ST-OVERRIDE-NOT-USED       VALUE SPACE.
000646                 88  ST-OVRD-BY-R78             VALUE '1'.
000647                 88  ST-OVRD-BY-PRO-RATA        VALUE '2'.
000648                 88  ST-OVRD-AS-CALIF           VALUE '3'.
000649                 88  ST-OVRD-AS-TEXAS           VALUE '4'.
000650                 88  ST-OVRD-IS-NET-PAY         VALUE '5'.
000651                 88  ST-OVRD-ANTICIPATION       VALUE '6'.
000652                 88  ST-OVRD-MEAN               VALUE '8'.
000653                 88  ST-OVRD-REG-BALLOON        VALUE 'B'.
000654             20  cf-st-extra-periods        pic 9.
000655*            20  FILLER                     PIC X.
000656
000657         16  CF-ST-COMMISSION-CAPS.
000658             20  CF-ST-COMM-CAP-SL          PIC S9V9(4) COMP-3.
000659             20  CF-ST-COMM-CAP-JL          PIC S9V9(4) COMP-3.
000660             20  CF-ST-COMM-CAP-SA          PIC S9V9(4) COMP-3.
000661             20  CF-ST-COMM-CAP-JA          PIC S9V9(4) COMP-3.
000662         16  CF-COMM-CAP-LIMIT-TO           PIC X.
000663                 88  ST-LIMIT-TO-ACCOUNT        VALUE 'A'.
000664                 88  ST-LIMIT-TO-GA             VALUE 'G'.
000665                 88  ST-LIMIT-TO-BOTH           VALUE 'B'.
000666
000667         16  CF-ST-RES-TAX-PCT              PIC S9V9(4) COMP-3.
000668
000669         16  CF-ST-STATUTORY-INTEREST.
000670             20  CF-ST-STAT-DATE-FROM       PIC X.
000671                 88  ST-STAT-FROM-INCURRED      VALUE 'I'.
000672                 88  ST-STAT-FROM-REPORTED      VALUE 'R'.
000673             20  CF-ST-NO-DAYS-ELAPSED      PIC 99.
000674             20  CF-ST-STAT-INTEREST        PIC S9V9(4) COMP-3.
000675             20  CF-ST-STAT-INTEREST-1      PIC S9V9(4) COMP-3.
000676             20  CF-ST-STAT-INTEREST-2      PIC S9V9(4) COMP-3.
000677             20  CF-ST-STAT-INTEREST-3      PIC S9V9(4) COMP-3.
000678
000679         16  CF-ST-OVER-SHORT.
000680             20 CF-ST-OVR-SHT-AMT           PIC S999V99 COMP-3.
000681             20 CF-ST-OVR-SHT-PCT           PIC S9V9(4) COMP-3.
000682
000683         16  CF-ST-FREE-LOOK-PERIOD         PIC S9(3)   COMP-3.
000684
000685         16  CF-ST-RT-CALC                  PIC X.
000686
000687         16  CF-ST-LF-PREM-TAX              PIC S9V9(4) COMP-3.
000688         16  CF-ST-AH-PREM-TAX-I            PIC S9V9(4) COMP-3.
000689         16  CF-ST-AH-PREM-TAX-G            PIC S9V9(4) COMP-3.
000690         16  CF-ST-RF-LR-CALC               PIC X.
000691         16  CF-ST-RF-LL-CALC               PIC X.
000692         16  CF-ST-RF-LN-CALC               PIC X.
000693         16  CF-ST-RF-AH-CALC               PIC X.
000694         16  CF-ST-RF-CP-CALC               PIC X.
000695*        16  FILLER                         PIC X(206).
000696*CIDMOD         16  FILLER                         PIC X(192).
000697         16  CF-ST-CHECK-COUNTER            PIC S9(8)   COMP.
000698             88  CF-ST-CHECK-CNT-RESET      VALUE +9999999.
000699         16  CF-ST-REF-AH-DEATH-IND         PIC X.
000700         16  CF-ST-VFY-2ND-BENE             PIC X.
000701         16  CF-ST-CAUSAL-STATE             PIC X.
000702         16  CF-ST-EXTRA-INTEREST-PERIODS   PIC 9.
000703         16  CF-ST-EXTRA-PAYMENTS           PIC 9.
000704         16  CF-ST-AGENT-SIG-EDIT           PIC X.
000705             88  CF-ST-EDIT-FOR-SIG           VALUE 'Y'.
000706         16  CF-ST-NET-ONLY-STATE           PIC X.
000707             88  CF-ST-IS-NET-ONLY            VALUE 'Y'.
000708         16  cf-commission-cap-required     pic x.
000709         16  CF-ST-GA-COMMISSION-CAPS.
000710             20  CF-ST-GA-COMM-CAP-SL       PIC S9V9(4) COMP-3.
000711             20  CF-ST-GA-COMM-CAP-JL       PIC S9V9(4) COMP-3.
000712             20  CF-ST-GA-COMM-CAP-SA       PIC S9V9(4) COMP-3.
000713             20  CF-ST-GA-COMM-CAP-JA       PIC S9V9(4) COMP-3.
000714         16  CF-ST-TOT-COMMISSION-CAPS.
000715             20  CF-ST-TOT-COMM-CAP-SL      PIC S9V9(4) COMP-3.
000716             20  CF-ST-TOT-COMM-CAP-JL      PIC S9V9(4) COMP-3.
000717             20  CF-ST-TOT-COMM-CAP-SA      PIC S9V9(4) COMP-3.
000718             20  CF-ST-TOT-COMM-CAP-JA      PIC S9V9(4) COMP-3.
000719         16  FILLER                         PIC X(156).
000720
000721****************************************************************
000722*             BENEFIT MASTER RECORD                            *
000723****************************************************************
000724
000725     12  CF-BENEFIT-MASTER-REC  REDEFINES  CF-RECORD-BODY.
000726         16  CF-BENEFIT-CONTROLS  OCCURS 8 TIMES.
000727             20  CF-BENEFIT-CODE            PIC XX.
000728             20  CF-BENEFIT-NUMERIC  REDEFINES
000729                 CF-BENEFIT-CODE            PIC XX.
000730             20  CF-BENEFIT-ALPHA           PIC XXX.
000731             20  CF-BENEFIT-DESCRIP         PIC X(10).
000732             20  CF-BENEFIT-COMMENT         PIC X(10).
000733
000734             20  CF-LF-COVERAGE-TYPE        PIC X.
000735                 88  CF-REDUCING                VALUE 'R'.
000736                 88  CF-LEVEL                   VALUE 'L' 'P'.
000737
000738             20  CF-SPECIAL-CALC-CD         PIC X.
000739                 88  CF-ALTERNATE-NET-PAY       VALUE 'A'.
000740                 88  CF-NP-0-MO-INT             VALUE 'A'.
000741                 88  CF-OB-OFFLINE-RESERVED     VALUE 'B'.
000742                 88  CF-CRITICAL-PERIOD         VALUE 'C'.
000743                 88  CF-TERM-IN-DAYS            VALUE 'D'.
000744                 88  CF-USE-PREMIUM-AS-ENTERED  VALUE 'E'.
000745                 88  CF-FARM-PLAN               VALUE 'F'.
000746                 88  CF-RATE-AS-STANDARD        VALUE 'G'.
000747                 88  CF-2-MTH-INTEREST          VALUE 'I'.
000748                 88  CF-3-MTH-INTEREST          VALUE 'J'.
000749                 88  CF-4-MTH-INTEREST          VALUE 'K'.
000750                 88  CF-BALLOON-LAST-PMT        VALUE 'L'.
000751                 88  CF-MORTGAGE-PROCESSING     VALUE 'M'.
000752                 88  CF-PRUDENTIAL              VALUE 'P'.
000753                 88  CF-OUTSTANDING-BAL         VALUE 'O'.
000754                 88  CF-TRUNCATED-LIFE          VALUE 'T'.
000755                 88  CF-TRUNCATED-LIFE-ONE      VALUE 'U'.
000756                 88  CF-TRUNCATED-LIFE-TWO      VALUE 'V'.
000757                 88  CF-NET-PAY-SIMPLE          VALUE 'S'.
000758                 88  CF-SUMMARY-PROCESSING      VALUE 'Z'.
000759
000760             20  CF-JOINT-INDICATOR         PIC X.
000761                 88  CF-JOINT-COVERAGE          VALUE 'J'.
000762
000763*            20  FILLER                     PIC X(12).
000764             20  cf-maximum-benefits        pic s999 comp-3.
000765             20  FILLER                     PIC X(09).
000766             20  CF-BENEFIT-CATEGORY        PIC X.
000767             20  CF-LOAN-TYPE               PIC X(8).
000768
000769             20  CF-CO-REM-TERM-CALC        PIC X.
000770                 88  CO-EARN-AFTER-15TH         VALUE '1'.
000771                 88  CO-EARN-ON-HALF-MO         VALUE '2'.
000772                 88  CO-EARN-ON-1ST-DAY         VALUE '3'.
000773                 88  CO-EARN-ON-FULL-MO         VALUE '4'.
000774                 88  CO-EARN-WITH-NO-DAYS       VALUE '5'.
000775
000776             20  CF-CO-EARNINGS-CALC        PIC X.
000777                 88  CO-EARN-BY-R78             VALUE '1'.
000778                 88  CO-EARN-BY-PRO-RATA        VALUE '2'.
000779                 88  CO-EARN-AS-CALIF           VALUE '3'.
000780                 88  CO-EARN-AS-TEXAS           VALUE '4'.
000781                 88  CO-EARN-IS-NET-PAY         VALUE '5'.
000782                 88  CO-EARN-ANTICIPATION       VALUE '6'.
000783                 88  CO-EARN-AS-MEAN            VALUE '8'.
000784                 88  CO-EARN-AS-REG-BALLOON     VALUE 'B'.
000785
000786             20  CF-CO-REFUND-CALC          PIC X.
000787                 88  CO-REFUND-NOT-USED         VALUE SPACE.
000788                 88  CO-REFD-BY-R78             VALUE '1'.
000789                 88  CO-REFD-BY-PRO-RATA        VALUE '2'.
000790                 88  CO-REFD-AS-CALIF           VALUE '3'.
000791                 88  CO-REFD-AS-TEXAS           VALUE '4'.
000792                 88  CO-REFD-IS-NET-PAY         VALUE '5'.
000793                 88  CO-REFD-ANTICIPATION       VALUE '6'.
000794                 88  CO-REFD-MEAN               VALUE '8'.
000795                 88  CO-REFD-SUM-OF-DIGITS      VALUE '9'.
000796                 88  CO-REFD-AS-REG-BALLOON     VALUE 'B'.
000797                 88  CO-REFD-GAP-NON-REFUND     VALUE 'G'.
000798
000799             20  CF-CO-OVRD-EARNINGS-CALC   PIC X.
000800                 88  CO-OVERRIDE-NOT-USED       VALUE SPACE.
000801                 88  CO-OVRD-BY-R78             VALUE '1'.
000802                 88  CO-OVRD-BY-PRO-RATA        VALUE '2'.
000803                 88  CO-OVRD-AS-CALIF           VALUE '3'.
000804                 88  CO-OVRD-AS-TEXAS           VALUE '4'.
000805                 88  CO-OVRD-IS-NET-PAY         VALUE '5'.
000806                 88  CO-OVRD-ANTICIPATION       VALUE '6'.
000807                 88  CO-OVRD-MEAN               VALUE '8'.
000808                 88  CO-OVRD-AS-REG-BALLOON     VALUE 'B'.
000809
000810             20  CF-CO-BEN-I-G-CD           PIC X.
000811                 88  CO-BEN-I-G-NOT-USED        VALUE SPACE.
000812                 88  CO-BEN-I-G-IS-INDV         VALUE 'I'.
000813                 88  CO-BEN-I-G-IS-GRP          VALUE 'G'.
000814
000815         16  FILLER                         PIC X(304).
000816
000817
000818****************************************************************
000819*             CARRIER MASTER RECORD                            *
000820****************************************************************
000821
000822     12  CF-CARRIER-MASTER-REC  REDEFINES  CF-RECORD-BODY.
000823         16  CF-ADDRESS-DATA.
000824             20  CF-MAIL-TO-NAME            PIC X(30).
000825             20  CF-IN-CARE-OF              PIC X(30).
000826             20  CF-ADDRESS-LINE-1          PIC X(30).
000827             20  CF-ADDRESS-LINE-2          PIC X(30).
000828             20  CF-CITY-STATE              PIC X(30).
000829             20  CF-ZIP-CODE-NUM            PIC 9(9)      COMP-3.
000830             20  CF-PHONE-NO                PIC 9(11)     COMP-3.
000831
000832         16  CF-CLAIM-NO-CONTROL.
000833             20  CF-CLAIM-NO-METHOD         PIC X.
000834                 88  CLAIM-NO-MANUAL            VALUE '1'.
000835                 88  CLAIM-NO-Y-M-SEQ           VALUE '2'.
000836                 88  CLAIM-NO-SEQ               VALUE '3'.
000837                 88  CLAIM-NO-ALPHA-SEQ         VALUE '5'.
000838             20  CF-CLAIM-COUNTER           PIC S9(8)   COMP.
000839                 88  CLAIM-CNT-RESET-IF-SEQ     VALUE +9999999.
000840                 88  CLAIM-CNT-RESET-IF-YRMO    VALUE +99999.
000841                 88  CLAIM-CNT-RESET-IF-YRALPHA VALUE +9999.
000842
000843         16  CF-CHECK-NO-CONTROL.
000844             20  CF-CHECK-NO-METHOD         PIC X.
000845                 88  CHECK-NO-MANUAL            VALUE '1'.
000846                 88  CHECK-NO-AUTO-SEQ          VALUE '2'.
000847                 88  CHECK-NO-CARR-SEQ          VALUE '3'.
000848                 88  CHECK-NO-AT-PRINT          VALUE '4'.
000849             20  CF-CHECK-COUNTER           PIC S9(8)   COMP.
000850                 88  CHECK-CNT-RESET-VALUE      VALUE +999999.
000851
000852         16  CF-DOMICILE-STATE              PIC XX.
000853
000854         16  CF-EXPENSE-CONTROLS.
000855             20  CF-EXPENSE-METHOD          PIC X.
000856                 88  EXPENSE-CALC-MANUAL        VALUE '1'.
000857                 88  DOLLARS-PER-PMT            VALUE '2'.
000858                 88  PERCENT-OF-PAYMENT         VALUE '3'.
000859                 88  DOLLARS-PER-MONTH          VALUE '4'.
000860             20  CF-EXPENSE-PERCENT         PIC S999V99   COMP-3.
000861             20  CF-EXPENSE-DOLLAR          PIC S999V99   COMP-3.
000862
000863         16  CF-CORRESPONDENCE-CONTROL.
000864             20  CF-LETTER-RESEND-OPT       PIC X.
000865                 88  LETTERS-NOT-ARCHIVED       VALUE SPACE.
000866                 88  LETTERS-ARE-ARCHIVED       VALUE '1'.
000867             20  FILLER                     PIC X(4).
000868
000869         16  CF-RESERVE-CONTROLS.
000870             20  CF-MANUAL-SW               PIC X.
000871                 88  CF-MANUAL-RESERVES-USED    VALUE '1'.
000872             20  CF-FUTURE-SW               PIC X.
000873                 88  CF-FUTURE-RESERVES-USED    VALUE '1'.
000874             20  CF-PTC-SW                  PIC X.
000875                 88  CF-PAY-TO-CURRENT-USED     VALUE '1'.
000876             20  CF-IBNR-SW                 PIC X.
000877                 88  CF-IBNR-RESERVES-USED      VALUE '1'.
000878             20  CF-PTC-LF-SW               PIC X.
000879                 88  CF-LF-PTC-USED             VALUE '1'.
000880             20  CF-CDT-ACCESS-METHOD       PIC X.
000881                 88  CF-CDT-ROUND-NEAR          VALUE '1'.
000882                 88  CF-CDT-ROUND-HIGH          VALUE '2'.
000883                 88  CF-CDT-INTERPOLATED        VALUE '3'.
000884             20  CF-PERCENT-OF-CDT          PIC S999V99   COMP-3.
000885
000886         16  CF-CLAIM-CALC-METHOD           PIC X.
000887             88  360-PLUS-MONTHS                VALUE '1'.
000888             88  365-PLUS-MONTHS                VALUE '2'.
000889             88  FULL-MONTHS-ACTUAL-DAY         VALUE '3'.
000890             88  360-DAILY                      VALUE '4'.
000891             88  365-DAILY                      VALUE '5'.
000892
000893         16  CF-LAST-ALPHA-CHARACTER        PIC X.
000894         16  FILLER                         PIC X(11).
000895
000896         16  CF-LIMIT-AMOUNTS.
000897             20  CF-CALC-AMT-TOL            PIC S999V99   COMP-3.
000898             20  CF-MAX-REG-PMT             PIC S9(7)V99  COMP-3.
000899             20  CF-MAX-REG-DAYS            PIC S999      COMP-3.
000900             20  CF-MAX-AUTO-PMT            PIC S9(7)V99  COMP-3.
000901             20  CF-MAX-AUTO-MOS            PIC S999      COMP-3.
000902             20  CF-CALC-DAYS-TOL           PIC S999      COMP-3.
000903             20  CF-CR-TOL-PREM             PIC S999V99   COMP-3.
000904             20  CF-CR-TOL-REFUND           PIC S999V99   COMP-3.
000905             20  CF-CR-TOL-PREM-PCT         PIC S9V9(4)   COMP-3.
000906             20  CF-CR-TOL-REFUND-PCT       PIC S9V9(4)   COMP-3.
000907
000908         16  CF-DAYS-BEFORE-CLOSED          PIC S999      COMP-3.
000909         16  CF-MONTHS-BEFORE-PURGED        PIC S999      COMP-3.
000910         16  CF-IBNR-PERCENT                PIC S9V9(4)   COMP-3.
000911
000912         16  CF-ZIP-CODE.
000913             20  CF-ZIP-PRIME.
000914                 24  CF-ZIP-1ST             PIC X.
000915                     88  CF-CANADIAN-POST-CODE VALUE 'A' THRU 'Z'.
000916                 24  FILLER                 PIC X(4).
000917             20  CF-ZIP-PLUS4               PIC X(4).
000918         16  CF-CANADIAN-POSTAL-CODE REDEFINES CF-ZIP-CODE.
000919             20  CF-CAN-POSTAL-1            PIC XXX.
000920             20  CF-CAN-POSTAL-2            PIC XXX.
000921             20  FILLER                     PIC XXX.
000922
000923         16  CF-IBNR-UEPRM-PERCENT          PIC S9V9(4) COMP-3.
000924         16  CF-IBNR-R78-PERCENT            PIC S9V9(4) COMP-3.
000925         16  CF-IBNR-PRO-PERCENT            PIC S9V9(4) COMP-3.
000926
000927         16  CF-RATING-SWITCH               PIC X.
000928             88  CF-PERFORM-RATING              VALUE ' ' 'Y'.
000929             88  CF-NO-RATING                   VALUE 'N'.
000930
000931         16  CF-BUILD-RETRIEVE-AFTER-MONTHS PIC 99.
000932
000933         16  CF-CARRIER-OVER-SHORT.
000934             20 CF-CR-OVR-SHT-AMT           PIC S999V99   COMP-3.
000935             20 CF-CR-OVR-SHT-PCT           PIC S9V9(4)   COMP-3.
000936
000937         16  CF-CARRIER-CLP-TOL-PCT         PIC S9V9(4)   COMP-3.
000938         16  CF-SECPAY-SWITCH               PIC X.
000939             88  CF-SECURE-PAY-CARRIER          VALUE 'Y'.
000940             88  CF-NO-SECURE-PAY               VALUE ' ' 'N'.
000941         16  CF-CARRIER-LEASE-COMM          PIC S9(5)V99  COMP-3.
000942         16  CF-CARRIER-NEXT-AUDIT-CHK-NO   PIC S9(8)     COMP.
000943         16  FILLER                         PIC X(444).
000944*        16  FILLER                         PIC X(452).
000945
000946
000947****************************************************************
000948*             MORTALITY MASTER RECORD                          *
000949****************************************************************
000950
000951     12  CF-MORTALITY-MASTER-REC REDEFINES  CF-RECORD-BODY.
000952         16  CF-MORT-TABLE-LINE OCCURS  9  TIMES
000953                                INDEXED BY CF-MORT-NDX.
000954             20  CF-MORT-TABLE              PIC X(5).
000955             20  CF-MORT-TABLE-TYPE         PIC X.
000956                 88  CF-MORT-JOINT              VALUE 'J'.
000957                 88  CF-MORT-SINGLE             VALUE 'S'.
000958                 88  CF-MORT-COMBINED           VALUE 'C'.
000959                 88  CF-MORT-TYPE-VALID-C       VALUE 'J' 'S'.
000960                 88  CF-MORT-TYPE-VALID-M       VALUE 'J' 'S' 'C'.
000961             20  CF-MORT-INTEREST           PIC SV9(4)  COMP-3.
000962             20  CF-MORT-AGE-METHOD         PIC XX.
000963                 88  CF-AGE-LAST                VALUE 'AL'.
000964                 88  CF-AGE-NEAR                VALUE 'AN'.
000965             20  CF-MORT-RESERVE-ADJUSTMENT PIC S9V9(4) COMP-3.
000966             20  CF-MORT-ADJUSTMENT-DIRECTION
000967                                            PIC X.
000968                 88  CF-MINUS                   VALUE '-'.
000969                 88  CF-PLUS                    VALUE '+'.
000970             20  CF-MORT-JOINT-FACTOR       PIC S9V9(4) COMP-3.
000971             20  CF-MORT-JOINT-CODE         PIC X.
000972                 88  CF-VALID-JOINT-CODE        VALUE 'A' 'V'.
000973             20  CF-MORT-PC-Q               PIC X.
000974                 88  CF-VALID-PC-Q              VALUE 'Y' 'N' ' '.
000975             20  CF-MORT-TABLE-CODE         PIC X(4).
000976             20  CF-MORT-COMMENTS           PIC X(15).
000977             20  FILLER                     PIC X(14).
000978
000979         16  FILLER                         PIC X(251).
000980
000981
000982****************************************************************
000983*             BUSSINESS TYPE MASTER RECORD                     *
000984****************************************************************
000985
000986     12  CF-BUSINESS-TYPE-MASTER-REC REDEFINES  CF-RECORD-BODY.
000987* FIRST ENTRY IS TYPE 01.. LAST IS TYPE 20
000988* RECORD 02 IS TYPES 21-40..RECORD 03 IS 41-60..04 IS 61-80
000989* AND RECORD 05 IS TYPES 81-99
000990         16  CF-TYPE-DESCRIPTIONS   OCCURS  20  TIMES.
000991             20  CF-BUSINESS-TITLE          PIC  X(19).
000992             20  CF-BUS-MOD-ST-TRGT-LOSS-RATIO
000993                                            PIC S9V9(4) COMP-3.
000994             20  CF-BUS-EXCL-ST-CALL        PIC  X.
000995             20  FILLER                     PIC  X.
000996         16  FILLER                         PIC  X(248).
000997
000998
000999****************************************************************
001000*             TERMINAL MASTER RECORD                           *
001001****************************************************************
001002
001003     12  CF-TERMINAL-MASTER-REC  REDEFINES  CF-RECORD-BODY.
001004
001005         16  CF-COMPANY-TERMINALS.
001006             20  CF-TERMINAL-ID  OCCURS 120 TIMES
001007                                  PIC X(4).
001008         16  FILLER               PIC X(248).
001009
001010
001011****************************************************************
001012*             LIFE EDIT MASTER RECORD                          *
001013****************************************************************
001014
001015     12  CF-LIFE-EDIT-MASTER-REC REDEFINES  CF-RECORD-BODY.
001016         16  CF-LIFE-EDIT-ENTRIES   OCCURS 120  TIMES.
001017             20  CF-LIFE-CODE-IN            PIC XX.
001018             20  CF-LIFE-CODE-OUT           PIC XX.
001019         16  FILLER                         PIC X(248).
001020
001021
001022****************************************************************
001023*             AH EDIT MASTER RECORD                            *
001024****************************************************************
001025
001026     12  CF-AH-EDIT-MASTER-REC REDEFINES  CF-RECORD-BODY.
001027         16  CF-AH-EDIT-ENTRIES   OCCURS  96  TIMES.
001028             20  CF-AH-CODE-IN              PIC XXX.
001029             20  CF-AH-CODE-OUT             PIC XX.
001030         16  FILLER                         PIC X(248).
001031
001032
001033****************************************************************
001034*             CREDIBILITY TABLES                               *
001035****************************************************************
001036
001037     12  CF-CREDIBILITY-MASTER-REC REDEFINES  CF-RECORD-BODY.
001038         16  CF-CRDB-ENTRY   OCCURS 36 TIMES
001039                             INDEXED BY CF-CRDB-NDX.
001040             20  CF-CRDB-FROM               PIC S9(7)   COMP-3.
001041             20  CF-CRDB-TO                 PIC S9(7)   COMP-3.
001042             20  CF-CREDIBILITY-FACTOR      PIC S9V9(4) COMP-3.
001043         16  FILLER                         PIC  X(332).
001044
001045
001046****************************************************************
001047*             REPORT CUSTOMIZATION RECORD                      *
001048****************************************************************
001049
001050     12  CF-CUSTOM-REPORT-REC  REDEFINES  CF-RECORD-BODY.
001051         16  CF-ACCOUNT-MASTER-STATUS       PIC X.
001052             88  CF-ACTIVE-ACCOUNTS             VALUE 'A'.
001053             88  CF-INACTIVE-ACCOUNTS           VALUE 'I'.
001054             88  CF-CANCELLED-ACCOUNTS          VALUE 'C'.
001055**** NOTE: INACTIVE WILL INCLUDE ACCOUNT MASTER CODED WITH ****
001056****       A T-TRANSFER.                                   ****
001057             88  CF-ALL-ACCOUNTS                VALUE 'B'.
001058
001059         16  FILLER                         PIC XX.
001060
001061         16  CF-CARRIER-CNTL-OPT.
001062             20  CF-CARRIER-OPT-SEQ         PIC 9.
001063                 88  CF-CARRIER-OPT-USED        VALUE 1 THRU 6.
001064                 88  CF-CARRIER-OPT-NOT-USED    VALUE 0.
001065             20  CF-CARRIER-SELECT OCCURS 3 TIMES
001066                                            PIC X.
001067         16  CF-GROUP-CNTL-OPT.
001068             20  CF-GROUP-OPT-SEQ           PIC 9.
001069                 88  CF-GROUP-OPT-USED          VALUE 1 THRU 6.
001070                 88  CF-GROUP-OPT-NOT-USED      VALUE 0.
001071             20  CF-GROUP-SELECT OCCURS 3 TIMES
001072                                            PIC X(6).
001073         16  CF-STATE-CNTL-OPT.
001074             20  CF-STATE-OPT-SEQ           PIC 9.
001075                 88  CF-STATE-OPT-USED          VALUE 1 THRU 6.
001076                 88  CF-STATE-OPT-NOT-USED      VALUE 0.
001077             20  CF-STATE-SELECT OCCURS 3 TIMES
001078                                            PIC XX.
001079         16  CF-ACCOUNT-CNTL-OPT.
001080             20  CF-ACCOUNT-OPT-SEQ         PIC 9.
001081                 88  CF-ACCOUNT-OPT-USED        VALUE 1 THRU 6.
001082                 88  CF-ACCOUNT-OPT-NOT-USED    VALUE 0.
001083             20  CF-ACCOUNT-SELECT OCCURS 3 TIMES
001084                                            PIC X(10).
001085         16  CF-BUS-TYP-CNTL-OPT.
001086             20  CF-BUS-TYP-OPT-SEQ         PIC 9.
001087                 88  CF-BUS-TYP-OPT-USED        VALUE 1 THRU 6.
001088                 88  CF-BUS-TYP-OPT-NOT-USED    VALUE 0.
001089             20  CF-BUS-TYP-SELECT OCCURS 3 TIMES
001090                                            PIC XX.
001091         16  CF-LF-TYP-CNTL-OPT.
001092             20  CF-LF-TYP-OPT-SEQ          PIC 9.
001093                 88  CF-LF-TYP-OPT-USED         VALUE 1 THRU 6.
001094                 88  CF-LF-TYP-OPT-NOT-USED     VALUE 0.
001095             20  CF-BUS-LF-SELECT OCCURS 3 TIMES
001096                                            PIC XX.
001097         16  CF-AH-TYP-CNTL-OPT.
001098             20  CF-AH-TYP-OPT-SEQ          PIC 9.
001099                 88  CF-AH-TYP-OPT-USED         VALUE 1 THRU 6.
001100                 88  CF-AH-TYP-OPT-NOT-USED     VALUE 0.
001101             20  CF-BUS-AH-SELECT OCCURS 3 TIMES
001102                                            PIC XX.
001103         16  CF-REPTCD1-CNTL-OPT.
001104             20  CF-REPTCD1-OPT-SEQ         PIC 9.
001105                 88  CF-REPTCD1-OPT-USED        VALUE 1 THRU 6.
001106                 88  CF-REPTCD1-OPT-NOT-USED    VALUE 0.
001107             20  CF-REPTCD1-SELECT OCCURS 3 TIMES
001108                                            PIC X(10).
001109         16  CF-REPTCD2-CNTL-OPT.
001110             20  CF-REPTCD2-OPT-SEQ         PIC 9.
001111                 88  CF-REPTCD2-OPT-USED        VALUE 1 THRU 6.
001112                 88  CF-REPTCD2-OPT-NOT-USED    VALUE 0.
001113             20  CF-REPTCD2-SELECT OCCURS 3 TIMES
001114                                            PIC X(10).
001115         16  CF-USER1-CNTL-OPT.
001116             20  CF-USER1-OPT-SEQ           PIC 9.
001117                 88  CF-USER1-OPT-USED          VALUE 1 THRU 6.
001118                 88  CF-USER1-OPT-NOT-USED      VALUE 0.
001119             20  CF-USER1-SELECT OCCURS 3 TIMES
001120                                            PIC X(10).
001121         16  CF-USER2-CNTL-OPT.
001122             20  CF-USER2-OPT-SEQ           PIC 9.
001123                 88  CF-USER2-OPT-USED          VALUE 1 THRU 6.
001124                 88  CF-USER2-OPT-NOT-USED      VALUE 0.
001125             20  CF-USER2-SELECT OCCURS 3 TIMES
001126                                            PIC X(10).
001127         16  CF-USER3-CNTL-OPT.
001128             20  CF-USER3-OPT-SEQ           PIC 9.
001129                 88  CF-USER3-OPT-USED          VALUE 1 THRU 6.
001130                 88  CF-USER3-OPT-NOT-USED      VALUE 0.
001131             20  CF-USER3-SELECT OCCURS 3 TIMES
001132                                            PIC X(10).
001133         16  CF-USER4-CNTL-OPT.
001134             20  CF-USER4-OPT-SEQ           PIC 9.
001135                 88  CF-USER4-OPT-USED          VALUE 1 THRU 6.
001136                 88  CF-USER4-OPT-NOT-USED      VALUE 0.
001137             20  CF-USER4-SELECT OCCURS 3 TIMES
001138                                            PIC X(10).
001139         16  CF-USER5-CNTL-OPT.
001140             20  CF-USER5-OPT-SEQ           PIC 9.
001141                 88  CF-USER5-OPT-USED          VALUE 1 THRU 6.
001142                 88  CF-USER5-OPT-NOT-USED      VALUE 0.
001143             20  CF-USER5-SELECT OCCURS 3 TIMES
001144                                            PIC X(10).
001145         16  CF-REINS-CNTL-OPT.
001146             20  CF-REINS-OPT-SEQ           PIC 9.
001147                 88  CF-REINS-OPT-USED          VALUE 1 THRU 6.
001148                 88  CF-REINS-OPT-NOT-USED      VALUE 0.
001149             20  CF-REINS-SELECT OCCURS 3 TIMES.
001150                 24  CF-REINS-PRIME         PIC XXX.
001151                 24  CF-REINS-SUB           PIC XXX.
001152
001153         16  CF-AGENT-CNTL-OPT.
001154             20  CF-AGENT-OPT-SEQ           PIC 9.
001155                 88  CF-AGENT-OPT-USED          VALUE 1 THRU 6.
001156                 88  CF-AGENT-OPT-NOT-USED      VALUE 0.
001157             20  CF-AGENT-SELECT OCCURS 3 TIMES
001158                                            PIC X(10).
001159
001160         16  FILLER                         PIC X(43).
001161
001162         16  CF-LOSS-RATIO-SELECT.
001163             20  CF-SEL-LO-LOSS-RATIO       PIC S999V99  COMP-3.
001164             20  CF-SEL-HI-LOSS-RATIO       PIC S999V99  COMP-3.
001165         16  CF-ENTRY-DATE-SELECT.
001166             20  CF-SEL-LO-ENTRY-DATE       PIC XX.
001167             20  CF-SEL-HI-ENTRY-DATE       PIC XX.
001168         16  CF-EFFECTIVE-DATE-SELECT.
001169             20  CF-SEL-LO-EFFECTIVE-DATE   PIC XX.
001170             20  CF-SEL-HI-EFFECTIVE-DATE   PIC XX.
001171
001172         16  CF-EXCEPTION-LIST-IND          PIC X.
001173             88  CF-EXCEPTION-LIST-REQUESTED VALUE 'Y'.
001174
001175         16  FILLER                         PIC X(318).
001176
001177****************************************************************
001178*                  EXCEPTION REPORTING RECORD                  *
001179****************************************************************
001180
001181     12  CF-EXCEPTION-REPORT-REC REDEFINES   CF-RECORD-BODY.
001182         16  CF-ACCOUNTS-LT-ONE-YEAR        PIC X.
001183             88  CF-EXCEPTION-ACCTS-WITHIN-ONE  VALUE 'Y'.
001184
001185         16  CF-COMBINED-LIFE-AH-OPT.
001186             20  CF-ISS-COUNT-DIFF          PIC S9(05)     COMP-3.
001187             20  CF-SINGLE-MO-PREM-PCT      PIC S9(02).
001188             20  CF-EARN-PREM-DECR-PCT      PIC S9(02).
001189             20  CF-CANCELLATION-RATIO      PIC S9(02).
001190
001191         16  CF-LIFE-OPT.
001192             20  CF-LF-LOSS-RATIO-PCT       PIC S9(03)     COMP-3.
001193             20  CF-LF-LTM-LOSS-RATIO       PIC S9(03)     COMP-3.
001194             20  CF-LF-PERIOD-PROFIT        PIC S9(03)     COMP-3.
001195             20  CF-LF-LTM-PROFIT-PCT       PIC S9(02)V9   COMP-3.
001196             20  CF-LF-LTM-INFORCE-DECR     PIC S9(02)V9   COMP-3.
001197             20  CF-LF-LTM-TERM-CHG         PIC S9(02)V9   COMP-3.
001198             20  CF-LF-TERM-AVG-WEIGHTED    PIC S9(02)V9   COMP-3.
001199             20  CF-LF-LTM-AGE-PCT          PIC S9(02)V9   COMP-3.
001200             20  CF-LF-AGE-AVG-WEIGHTED     PIC S9(02)V9   COMP-3.
001201             20  CF-LF-AVG-AGE-MAX          PIC S9(02).
001202
001203         16  CF-AH-OPT.
001204             20  CF-AH-LOSS-RATIO-PCT       PIC S9(03)     COMP-3.
001205             20  CF-AH-LTM-LOSS-RATIO       PIC S9(03)     COMP-3.
001206             20  CF-AH-PERIOD-PROFIT        PIC S9(03)     COMP-3.
001207             20  CF-AH-LTM-PROFIT-PCT       PIC S9(02)V9   COMP-3.
001208             20  CF-AH-LTM-INFORCE-DECR     PIC S9(02)V9   COMP-3.
001209             20  CF-AH-LTM-TERM-CHG         PIC S9(02)V9   COMP-3.
001210             20  CF-AH-TERM-AVG-WEIGHTED    PIC S9(02)V9   COMP-3.
001211             20  CF-AH-LTM-AGE-PCT          PIC S9(02)V9   COMP-3.
001212             20  CF-AH-AGE-AVG-WEIGHTED     PIC S9(02)V9   COMP-3.
001213             20  CF-AH-AVG-AGE-MAX          PIC S9(02).
001214
001215         16  CF-ACCT-ZERO-MONTH-PRODUCTION PIC X.
001216             88  CF-ACCT-CURRENT-MONTH-ACT      VALUE 'A'.
001217             88  CF-ACCT-WITH-NO-PRODUCTION     VALUE 'B'.
001218             88  CF-ACCT-WITH-ISSUE-ACTIVITY    VALUE 'C'.
001219
001220         16  CF-RETENTION-LIMIT             PIC S9(7)      COMP-3.
001221
001222         16  FILLER                         PIC X(673).
001223
001224
001225****************************************************************
001226*             MORTGAGE SYSTEM PLAN RECORD                      *
001227****************************************************************
001228
001229     12  CF-MORTGAGE-PLAN-MASTER  REDEFINES  CF-RECORD-BODY.
001230         16  CF-PLAN-TYPE                   PIC X.
001231             88  CF-LIFE-MORT-PLAN             VALUE 'L'.
001232             88  CF-DISAB-MORT-PLAN            VALUE 'D'.
001233             88  CF-AD-D-MORT-PLAN             VALUE 'A'.
001234         16  CF-PLAN-ABBREV                 PIC XXX.
001235         16  CF-PLAN-DESCRIPT               PIC X(10).
001236         16  CF-PLAN-NOTES                  PIC X(20).
001237         16  CF-PLAN-ESTABLISH-DATE         PIC XX.
001238         16  CF-PLAN-UNDERWRITING.
001239             20  CF-PLAN-TERM-DATA.
001240                 24  CF-MINIMUM-TERM        PIC S999      COMP-3.
001241                 24  CF-MAXIMUM-TERM        PIC S999      COMP-3.
001242             20  CF-PLAN-AGE-DATA.
001243                 24  CF-MINIMUM-AGE         PIC S999      COMP-3.
001244                 24  CF-MAXIMUM-AGE         PIC S999      COMP-3.
001245                 24  CF-MAXIMUM-ATTAIN-AGE  PIC S999      COMP-3.
001246             20  CF-PLAN-BENEFIT-DATA.
001247                 24  CF-MINIMUM-BENEFIT     PIC S9(7)V99  COMP-3.
001248                 24  CF-MAXIMUM-BENEFIT     PIC S9(7)V99  COMP-3.
001249                 24  CF-MAXIMUM-MONTHLY-BENEFIT
001250                                            PIC S9(7)V99  COMP-3.
001251         16  CF-PLAN-POLICY-FORMS.
001252             20  CF-POLICY-FORM             PIC X(12).
001253             20  CF-MASTER-APPLICATION      PIC X(12).
001254             20  CF-MASTER-POLICY           PIC X(12).
001255         16  CF-PLAN-RATING.
001256             20  CF-RATE-CODE               PIC X(5).
001257             20  CF-SEX-RATING              PIC X.
001258                 88  CF-PLAN-NOT-SEX-RATED     VALUE '1'.
001259                 88  CF-PLAN-SEX-RATED         VALUE '2'.
001260             20  CF-SUB-STD-PCT             PIC S9V9999   COMP-3.
001261             20  CF-SUB-STD-TYPE            PIC X.
001262                 88  CF-PCT-OF-PREM            VALUE '1'.
001263                 88  CF-PCT-OF-BENE            VALUE '2'.
001264         16  CF-PLAN-PREM-TOLERANCES.
001265             20  CF-PREM-TOLERANCE          PIC S999      COMP-3.
001266             20  CF-PREM-TOLERANCE-PCT      PIC SV999     COMP-3.
001267         16  CF-PLAN-PYMT-TOLERANCES.
001268             20  CF-PYMT-TOLERANCE          PIC S999      COMP-3.
001269             20  CF-PYMT-TOLERANCE-PCT      PIC SV999     COMP-3.
001270         16  CF-PLAN-MISC-DATA.
001271             20  FILLER                     PIC X.
001272             20  CF-FREE-EXAM-DAYS          PIC S999      COMP-3.
001273             20  CF-RETRO-RETENTION         PIC S9V9999   COMP-3.
001274         16  CF-MORT-PLAN-USE-CTR           PIC S999      COMP-3.
001275         16  CF-PLAN-IND-GRP                PIC X.
001276             88  CF-MORT-INDIV-PLAN            VALUE 'I'
001277                                                     '1'.
001278             88  CF-MORT-GROUP-PLAN            VALUE 'G'
001279                                                     '2'.
001280         16  CF-MIB-SEARCH-SW               PIC X.
001281             88  CF-MIB-SEARCH-ALL             VALUE '1'.
001282             88  CF-MIB-SEARCH-NONE            VALUE '2'.
001283             88  CF-MIB-SEARCH-EXCEEDED        VALUE '3'.
001284             88  CF-MIB-SEARCH-VALID      VALUES ARE '1' '2' '3'.
001285         16  CF-ALPHA-SEARCH-SW             PIC X.
001286             88  CF-MIB-ALPHA-ALL              VALUE '1'.
001287             88  CF-MIB-ALPHA-NONE             VALUE '2'.
001288             88  CF-MIB-APLHA-EXCEEDED         VALUE '3'.
001289             88  CF-CLIENT-ALPHA-ALL           VALUE 'A'.
001290             88  CF-CLIENT-ALPHA-NONE          VALUE 'B'.
001291             88  CF-CLIENT-APLHA-EXCEEDED      VALUE 'C'.
001292             88  CF-BOTH-ALPHA-ALL             VALUE 'X'.
001293             88  CF-BOTH-ALPHA-NONE            VALUE 'Y'.
001294             88  CF-BOTH-APLHA-EXCEEDED        VALUE 'Z'.
001295             88  CF-ALPHA-SEARCH-VALID    VALUES ARE '1' '2' '3'
001296                                                     'A' 'B' 'C'
001297                                                     'X' 'Y' 'Z'.
001298         16  CF-EFF-DT-RULE-SW              PIC X.
001299             88  CF-EFF-DT-ENTER               VALUE 'E'.
001300             88  CF-EFF-DT-MONTH               VALUE 'M'.
001301             88  CF-EFF-DT-QTR                 VALUE 'Q'.
001302             88  CF-EFF-DT-SEMI                VALUE 'S'.
001303             88  CF-EFF-DT-ANN                 VALUE 'A'.
001304         16  FILLER                         PIC X(4).
001305         16  CF-HEALTH-QUESTIONS            PIC X.
001306             88  CF-VALID-QUESTIONS-CNT VALUES ARE '0' THRU '9'.
001307         16  CF-GRACE-PERIOD                PIC S999      COMP-3.
001308         16  CF-NUMBER-LAPSE-NOTICES        PIC S999      COMP-3.
001309         16  CF-PLAN-SNGL-JNT               PIC X.
001310             88  CF-COMBINED-PLAN              VALUE 'C'.
001311             88  CF-JNT-PLAN                   VALUE 'J'.
001312             88  CF-SNGL-PLAN                  VALUE 'S'.
001313         16  CF-DAYS-TO-1ST-NOTICE          PIC  99.
001314         16  CF-DAYS-TO-2ND-NOTICE          PIC  99.
001315         16  CF-DAYS-TO-3RD-NOTICE          PIC  99.
001316         16  CF-DAYS-TO-4TH-NOTICE          PIC  99.
001317         16  CF-RERATE-CNTL                 PIC  X.
001318             88  CF-RERATE-WITH-ISSUE-AGE       VALUE '1'.
001319             88  CF-RERATE-WITH-CURRENT-AGE     VALUE '2'.
001320             88  CF-DO-NOT-RERATE               VALUE '3' ' '.
001321             88  CF-AUTO-RECALC                 VALUE '4'.
001322         16  CF-BENEFIT-TYPE                PIC  X.
001323             88  CF-BENEFIT-IS-LEVEL            VALUE '1'.
001324             88  CF-BENEFIT-REDUCES             VALUE '2'.
001325         16  CF-POLICY-FEE                  PIC S999V99
001326                                                    COMP-3.
001327         16  CF-1ST-NOTICE-FORM             PIC  X(04).
001328         16  CF-2ND-NOTICE-FORM             PIC  X(04).
001329         16  CF-3RD-NOTICE-FORM             PIC  X(04).
001330         16  CF-4TH-NOTICE-FORM             PIC  X(04).
001331         16  FILLER                         PIC  X(32).
001332         16  CF-TERMINATION-FORM            PIC  X(04).
001333         16  FILLER                         PIC  X(08).
001334         16  CF-CLAIM-CAP                   PIC S9(7)V99
001335                                                       COMP-3.
001336         16  CF-REOCCURRING-DISABILITY-PRD  PIC S999   COMP-3.
001337         16  CF-ISSUE-LETTER                PIC  X(4).
001338         16  CF-YEARS-TO-NEXT-RERATE        PIC  99.
001339         16  CF-DEPENDENT-COVERAGE          PIC  X.
001340             88  CF-YES-DEP-COV                 VALUE 'Y'.
001341             88  CF-NO-DEP-COV             VALUES ARE 'N' ' '.
001342         16  CF-MP-REFUND-CALC              PIC X.
001343             88  CF-MP-REFUND-NOT-USED          VALUE SPACE.
001344             88  CF-MP-REFD-BY-R78              VALUE '1'.
001345             88  CF-MP-REFD-BY-PRO-RATA         VALUE '2'.
001346             88  CF-MP-REFD-AS-CALIF            VALUE '3'.
001347             88  CF-MP-REFD-AS-TEXAS            VALUE '4'.
001348             88  CF-MP-REFD-IS-NET-PAY          VALUE '5'.
001349             88  CF-MP-REFD-ANTICIPATION        VALUE '6'.
001350             88  CF-MP-REFD-MEAN                VALUE '8'.
001351         16  CF-ALT-RATE-CODE               PIC  X(5).
001352
001353
001354         16  FILLER                         PIC X(498).
001355****************************************************************
001356*             MORTGAGE COMPANY MASTER RECORD                   *
001357****************************************************************
001358
001359     12  CF-MORTG-COMPANY-MASTER-REC  REDEFINES  CF-RECORD-BODY.
001360         16  CF-MORTG-ALT-MORT-CODE         PIC X(4).
001361         16  CF-MORTG-ACCESS-CONTROL        PIC X.
001362             88  CF-MORT-ST-PROD-CNTL                VALUE ' '.
001363             88  CF-MORT-CARR-GRP-ST-PROD-CNTL       VALUE '1'.
001364             88  CF-MORT-CARR-ST-PROD-CNTL           VALUE '2'.
001365             88  CF-MORT-PROD-CNTL                   VALUE '3'.
001366             88  CF-MORT-CARR-PROD-CNTL              VALUE '4'.
001367
001368         16  CF-MORTG-CONVERSION-DATE       PIC XX.
001369         16  CF-MORTG-RATE-FILE-MAINT-DATE  PIC XX.
001370         16  CF-MORTG-RATE-FILE-CREAT-DATE  PIC XX.
001371         16  CF-MORTG-PROD-FILE-MAINT-DATE  PIC XX.
001372         16  CF-MORTG-PROD-FILE-CREAT-DATE  PIC XX.
001373
001374         16  CF-MP-POLICY-LINKAGE-IND       PIC X(1).
001375             88  CF-MP-PLCY-LINKAGE-USED     VALUE 'Y'.
001376         16  CF-MP-RECON-USE-IND            PIC X(1).
001377             88  CF-MP-USE-RECON             VALUE 'Y'.
001378         16  CF-MORTG-CHECK-NO-COUNTER      PIC 9(6).
001379             88  CF-MP-CHECK-CNT-RESET-VALUE VALUE 999999.
001380         16  CF-MP-REPORT-LANGUAGE-IND      PIC X(1).
001381             88  CF-MP-LANGUAGE-IS-ENG       VALUE 'E'.
001382             88  CF-MP-LANGUAGE-IS-FR        VALUE 'F'.
001383         16  FILLER                         PIC X(1).
001384         16  CF-MORTG-CHECK-QUEUE-COUNTER   PIC 9(6).
001385             88  CF-MP-CHKQ-CNT-RESET-VALUE  VALUE 999999.
001386         16  CF-MORTG-MIB-VERSION           PIC X.
001387             88  CF-MORTG-MIB-BATCH         VALUE '1'.
001388             88  CF-MORTG-MIB-ONLINE        VALUE '2'.
001389             88  CF-MORTG-MIB-BOTH          VALUE '3'.
001390         16  CF-MORTG-ALT-MIB-SEARCH-CNTL.
001391             20  CF-MORTG-MIB-LNAME-SEARCH  PIC X.
001392                 88  CF-MIB-LAST-NAME-SEARCH     VALUE 'Y'.
001393             20  CF-MORTG-MIB-FNAME-SEARCH  PIC X.
001394                 88  CF-MIB-FIRST-NAME-SEARCH    VALUE 'Y'.
001395             20  CF-MORTG-MIB-MNAME-SEARCH  PIC X.
001396                 88  CF-MIB-MIDDLE-NAME-SEARCH   VALUE 'Y'.
001397             20  CF-MORTG-MIB-BDATE-SEARCH  PIC X.
001398                 88  CF-MIB-BIRTH-DATE-SEARCH    VALUE 'Y'.
001399             20  CF-MORTG-MIB-BSTATE-SEARCH PIC X.
001400                 88  CF-MIB-BIRTH-STATE-SEARCH   VALUE 'Y'.
001401             20  CF-MORTG-MIB-RSTATE-SEARCH PIC X.
001402                 88  CF-MIB-RESIDNT-STATE-SEARCH VALUE 'Y'.
001403         16  CF-MORTG-MIB-COMPANY-SYMBOL    PIC XXX.
001404         16  FILLER                         PIC X(7).
001405         16  CF-MORTG-DESTINATION-SYMBOL.
001406             20  CF-MORTG-MIB-COMM          PIC X(5).
001407             20  CF-MORTG-MIB-TERM          PIC X(5).
001408         16  CF-ASSIGN-POLICY-NO-SW         PIC X(01).
001409             88  CF-ASSIGN-POLICY-NO             VALUE 'Y'.
001410         16  FILLER                         PIC X(03).
001411         16  CF-MP-CHECK-NO-CONTROL.
001412             20  CF-MP-CHECK-NO-METHOD      PIC X(01).
001413                 88  CF-MP-CHECK-NO-MANUAL     VALUE '1'.
001414                 88  CF-MP-CHECK-NO-AUTO-SEQ   VALUE '2'
001415                                                ' ' LOW-VALUES.
001416                 88  CF-MP-CHECK-NO-PRE-PRINTED
001417                                               VALUE '3'.
001418         16  CF-MORTG-LOAN-SHIFT-IND        PIC X(01).
001419         16  CF-MORTG-SOLICITATION-NUM      PIC S9(17) COMP-3.
001420         16  CF-MORTG-ALT-ALPHA-SEARCH-CNTL.
001421             20  CF-MORTG-ALP-LNAME-SEARCH  PIC X.
001422                 88  CF-ALPHA-LAST-NAME-SEARCH      VALUE 'Y'.
001423             20  CF-MORTG-ALP-FNAME-SEARCH  PIC X.
001424                 88  CF-ALPHA-FIRST-NAME-SEARCH     VALUE 'Y'.
001425             20  CF-MORTG-ALP-MNAME-SEARCH  PIC X.
001426                 88  CF-ALPHA-MIDDLE-NAME-SEARCH    VALUE 'Y'.
001427             20  CF-MORTG-ALP-BDATE-SEARCH  PIC X.
001428                 88  CF-ALPHA-BIRTH-DATE-SEARCH     VALUE 'Y'.
001429             20  CF-MORTG-ALP-BSTATE-SEARCH PIC X.
001430                 88  CF-ALPHA-BIRTH-STATE-SEARCH    VALUE 'Y'.
001431             20  CF-MORTG-ALP-RSTATE-SEARCH PIC X.
001432                 88  CF-ALPHA-RESIDNT-STATE-SEARCH  VALUE 'Y'.
001433         16  CF-MORTG-BILLING-AREA.
001434             20  CF-MORTG-BILL-CYCLE   OCCURS  5  TIMES
001435                                            PIC X.
001436         16  CF-MORTG-MONTH-END-DT          PIC XX.
001437         16  CF-MORTG-CURRENT-ARCH-NUM      PIC S9(8)  COMP.
001438         16  CF-MORTG-START-ARCH-NUM        PIC S9(8)  COMP.
001439         16  CF-MORTG-MIB-DEST-SW           PIC X.
001440             88 CF-MORTG-MIB-COMM-DEST              VALUE '1'.
001441             88 CF-MORTG-MIB-TERM-DEST              VALUE '2'.
001442         16  FILLER                         PIC X.
001443         16  CF-MORTG-LABEL-CONTROL         PIC X.
001444             88 CF-MORTG-CREATE-LABELS              VALUE 'Y'.
001445             88 CF-MORTG-BYPASS-LABELS              VALUE 'N'.
001446         16  CF-ACH-ORIGINATING-DFI-ID      PIC X(8).
001447         16  FILLER                         PIC X(8).
001448         16  CF-ACH-SENDING-DFI-NAME        PIC X(23).
001449         16  CF-ACH-RECVING-DFI-ROUTING-NO  PIC X(8).
001450         16  CF-ACH-RECVING-DFI-NAME        PIC X(23).
001451         16  CF-ACH-COMPANY-ID.
001452             20  CF-ACH-ID-CODE-DESIGNATOR  PIC X.
001453                 88  CF-ACH-ICD-IRS-EIN             VALUE '1'.
001454                 88  CF-ACH-ICD-DUNS                VALUE '3'.
001455                 88  CF-ACH-ICD-USER-ASSIGNED-NO    VALUE '9'.
001456             20  CF-ACH-COMPANY-ID-NO       PIC X(9).
001457         16  CF-MORTG-BILL-GROUPING-CODE    PIC X.
001458             88  CF-MORTG-CO-HAS-GROUPING           VALUE 'Y'.
001459         16  CF-RATE-DEV-AUTHORIZATION      PIC X.
001460             88  CF-RATE-DEV-AUTHORIZED             VALUE 'Y'.
001461             88  CF-RATE-DEV-NOT-AUTHORIZED         VALUE 'N'.
001462         16  CF-ACH-SENDING-DFI-ROUTING-NO  PIC X(9).
001463         16  CF-CBA-FILE-CREATE-NUM         PIC 9(4).
001464         16  FILLER                         PIC X(536).
001465
001466****************************************************************
001467*             MORTGAGE HEIGHT - WEIGHT CHARTS                  *
001468****************************************************************
001469
001470     12  CF-FEMALE-HT-WT-REC  REDEFINES CF-RECORD-BODY.
001471         16  CF-FEMALE-HT-WT-INFO OCCURS 30 TIMES.
001472             20  CF-FEMALE-HEIGHT.
001473                 24  CF-FEMALE-FT           PIC 99.
001474                 24  CF-FEMALE-IN           PIC 99.
001475             20  CF-FEMALE-MIN-WT           PIC 999.
001476             20  CF-FEMALE-MAX-WT           PIC 999.
001477         16  FILLER                         PIC X(428).
001478
001479     12  CF-MALE-HT-WT-REC    REDEFINES CF-RECORD-BODY.
001480         16  CF-MALE-HT-WT-INFO   OCCURS 30 TIMES.
001481             20  CF-MALE-HEIGHT.
001482                 24  CF-MALE-FT             PIC 99.
001483                 24  CF-MALE-IN             PIC 99.
001484             20  CF-MALE-MIN-WT             PIC 999.
001485             20  CF-MALE-MAX-WT             PIC 999.
001486         16  FILLER                         PIC X(428).
001487******************************************************************
001488*             AUTOMATIC ACTIVITY RECORD                          *
001489******************************************************************
001490     12  CF-AUTO-ACTIVITY-REC REDEFINES CF-RECORD-BODY.
001491         16  CF-SYSTEM-DEFINED-ACTIVITY OCCURS 09 TIMES.
001492             20  CF-SYS-ACTIVE-SW           PIC X(01).
001493             20  CF-SYS-LETTER-ID           PIC X(04).
001494             20  CF-SYS-RESEND-DAYS         PIC 9(03).
001495             20  CF-SYS-FOLLOW-UP-DAYS      PIC 9(03).
001496             20  CF-SYS-RESET-SW            PIC X(01).
001497             20  CF-SYS-REPORT-DAYS         PIC 9(03).
001498             20  CF-SYS-EACH-DAY-AFTER-SW   PIC X(01).
001499
001500         16  FILLER                         PIC X(50).
001501
001502         16  CF-USER-DEFINED-ACTIVITY  OCCURS 08 TIMES.
001503             20  CF-USER-ACTIVE-SW          PIC X(01).
001504             20  CF-USER-LETTER-ID          PIC X(04).
001505             20  CF-USER-RESEND-DAYS        PIC 9(03).
001506             20  CF-USER-FOLLOW-UP-DAYS     PIC 9(03).
001507             20  CF-USER-RESET-SW           PIC X(01).
001508             20  CF-USER-REPORT-DAYS        PIC 9(03).
001509             20  CF-USER-EACH-DAY-AFTER-SW  PIC X(01).
001510             20  CF-USER-ACTIVITY-DESC      PIC X(20).
001511
001512         16  FILLER                         PIC X(246).
      *<<((file: ELCCNTL))
001020*                                COPY ELCMSTR.
      *>>((file: ELCMSTR))
000001******************************************************************
000002*                                                                *
000003*                            ELCMSTR.                            *
000004*           COPYBOOK REVIEWED FOR YEAR 2000 COMPLIANCE
000005*                            VMOD=2.012                          *
000006*                                                                *
000007*   FILE DESCRIPTION = CLAIM MASTER FILE                         *
000008*                                                                *
000009*   FILE TYPE = VSAM,KSDS                                        *
000010*   RECORD SIZE = 350  RECFORM = FIXED                           *
000011*                                                                *
000012*   BASE CLUSTER = ELMSTR                         RKP=2,LEN=20   *
000013*       ALTERNATE PATH1 = ELMSTR2 (BY NAME)       RKP=22,LEN=29  *
000014*       ALTERNATE PATH2 = ELMSTR3 (BY SOC SEC NO) RKP=51,LEN=12  *
000015*       ALTERNATE PATH3 = ELMSTR5 (BY CERT NO)    RKP=63,LEN=12  *
000016*       ALTERNATE PATH4 = ELMSTR6 (BY CREDIT CARD NO)            *
000017*                                                 RKP=75,LEN=21  *
000018*                                                                *
000019*   **** NOTE ****                                               *
000020*             ANY CHANGES TO THIS COPYBOOK MUST ALSO BE          *
000021*             IMPLEMENTED IN COPYBOOK ELCRETR (RETRIEVE MASTER)  *
000022*                                                                *
000023*   LOG = YES                                                    *
000024*   SERVREQ = BROWSE, DELETE, UPDATE, NEWREC                     *
000025******************************************************************
000026*                   C H A N G E   L O G
000027*
000028* CHANGES ARE MARKED BY THE CHANGE EFFECTIVE DATE.
000029*-----------------------------------------------------------------
000030*  CHANGE   CHANGE REQUEST PGMR  DESCRIPTION OF CHANGE
000031* EFFECTIVE    NUMBER
000032*-----------------------------------------------------------------
000033* 120503    2003080800002  SMVA  INITIAL SECURE PAY CHANGES
000034* 080307    2007032100001  PEMA  ADD TOTAL INTEREST PAID FIELD
000035* 031213    2012113000002  PEMA  ADD ACCIDENT INDICATOR
000036* 051414  CR2013021100002  PEMA  RECURRENT CLAIM CHANGES
000037* 052614    2014022100001  AJRA  ADD FAMILY LEAVE CLAIM TYPE
000038* 081817    2016100700001  TANA  ADD NBR OF EXTENSIONS
000039* 100518  CR2017061500001  TANA  ADD OTHER CLAIM TYPE
000040******************************************************************
000041 01  CLAIM-MASTER.
000042     12  CL-RECORD-ID                PIC XX.
000043         88  VALID-CL-ID         VALUE 'CL'.
000044
000045     12  CL-CONTROL-PRIMARY.
000046         16  CL-COMPANY-CD           PIC X.
000047         16  CL-CARRIER              PIC X.
000048         16  CL-CLAIM-NO             PIC X(7).
000049         16  CL-CERT-NO.
000050             20  CL-CERT-PRIME       PIC X(10).
000051             20  CL-CERT-SFX         PIC X.
000052
000053     12  CL-CONTROL-BY-NAME.
000054         16  CL-COMPANY-CD-A1        PIC X.
000055         16  CL-INSURED-LAST-NAME    PIC X(15).
000056         16  CL-INSURED-NAME.
000057             20  CL-INSURED-1ST-NAME PIC X(12).
000058             20  CL-INSURED-MID-INIT PIC X.
000059
000060     12  CL-CONTROL-BY-SSN.
000061         16  CL-COMPANY-CD-A2        PIC X.
000062         16  CL-SOC-SEC-NO.
000063             20  CL-SSN-STATE        PIC XX.
000064             20  CL-SSN-ACCOUNT      PIC X(6).
000065             20  CL-SSN-LN3          PIC X(3).
000066
000067     12  CL-CONTROL-BY-CERT-NO.
000068         16  CL-COMPANY-CD-A4        PIC X.
000069         16  CL-CERT-NO-A4.
000070             20  CL-CERT-A4-PRIME    PIC X(10).
000071             20  CL-CERT-A4-SFX      PIC X.
000072
000073     12  CL-CONTROL-BY-CCN.
000074         16  CL-COMPANY-CD-A5        PIC X.
000075         16  CL-CCN-A5.
000076             20  CL-CCN.
000077                 24  CL-CCN-PREFIX-A5 PIC X(4).
000078                 24  CL-CCN-PRIME-A5 PIC X(12).
000079             20  CL-CCN-FILLER-A5    PIC X(4).
000080
000081     12  CL-INSURED-PROFILE-DATA.
000082         16  CL-INSURED-BIRTH-DT     PIC XX.
000083         16  CL-INSURED-SEX-CD       PIC X.
000084             88  INSURED-IS-MALE        VALUE 'M'.
000085             88  INSURED-IS-FEMALE      VALUE 'F'.
000086             88  INSURED-SEX-UNKNOWN    VALUE ' '.
000087         16  CL-INSURED-OCC-CD       PIC X(6).
000088         16  FILLER                  PIC X(5).
000089
000090     12  CL-PROCESSING-INFO.
000091         16  CL-PROCESSOR-ID         PIC X(4).
000092         16  CL-CLAIM-STATUS         PIC X.
000093             88  CLAIM-IS-OPEN          VALUE 'O'.
000094             88  CLAIM-IS-CLOSED        VALUE 'C'.
000095         16  CL-CLAIM-TYPE           PIC X.
000096*            88  AH-CLAIM               VALUE 'A'.
000097*            88  LIFE-CLAIM             VALUE 'L'.
000098*            88  PROPERTY-CLAIM         VALUE 'P'.
000099*            88  IUI-CLAIM              VALUE 'I'.
000100*            88  GAP-CLAIM              VALUE 'G'.
000101*            88  FAMILY-LEAVE-CLAIM     VALUE 'F'.
000102*            88  OTHER-CLAIM            VALUE 'O'.
000103         16  CL-CLAIM-PREM-TYPE      PIC X.
000104             88  SINGLE-PREMIUM         VALUE '1'.
000105             88  O-B-COVERAGE           VALUE '2'.
000106             88  OPEN-END-COVERAGE      VALUE '3'.
000107         16  CL-INCURRED-DT          PIC XX.
000108         16  CL-REPORTED-DT          PIC XX.
000109         16  CL-FILE-ESTABLISH-DT    PIC XX.
000110         16  CL-EST-END-OF-DISAB-DT  PIC XX.
000111         16  CL-LAST-PMT-DT          PIC XX.
000112         16  CL-LAST-PMT-AMT         PIC S9(7)V99  COMP-3.
000113         16  CL-PAID-THRU-DT         PIC XX.
000114         16  CL-TOTAL-PAID-AMT       PIC S9(7)V99  COMP-3.
000115         16  CL-NO-OF-PMTS-MADE      PIC S9(3)     COMP-3.
000116         16  CL-NO-OF-DAYS-PAID      PIC S9(4)     COMP.
000117         16  CL-PMT-CALC-METHOD      PIC X.
000118             88  CL-360-DAY-YR          VALUE '1'.
000119             88  CL-365-DAY-YR          VALUE '2'.
000120             88  CL-FULL-MONTHS         VALUE '3'.
000121         16  CL-CAUSE-CD             PIC X(6).
000122
000123         16  CL-PRIME-CERT-NO.
000124             20  CL-PRIME-CERT-PRIME PIC X(10).
000125             20  CL-PRIME-CERT-SFX   PIC X.
000126
000127         16  CL-SYSTEM-IDENTIFIER    PIC XX.
000128             88  CL-CREDIT-CLAIM        VALUE 'CR'.
000129             88  CL-CONVENIENCE-CLAIM   VALUE 'CV'.
000130
000131         16  CL-MICROFILM-NO         PIC X(10).
000132         16  FILLER REDEFINES CL-MICROFILM-NO.
000133             20  CL-BENEFIT-PERIOD   PIC 99.
000134             20  FILLER              PIC X(8).
000135         16  CL-PROG-FORM-TYPE       PIC X.
000136         16  CL-LAST-ADD-ON-DT       PIC XX.
000137
000138         16  CL-LAST-REOPEN-DT       PIC XX.
000139         16  CL-LAST-CLOSE-DT        PIC XX.
000140         16  CL-LAST-CLOSE-REASON    PIC X(01).
000141             88  FINAL-PAID             VALUE '1'.
000142             88  CLAIM-DENIED           VALUE '2'.
000143             88  AUTO-CLOSE             VALUE '3'.
000144             88  MANUAL-CLOSE           VALUE '4'.
000145             88  BENEFITS-CHANGED       VALUE 'C'.
000146             88  SETUP-ERRORS           VALUE 'E'.
000147         16  CL-ASSOC-CERT-SEQU      PIC S99.
000148         16  CL-ASSOC-CERT-TOTAL     PIC S99.
000149         16  CL-CLAIM-PAYMENT-STATUS PIC 9.
000150             88  PAYMENT-IN-PREP        VALUE 1 THRU 9.
000151         16  CL-TOTAL-INT-PAID       PIC S9(5)V99 COMP-3.
000152         16  FILLER                  PIC X.
000153
000154     12  CL-CERTIFICATE-DATA.
000155         16  CL-CERT-ORIGIN          PIC X.
000156             88  CERT-WAS-ONLINE        VALUE '1'.
000157             88  CERT-WAS-CREATED       VALUE '2'.
000158             88  COVERAGE-WAS-ADDED     VALUE '3'.
000159         16  CL-CERT-KEY-DATA.
000160             20  CL-CERT-CARRIER     PIC X.
000161             20  CL-CERT-GROUPING    PIC X(6).
000162             20  CL-CERT-STATE       PIC XX.
000163             20  CL-CERT-ACCOUNT.
000164                 24  CL-CERT-ACCOUNT-PREFIX PIC X(4).
000165                 24  CL-CERT-ACCOUNT-PRIME  PIC X(6).
000166             20  CL-CERT-EFF-DT      PIC XX.
000167
000168     12  CL-STATUS-CONTROLS.
000169         16  CL-PRIORITY-CD          PIC X.
000170             88  CONFIDENTIAL-DATA      VALUE '8'.
000171             88  HIGHEST-PRIORITY       VALUE '9'.
000172         16  CL-SUPV-ATTN-CD         PIC X.
000173             88  SUPV-NOT-REQUIRED      VALUE ' ' 'N'.
000174             88  SUPV-IS-REQUIRED       VALUE 'Y'.
000175         16  CL-PURGED-DT            PIC XX.
000176         16  CL-RESTORED-DT          PIC XX.
000177         16  CL-NEXT-AUTO-PAY-DT     PIC XX.
000178         16  CL-NEXT-RESEND-DT       PIC XX.
000179         16  CL-NEXT-FOLLOWUP-DT     PIC XX.
000180         16  CL-CRITICAL-PERIOD      PIC 99.
000181*        16  FILLER                  PIC XX.
000182         16  CL-LAST-MAINT-DT        PIC XX.
000183         16  CL-LAST-MAINT-USER      PIC X(4).
000184         16  CL-LAST-MAINT-HHMMSS    PIC S9(6)     COMP-3.
000185         16  CL-LAST-MAINT-TYPE      PIC X.
000186             88  CLAIM-SET-UP           VALUE ' '.
000187             88  PAYMENT-MADE           VALUE '1'.
000188             88  LETTER-SENT            VALUE '2'.
000189             88  MASTER-WAS-ALTERED     VALUE '3'.
000190             88  MASTER-WAS-RESTORED    VALUE '4'.
000191             88  INCURRED-DATE-CHANGED  VALUE '5'.
000192             88  FILE-CONVERTED         VALUE '6'.
000193             88  CHANGE-OF-BENEFITS     VALUE 'C'.
000194             88  ERROR-CORRECTION       VALUE 'E'.
000195         16  CL-RELATED-CLAIM-NO     PIC X(7).
000196         16  CL-HISTORY-ARCHIVE-DT   PIC XX.
000197         16  CL-BENEFICIARY          PIC X(10).
000198         16  CL-FILE-ESTABLISHED-BY  PIC X(4).
000199         16  CL-DENIAL-TYPE          PIC X.
000200             88  CL-TYPE-DENIAL          VALUE '1'.
000201             88  CL-TYPE-RESCISSION      VALUE '2'.
000202             88  CL-TYPE-REFORMATION     VALUE '3'.
000203             88  CL-TYPE-REF-TO-RES      VALUE '4'.
000204             88  CL-TYPE-RECONSIDERED    VALUE '5'.
000205         16  CL-NO-OF-EXTENSIONS     PIC 99.
000206
000207         16  filler                  pic x(3).
000208*        16  CL-CRIT-PER-RECURRENT   PIC X.
000209*        16  CL-CRIT-PER-RTW-MOS     PIC 99.
000210*        16  CL-RTW-DT               PIC XX.
000211
000212     12  CL-TRAILER-CONTROLS.
000213         16  CL-TRAILER-SEQ-CNT      PIC S9(4)     COMP.
000214             88  CL-1ST-TRL-AVAIL       VALUE +4095.
000215             88  CL-LAST-TRL-AVAIL      VALUE +100.
000216             88  CL-RESV-EXP-HIST-TRLR  VALUE +0.
000217         16  CL-LAST-INC-DT-CHANGE   PIC S9(4)     COMP.
000218         16  FILLER                  PIC XX.
000219         16  CL-AUTO-PAY-SEQ         PIC S9(4)     COMP.
000220         16  CL-ADDRESS-TRAILER-CNT.
000221             20  CL-INSURED-ADDR-CNT  PIC S9(1).
000222                 88  NO-INSURED-AVAILABLE    VALUE ZERO.
000223             20  CL-ACCOUNT-ADDR-CNT  PIC S9(1).
000224                 88  ACCOUNT-IS-ONLINE       VALUE ZERO.
000225             20  CL-BENIF-ADDR-CNT    PIC S9(1).
000226                 88  BENEFICIARY-IS-ONLINE   VALUE ZERO.
000227             20  CL-EMPLOYER-ADDR-CNT PIC S9(1).
000228                 88  NO-EMPLOY-AVAILABLE     VALUE ZERO.
000229             20  CL-DOCTOR-ADDR-CNT   PIC S9(1).
000230                 88  NO-DOCTOR-AVAILABLE     VALUE ZERO.
000231             20  CL-OTHER-1-ADDR-CNT  PIC S9(1).
000232                 88  NO-OTHER-1-ADDRESSES    VALUE ZERO.
000233             20  CL-OTHER-2-ADDR-CNT  PIC S9(1).
000234                 88  NO-OTHER-2-ADDRESSES    VALUE ZERO.
000235
000236     12  CL-CV-REFERENCE-NO.
000237         16  CL-CV-REFNO-PRIME       PIC X(18).
000238         16  CL-CV-REFNO-SFX         PIC XX.
000239
000240     12  CL-FILE-LOCATION            PIC X(4).
000241
000242     12  CL-PROCESS-ERRORS.
000243         16  CL-FATAL-ERROR-CNT      PIC S9(4)     COMP.
000244             88  NO-FATAL-ERRORS        VALUE ZERO.
000245         16  CL-FORCEABLE-ERROR-CNT  PIC S9(4)     COMP.
000246             88  NO-FORCABLE-ERRORS     VALUE ZERO.
000247
000248     12  CL-PRODUCT-CD               PIC X.
000249
000250     12  CL-CURRENT-KEY-DATA.
000251         16  CL-CURRENT-CARRIER      PIC X.
000252         16  CL-CURRENT-GROUPING     PIC X(6).
000253         16  CL-CURRENT-STATE        PIC XX.
000254         16  CL-CURRENT-ACCOUNT      PIC X(10).
000255
000256     12  CL-ASSOCIATES               PIC X.
000257         88  CL-ASSOC-NO-INTERFACE      VALUE 'A'.
000258         88  CL-ASSOC-INTERFACE         VALUE 'I'.
000259         88  CL-NON-ASSOC-NO-INTERFACE  VALUE 'N'.
000260         88  CL-NON-ASSOC-INTERFACE     VALUE 'M'.
000261
000262     12  CL-ACTIVITY-CODE            PIC 99.
000263     12  CL-ACTIVITY-MAINT-DT        PIC XX.
000264     12  CL-ACTIVITY-MAINT-TYPE      PIC X(4).
000265
000266     12  CL-LAPSE-REPORT-CODE        PIC 9.
000267     12  CL-LAG-REPORT-CODE          PIC 9.
000268     12  CL-LOAN-TYPE                PIC XX.
000269     12  CL-LEGAL-STATE              PIC XX.
000270
000271     12  CL-YESNOSW                  PIC X.
000272     12  CL-ACCIDENT-CLAIM-SW        PIC X.
000273         88  CL-ACCIDENT-NOT-SET           VALUE ' '.
000274         88  CL-CLAIM-DUE-TO-ACCIDENT      VALUE 'Y'.
000275         88  CL-CLAIM-NOT-DUE-TO-ACCIDENT  VALUE 'N'.
000276     12  cl-insured-type             pic x.
000277         88  cl-claim-on-primary         value 'P'.
000278         88  cl-claim-on-co-borrower     value 'C'.
000279     12  cl-benefit-expiration-dt    PIC XX.
      *<<((file: ELCMSTR))
001021*                                COPY ELCTRLR.
      *>>((file: ELCTRLR))
000001******************************************************************
000002*                                                                *
000003*                            ELCTRLR.                            *
000004*           COPYBOOK REVIEWED FOR YEAR 2000 COMPLIANCE
000005*                            VMOD=2.014                          *
000006*                                                                *
000007*   FILE DESCRIPTION = ACTIVITY TRAILER FILE                     *
000008*                                                                *
000009*   FILE TYPE = VSAM,KSDS                                        *
000010*   RECORD SIZE = 200    RECFORM = FIXED                         *
000011*                                                                *
000012*   BASE CLUSTER NAME = ELTRLR             RKP=2,LEN=22          *
000013*       ALTERNATE INDEX = NONE                                   *
000014*                                                                *
000015*   LOG = YES                                                    *
000016*   SERVREQ = BROWSE, DELETE, UPDATE, NEWREC                     *
000017******************************************************************
000018*                   C H A N G E   L O G
000019*
000020* CHANGES ARE MARKED BY THE CHANGE EFFECTIVE DATE.
000021*-----------------------------------------------------------------
000022*  CHANGE   CHANGE REQUEST PGMR  DESCRIPTION OF CHANGE
000023* EFFECTIVE    NUMBER
000024*-----------------------------------------------------------------
000025* 120503    2003080800002  SMVA  INITIAL SECURE PAY CHANGES
000026* 022106    2004040700004  PEMA  ADD LIFE CLAIM INTEREST
000027* 050506    2006030600001  AJRA  ADD DENIAL PROOF DATE
000028* 062806    2006030600001  AJRA  ADD PAYMENT PROOF DATE
000029* 080106    2006052500001  AJRA  ADD N AND R NOTE TYPES
000030* 041807    2006032200004  AJRA  ADD APPROVED BY TO PAYMENT
000031* 082807    2007032100001  PEMA  ADD INT RATE TO PMT TRLR
000032* 101807  IR2007100100007  PEMA  EXPAND SIZE OF CLM RESERVE FLDS
000033* 070909    2009060400001  AJRA  ADD AUTO PAY END LETTER
000034* 040110  CR2009070600002  AJRA  ADD RESEND LETTER ID TO LETTER
000035* 071910  CR2009122800001  PEMA  ADD EOB SWITCHES
000036* 102610    2009122800001  AJRA  ADD STOP DATE TO LETTER
000037* 061511    2011042000002  AJRA  ADD VFY 2ND BENE TO ADDRESS TRAIL
000038* 020413    2012071700001  AJRA  PRINT SURVEY AND PRINT CLM FORM I
000039* 021213    2012092400007  AJRA  CAUSAL STATE SEQUENCE NO
000040* 061013  CR2012113000002  PEMA  SPP CLAIM RELATED CHANGES
000041* 102413  CR2013100800001  AJRA  ADD SPECIAL RELEASE IND
000042* 022614    2013050100003  AJRA  ADD CERT CANCELLED NOTE TYPE - T
000043* 040814    2014030500002  AJRA  ADD ICD CODES
000044* 052614  CR2014022100001  AJRA  ADD FAMILY LEAVE CLAIM TYPE
000045* 013017  CR2016053100001  PEMA  ACH PROCESSING
000046* 062217  CR2017050300002  TANA  ADD AUTH RCVD
000047* 100518  CR2017061500001  TANA  ADD OTHER CLAIM TYPE
000048* 102418  CR2018083000001  TANA  ADD ADD NEW CALL TYPE
000049******************************************************************
000050 01  ACTIVITY-TRAILERS.
000051     12  AT-RECORD-ID                    PIC XX.
000052         88  VALID-AT-ID                       VALUE 'AT'.
000053
000054     12  AT-CONTROL-PRIMARY.
000055         16  AT-COMPANY-CD               PIC X.
000056         16  AT-CARRIER                  PIC X.
000057         16  AT-CLAIM-NO                 PIC X(7).
000058         16  AT-CERT-NO.
000059             20  AT-CERT-PRIME           PIC X(10).
000060             20  AT-CERT-SFX             PIC X.
000061         16  AT-SEQUENCE-NO              PIC S9(4)     COMP.
000062             88  AT-1ST-TRL-AVAIL             VALUE +4095.
000063             88  AT-LAST-TRL-AVAIL            VALUE +100.
000064             88  AT-RESV-EXP-HIST-TRL         VALUE +0.
000065             88  AT-INSURED-ADDR-TRL          VALUE +1 THRU +9.
000066             88  AT-BENEFICIARY-ADDR-TRL      VALUE +11 THRU +19.
000067             88  AT-ACCOUNT-ADDR-TRL          VALUE +21 THRU +29.
000068             88  AT-PHYSICIAN-ADDR-TRL        VALUE +31 THRU +39.
000069             88  AT-EMPLOYERS-ADDR-TRL        VALUE +41 THRU +49.
000070             88  AT-OTHER-1-ADDR-TRL          VALUE +51 THRU +59.
000071             88  AT-OTHER-2-ADDR-TRL          VALUE +61 THRU +69.
000072             88  AT-DIAGNOSIS-TRL             VALUE +90.
000073             88  AT-BENEFICIARY-TRL           VALUE +91.
000074             88  AT-SPECIAL-REVIEW-TRL        VALUE +92.
000075             88  AT-VFY-2ND-BENE-NOTE-TRL     VALUE +93.
000076             88  AT-VFY-CAUSAL-STATE          VALUE +94.
000077             88  AT-ERROR-MSGS-TRL            VALUE +95.
000078
000079     12  AT-TRAILER-TYPE                 PIC X.
000080         88  RESERVE-EXPENSE-TR               VALUE '1'.
000081         88  PAYMENT-TR                       VALUE '2'.
000082         88  AUTO-PAY-TR                      VALUE '3'.
000083         88  CORRESPONDENCE-TR                VALUE '4'.
000084         88  ADDRESS-TR                       VALUE '5'.
000085         88  GENERAL-INFO-TR                  VALUE '6'.
000086         88  AUTO-PROMPT-TR                   VALUE '7'.
000087         88  DENIAL-TR                        VALUE '8'.
000088         88  INCURRED-CHG-TR                  VALUE '9'.
000089         88  FORM-CONTROL-TR                  VALUE 'A'.
000090
000091     12  AT-RECORDED-DT                  PIC XX.
000092     12  AT-RECORDED-BY                  PIC X(4).
000093     12  AT-LAST-MAINT-HHMMSS            PIC S9(6)     COMP-3.
000094
000095     12  AT-TRAILER-BODY                 PIC X(165).
000096
000097     12  AT-RESERVE-EXPENSE-TR  REDEFINES  AT-TRAILER-BODY.
000098         16  AT-RESERVE-CONTROLS.
000099             20  AT-MANUAL-SW            PIC X.
000100                 88  AT-MANUAL-RESERVES-USED VALUE '1'.
000101             20  AT-FUTURE-SW            PIC X.
000102                 88  AT-FUTURE-RESERVES-USED VALUE '1'.
000103             20  AT-PTC-SW               PIC X.
000104                 88  AT-PAY-TO-CURRENT-USED  VALUE '1'.
000105             20  AT-IBNR-SW              PIC X.
000106                 88  AT-IBNR-RESERVES-USED   VALUE '1'.
000107             20  AT-PTC-LF-SW            PIC X.
000108                 88  AT-LF-PTC-USED          VALUE '1'.
000109             20  AT-CDT-ACCESS-METHOD    PIC X.
000110                 88  AT-CDT-ROUND-NEAR       VALUE '1'.
000111                 88  AT-CDT-ROUND-HIGH       VALUE '2'.
000112                 88  AT-CDT-INTERPOLATED     VALUE '3'.
000113             20  AT-PERCENT-OF-CDT       PIC S9(3)V99    COMP-3.
000114         16  AT-LAST-COMPUTED-DT         PIC XX.
000115         16  AT-FUTURE-RESERVE           PIC S9(7)V99    COMP-3.
000116         16  AT-PAY-CURRENT-RESERVE      PIC S9(7)V99    COMP-3.
000117         16  AT-IBNR-RESERVE             PIC S9(7)V99    COMP-3.
000118         16  AT-INITIAL-MANUAL-RESERVE   PIC S9(7)V99    COMP-3.
000119         16  AT-CURRENT-MANUAL-RESERVE   PIC S9(7)V99    COMP-3.
000120         16  AT-ITD-ADDITIONAL-RESERVE   PIC S9(7)V99    COMP-3.
000121         16  AT-EXPENSE-CONTROLS.
000122             20  AT-EXPENSE-METHOD       PIC X.
000123                 88  NO-EXPENSE-CALCULATED    VALUE '1'.
000124                 88  FLAT-DOLLAR-PER-PMT      VALUE '2'.
000125                 88  PERCENT-OF-PMT           VALUE '3'.
000126                 88  DOLLAR-PER-OPEN-MONTH    VALUE '4'.
000127             20  AT-EXPENSE-PERCENT      PIC S9(3)V99    COMP-3.
000128             20  AT-EXPENSE-DOLLAR       PIC S9(3)V99    COMP-3.
000129         16  AT-ITD-PAID-EXPENSES        PIC S9(5)V99    COMP-3.
000130         16  AT-ITD-CHARGEABLE-EXPENSE   PIC S9(5)V99    COMP-3.
000131
000132         16  AT-ITD-LIFE-REFUNDS         PIC S9(5)V99    COMP-3.
000133         16  AT-ITD-AH-REFUNDS           PIC S9(5)V99    COMP-3.
000134
000135*        16  FILLER                      PIC X(53).
000136         16  FILLER                      PIC X(47).
000137
000138         16  AT-RESERVES-LAST-MAINT-DT   PIC XX.
000139         16  AT-RESERVES-LAST-UPDATED-BY PIC X(4).
000140
000141         16  AT-OPEN-CLOSE-HISTORY OCCURS 6 TIMES.
000142             20  AT-OPEN-CLOSE-DATE      PIC XX.
000143             20  AT-OPEN-CLOSE-TYPE      PIC X.
000144*                    C = CLOSED
000145*                    O = OPEN
000146             20  AT-OPEN-CLOSE-REASON    PIC X(5).
000147*                   REASONS = ALTER, AUTO, FINAL, NEW, FORCE
000148
000149     12  AT-PAYMENT-TR  REDEFINES  AT-TRAILER-BODY.
000150         16  AT-PAYMENT-TYPE             PIC X.
000151             88  PARTIAL-PAYMENT                VALUE '1'.
000152             88  FINAL-PAYMENT                  VALUE '2'.
000153             88  LUMP-SUM-PAYMENT               VALUE '3'.
000154             88  ADDITIONAL-PAYMENT             VALUE '4'.
000155             88  CHARGEABLE-EXPENSE             VALUE '5'.
000156             88  NON-CHARGEABLE-EXPENSE         VALUE '6'.
000157             88  VOIDED-PAYMENT                 VALUE '9'.
000158             88  TRANSFER                       VALUE 'T'.
000159             88  LIFE-INTEREST                  VALUE 'I'.
000160
000161         16  AT-CLAIM-TYPE               PIC X.
000162             88  PAID-FOR-AH                    VALUE 'A'.
000163             88  PAID-FOR-LIFE                  VALUE 'L'.
000164             88  PAID-FOR-IUI                   VALUE 'I'.
000165             88  PAID-FOR-GAP                   VALUE 'G'.
000166             88  PAID-FOR-FAM                   VALUE 'F'.
000167             88  PAID-FOR-OTH                   VALUE 'O'.
000168         16  AT-CLAIM-PREM-TYPE          PIC X.
000169             88  AT-SINGLE-PREMIUM              VALUE '1'.
000170             88  AT-O-B-COVERAGE                VALUE '2'.
000171             88  AT-OPEN-END-COVERAGE           VALUE '3'.
000172         16  AT-AMOUNT-PAID              PIC S9(7)V99  COMP-3.
000173         16  AT-CHECK-NO                 PIC X(7).
000174         16  AT-PAID-FROM-DT             PIC XX.
000175         16  AT-PAID-THRU-DT             PIC XX.
000176         16  AT-DAYS-IN-PERIOD           PIC S9(4)     COMP.
000177         16  AT-ACH-PAYMENT              PIC X.
000178*        16  FILLER                      PIC X.
000179         16  AT-PAYEES-NAME              PIC X(30).
000180         16  AT-PAYMENT-ORIGIN           PIC X.
000181             88  ONLINE-MANUAL-PMT              VALUE '1'.
000182             88  ONLINE-AUTO-PMT                VALUE '2'.
000183             88  OFFLINE-PMT                    VALUE '3'.
000184         16  AT-CHECK-WRITTEN-DT         PIC XX.
000185         16  AT-TO-BE-WRITTEN-DT         PIC XX.
000186         16  AT-VOID-DATA.
000187             20  AT-VOID-DT              PIC XX.
000188*00144       20  AT-VOID-REASON          PIC X(30).
000189             20  AT-VOID-REASON          PIC X(26).
000190         16  AT-PMT-APPROVED-BY          PIC X(04).
000191         16  AT-ADDL-RESERVE             PIC S9(5)V99  COMP-3.
000192         16  AT-EXPENSE-PER-PMT          PIC S9(5)V99  COMP-3.
000193         16  AT-INT-RATE REDEFINES AT-EXPENSE-PER-PMT
000194                                         PIC S99V9(5)  COMP-3.
000195         16  AT-CREDIT-INTERFACE.
000196             20  AT-PMT-SELECT-DT        PIC XX.
000197                 88  PAYMENT-NOT-SELECTED  VALUE LOW-VALUE.
000198             20  AT-PMT-ACCEPT-DT        PIC XX.
000199                 88  PAYMENT-NOT-ACCEPTED  VALUE LOW-VALUE.
000200             20  AT-VOID-SELECT-DT       PIC XX.
000201                 88  VOID-NOT-SELECTED     VALUE LOW-VALUE.
000202             20  AT-VOID-ACCEPT-DT       PIC XX.
000203                 88  VOID-NOT-ACCEPTED     VALUE LOW-VALUE.
000204
000205         16  AT-CHECK-QUE-CONTROL        PIC S9(8)     COMP.
000206                 88  PAYMENT-NOT-QUEUED           VALUE ZERO.
000207                 88  CONVERSION-PAYMENT           VALUE +99999999.
000208         16  AT-CHECK-QUE-SEQUENCE       PIC S9(4)     COMP.
000209
000210         16  AT-FORCE-CONTROL            PIC X.
000211             88  PAYMENT-WAS-FORCED           VALUE '1'.
000212         16  AT-PREV-LAST-PMT-DT         PIC XX.
000213         16  AT-PREV-PAID-THRU-DT        PIC XX.
000214         16  AT-PREV-LAST-PMT-AMT        PIC S9(7)V99  COMP-3.
000215         16  AT-ELIMINATION-DAYS         PIC S999      COMP-3.
000216         16  AT-DAILY-RATE               PIC S9(3)V99  COMP-3.
000217         16  AT-BENEFIT-TYPE             PIC X.
000218
000219         16  AT-EXPENSE-TYPE             PIC X.
000220         16  AT-PAYMENT-APPROVAL-SW      PIC X.
000221
000222         16  AT-PAYEE-TYPE-CD.
000223             20  AT-PAYEE-TYPE           PIC X.
000224                 88  INSURED-PAID           VALUE 'I'.
000225                 88  BENEFICIARY-PAID       VALUE 'B'.
000226                 88  ACCOUNT-PAID           VALUE 'A'.
000227                 88  OTHER-1-PAID           VALUE 'O'.
000228                 88  OTHER-2-PAID           VALUE 'Q'.
000229                 88  DOCTOR-PAID            VALUE 'P'.
000230                 88  EMPLOYER-PAID          VALUE 'E'.
000231             20  AT-PAYEE-SEQ            PIC X.
000232
000233         16  AT-CASH-PAYMENT             PIC X.
000234         16  AT-GROUPED-PAYMENT          PIC X.
000235         16  AT-PAYMENT-NOTE-SEQ-NO      PIC S9(4)       COMP.
000236         16  AT-APPROVAL-LEVEL-REQD      PIC X.
000237         16  AT-APPROVED-LEVEL           PIC X.
000238         16  AT-VOID-TYPE                PIC X.
000239             88  AT-PAYMENT-WAS-STOPPED     VALUE 'S'.
000240             88  AT-PAYMENT-WAS-VOIDED      VALUE 'V'.
000241         16  AT-AIG-UNEMP-IND            PIC X.
000242             88  AT-AIG-UNEMPLOYMENT-PMT    VALUE 'U'.
000243         16  AT-ASSOCIATES               PIC X.
000244             88  AT-AIG-INTERFACE           VALUE 'I' 'N'.
000245             88  AT-AIG-NON-INTERFACE       VALUE 'A' 'M'.
000246
000247         16  AT-FORM-CTL-SEQ-NO          PIC S9(4)       COMP.
000248         16  AT-CV-PMT-CODE              PIC X.
000249             88  FULL-DEATH-PAYMENT         VALUE '1'.
000250             88  HALF-DEATH-PAYMENT         VALUE '2'.
000251             88  FULL-ADD-PAYMENT           VALUE '3'.
000252             88  HALF-ADD-PAYMENT           VALUE '4'.
000253             88  FULL-RIDER-PAYMENT         VALUE '5'.
000254             88  HALF-RIDER-PAYMENT         VALUE '6'.
000255             88  NON-CHG-EXP-PAYMENT        VALUE '7'.
000256             88  ADDL-PAYMENT               VALUE '8'.
000257
000258         16  AT-EOB-CODE1                PIC XXX.
000259         16  AT-EOB-CODE2                PIC XXX.
000260         16  AT-EOB-CODE3                PIC XXX.
000261         16  FILLER REDEFINES AT-EOB-CODE3.
000262             20  AT-PRINT-CLM-FORM       PIC X.
000263             20  AT-PRINT-SURVEY         PIC X.
000264             20  AT-SPECIAL-RELEASE      PIC X.
000265         16  AT-EOB-CODE4                PIC XXX.
000266         16  FILLER REDEFINES AT-EOB-CODE4.
000267             20  AT-INT-PMT-SELECT-DT    PIC XX.
000268             20  FILLER                  PIC X.
000269         16  AT-EOB-CODE5                PIC XXX.
000270         16  FILLER REDEFINES AT-EOB-CODE5.
000271             20  AT-PMT-PROOF-DT         PIC XX.
000272             20  FILLER                  PIC X.
000273
000274         16  AT-PRINT-EOB-WITH-CHECK     PIC X.
000275             88  AT-PRINT-EOB            VALUE 'Y'.
000276
000277         16  AT-PAYMENT-LAST-MAINT-DT    PIC XX.
000278         16  AT-PAYMENT-LAST-UPDATED-BY  PIC X(4).
000279
000280     12  AT-AUTO-PAY-TR  REDEFINES  AT-TRAILER-BODY.
000281         16  AT-SCHEDULE-START-DT        PIC XX.
000282         16  AT-SCHEDULE-END-DT          PIC XX.
000283         16  AT-TERMINATED-DT            PIC XX.
000284         16  AT-LAST-PMT-TYPE            PIC X.
000285             88  LAST-PMT-IS-FINAL              VALUE 'F'.
000286             88  LAST-PMT-IS-PARTIAL            VALUE 'P'.
000287         16  AT-FIRST-PMT-DATA.
000288             20  AT-FIRST-PMT-AMT        PIC S9(7)V99  COMP-3.
000289             20  AT-DAYS-IN-1ST-PMT      PIC S9(4)     COMP.
000290             20  AT-1ST-PAY-THRU-DT      PIC XX.
000291         16  AT-REGULAR-PMT-DATA.
000292             20  AT-REGULAR-PMT-AMT      PIC S9(7)V99  COMP-3.
000293             20  AT-DAYS-IN-REG-PMT      PIC S9(4)     COMP.
000294             20  AT-INTERVAL-MONTHS      PIC S9(4)     COMP.
000295         16  AT-AUTO-PAYEE-CD.
000296             20  AT-AUTO-PAYEE-TYPE      PIC X.
000297                 88  INSURED-PAID-AUTO      VALUE 'I'.
000298                 88  BENEFICIARY-PAID-AUTO  VALUE 'B'.
000299                 88  ACCOUNT-PAID-AUTO      VALUE 'A'.
000300                 88  OTHER-1-PAID-AUTO      VALUE 'O'.
000301                 88  OTHER-2-PAID-AUTO      VALUE 'Q'.
000302             20  AT-AUTO-PAYEE-SEQ       PIC X.
000303         16  AT-AUTO-PAY-DAY             PIC 99.
000304         16  AT-AUTO-CASH                PIC X.
000305             88  AT-CASH                      VALUE 'Y'.
000306             88  AT-NON-CASH                  VALUE 'N'.
000307*        16  FILLER                      PIC X(129).
000308         16  AT-AUTO-END-LETTER          PIC X(4).
000309         16  FILLER                      PIC X(125).
000310
000311         16  AT-AUTO-PAY-LAST-MAINT-DT   PIC XX.
000312         16  AT-AUTO-PAY-LAST-UPDATED-BY PIC X(4).
000313
000314     12  AT-CORRESPONDENCE-TR  REDEFINES  AT-TRAILER-BODY.
000315         16  AT-LETTER-SENT-DT           PIC XX.
000316         16  AT-RECEIPT-FOLLOW-UP        PIC XX.
000317         16  AT-AUTO-RE-SEND-DT          PIC XX.
000318         16  AT-LETTER-ANSWERED-DT       PIC XX.
000319         16  AT-LETTER-ARCHIVE-NO        PIC S9(8)     COMP.
000320         16  AT-LETTER-ORIGIN            PIC X.
000321             88  ONLINE-CREATION              VALUE '1' '3'.
000322             88  OFFLINE-CREATION             VALUE '2' '4'.
000323             88  NAPER-ONLINE-CREATION        VALUE '3'.
000324             88  NAPER-OFFLINE-CREATION       VALUE '4'.
000325         16  AT-STD-LETTER-FORM          PIC X(4).
000326         16  AT-REASON-TEXT              PIC X(70).
000327         16  AT-ADDRESS-REC-SEQ-NO       PIC S9(4)     COMP.
000328         16  AT-ADDRESEE-TYPE            PIC X.
000329              88  INSURED-ADDRESEE            VALUE 'I'.
000330              88  BENEFICIARY-ADDRESEE        VALUE 'B'.
000331              88  ACCOUNT-ADDRESEE            VALUE 'A'.
000332              88  PHYSICIAN-ADDRESEE          VALUE 'P'.
000333              88  EMPLOYER-ADDRESEE           VALUE 'E'.
000334              88  OTHER-ADDRESEE-1            VALUE 'O'.
000335              88  OTHER-ADDRESEE-2            VALUE 'Q'.
000336         16  AT-ADDRESSEE-NAME           PIC X(30).
000337         16  AT-INITIAL-PRINT-DATE       PIC XX.
000338         16  AT-RESEND-PRINT-DATE        PIC XX.
000339         16  AT-CORR-SOL-UNSOL           PIC X.
000340         16  AT-LETTER-PURGED-DT         PIC XX.
000341*
000342*FOLLOWING CID CHGS REENTERED AS DMD CHGS OVERLAID THEM.
000343*
000344         16  AT-CSO-REDEFINITION.
000345             20  AT-RESEND-LETTER-FORM   PIC X(4).
000346             20  AT-AUTO-CLOSE-IND       PIC X(1).
000347             20  AT-LETTER-TO-BENE       PIC X(1).
000348             20  AT-STOP-LETTER-DT       PIC X(2).
000349             20  AT-AUTH-RCVD            PIC X(1).
000350             20  FILLER                  PIC X(18).
000351*             20  FILLER                  PIC X(27).
000352             20  AT-CSO-LETTER-STATUS    PIC X.
000353                 88  AT-CSO-LETTER-ONLINE    VALUE '1'.
000354                 88  AT-CSO-LETTER-PURGED    VALUE '2'.
000355                 88  AT-CSO-LETTER-RELOADED  VALUE '3'.
000356             20  AT-CSO-LETTER-PURGE-DATE   PIC XX.
000357             20  AT-CSO-LETTER-RELOAD-DATE  PIC XX.
000358*
000359*FOLLOWING DMD CHGS COMMENTED OUT AS THEY OVERLAY CID MODS NEEDED
000360*
000361*        16  FILLER                      PIC X(26).
000362*
000363*        16  AT-DMD-BSR-CODE             PIC X.
000364*            88  AT-AUTOMATED-BSR              VALUE 'A'.
000365*            88  AT-NON-AUTOMATED-BSR          VALUE 'B' ' '.
000366*
000367*        16  AT-DMD-LETTER-STATUS        PIC X.
000368*            88  AT-DMD-LETTER-ONLINE          VALUE '1'.
000369*            88  AT-DMD-LETTER-PURGED          VALUE '2'.
000370*            88  AT-DMD-LETTER-RELOADED        VALUE '3'.
000371*        16  AT-DMD-LETTER-PURGE-DT      PIC XX.
000372*        16  AT-DMD-LETTER-RELOAD-DT     PIC XX.
000373
000374         16  AT-CORR-LAST-MAINT-DT       PIC XX.
000375         16  AT-CORR-LAST-UPDATED-BY     PIC X(4).
000376
000377     12  AT-ADDRESS-TR  REDEFINES  AT-TRAILER-BODY.
000378         16  AT-ADDRESS-TYPE             PIC X.
000379             88  INSURED-ADDRESS               VALUE 'I'.
000380             88  BENEFICIARY-ADDRESS           VALUE 'B'.
000381             88  ACCOUNT-ADDRESS               VALUE 'A'.
000382             88  PHYSICIAN-ADDRESS             VALUE 'P'.
000383             88  EMPLOYER-ADDRESS              VALUE 'E'.
000384             88  OTHER-ADDRESS-1               VALUE 'O'.
000385             88  OTHER-ADDRESS-2               VALUE 'Q'.
000386         16  AT-MAIL-TO-NAME             PIC X(30).
000387         16  AT-ADDRESS-LINE-1           PIC X(30).
000388         16  AT-ADDRESS-LINE-2           PIC X(30).
000389         16  AT-CITY-STATE.
000390             20  AT-CITY                 PIC X(28).
000391             20  AT-STATE                PIC XX.
000392         16  AT-ZIP.
000393             20  AT-ZIP-CODE.
000394                 24  AT-ZIP-1ST          PIC X.
000395                     88  AT-CANADIAN-POST-CODE VALUE 'A' THRU 'Z'.
000396                 24  FILLER              PIC X(4).
000397             20  AT-ZIP-PLUS4            PIC X(4).
000398         16  AT-CANADIAN-POSTAL-CODE  REDEFINES  AT-ZIP.
000399             20  AT-CAN-POSTAL-1         PIC XXX.
000400             20  AT-CAN-POSTAL-2         PIC XXX.
000401             20  FILLER                  PIC XXX.
000402         16  AT-PHONE-NO                 PIC 9(11)     COMP-3.
000403*         16  FILLER                      PIC X(23).
000404         16  AT-VFY-2ND-BENE-SSN         PIC X(9).
000405         16  AT-VFY-2ND-BENE-VERIFIED    PIC X.
000406         16  FILLER                      PIC X(13).
000407         16  AT-ADDRESS-LAST-MAINT-DT    PIC XX.
000408         16  AT-ADDRESS-LAST-UPDATED-BY  PIC X(4).
000409
000410     12  AT-GENERAL-INFO-TR  REDEFINES  AT-TRAILER-BODY.
000411         16  AT-INFO-LINE-1              PIC X(60).
000412         16  FILLER REDEFINES AT-INFO-LINE-1.
000413             20  AT-NOTE-ERROR-NO OCCURS 15
000414                                         PIC X(4).
000415         16  AT-INFO-LINE-2              PIC X(60).
000416         16  FILLER REDEFINES AT-INFO-LINE-2.
000417             20  AT-ICD-CODE-1           PIC X(8).
000418             20  AT-ICD-CODE-2           PIC X(8).
000419             20  FILLER                  PIC X(44).
000420         16  AT-INFO-TRAILER-TYPE        PIC X.
000421             88  AT-ERRORS-NOTE          VALUE 'E'.
000422             88  AT-PAYMENT-NOTE         VALUE 'P'.
000423             88  AT-CALL-NOTE            VALUE 'C'.
000424             88  AT-MAINT-NOTE           VALUE 'M'.
000425             88  AT-CERT-CHANGE          VALUE 'X'.
000426             88  AT-APPROVAL-NOTE        VALUE 'R'.
000427             88  AT-NOTE-FILE-NOTE       VALUE 'N'.
000428             88  AT-CERT-CANCELLED       VALUE 'T'.
000429         16  AT-CALL-TYPE                PIC X.
000430             88  AT-PHONE-CALL-IN        VALUE 'I'.
000431             88  AT-PHONE-CALL-NEW       VALUE 'N'.
000432             88  AT-PHONE-CALL-OUT       VALUE 'O'.
000433         16  AT-NOTE-CONTINUATION        PIC X.
000434             88  AT-CONTINUED-NOTE       VALUE 'X'.
000435         16  AT-EOB-CODES-EXIST          PIC X.
000436             88  AT-EOB-CODES-PRESENT    VALUE 'Y'.
000437         16  FILLER                      PIC X(35).
000438         16  AT-GEN-INFO-LAST-MAINT-DT   PIC XX.
000439         16  AT-GEN-INFO-LAST-UPDATED-BY PIC X(4).
000440
000441     12  AT-AUTO-PROMPT-TR  REDEFINES  AT-TRAILER-BODY.
000442         16  AT-PROMPT-LINE-1            PIC X(60).
000443         16  AT-PROMPT-LINE-2            PIC X(60).
000444         16  AT-PROMPT-START-DT          PIC XX.
000445         16  AT-PROMPT-END-DT            PIC XX.
000446         16  FILLER                      PIC X(35).
000447         16  AT-PROMPT-LAST-MAINT-DT     PIC XX.
000448         16  AT-PROMPT-LAST-UPDATED-BY   PIC X(4).
000449
000450     12  AT-DENIAL-INFO-TR  REDEFINES  AT-TRAILER-BODY.
000451         16  AT-DENIAL-INFO-1            PIC X(60).
000452         16  AT-DENIAL-INFO-2            PIC X(60).
000453         16  AT-DENIAL-DT                PIC XX.
000454         16  AT-RETRACTION-DT            PIC XX.
000455         16  AT-DENIAL-REASON-CODE       PIC X(4).
000456*         16  FILLER                      PIC X(31).
000457         16  AT-DENIAL-PROOF-DT          PIC XX.
000458         16  FILLER                      PIC X(29).
000459         16  AT-DENIAL-LAST-MAINT-DT     PIC XX.
000460         16  AT-DENIAL-LAST-UPDATED-BY   PIC X(4).
000461
000462     12  AT-INCURRED-CHG-TR  REDEFINES  AT-TRAILER-BODY.
000463         16  AT-OLD-INCURRED-DT          PIC XX.
000464         16  AT-OLD-REPORTED-DT          PIC XX.
000465         16  AT-OLD-ESTABLISHED-DT       PIC XX.
000466         16  AT-OLD-TOTAL-PAID           PIC S9(7)V99     COMP-3.
000467         16  AT-OLD-DAYS-PAID            PIC S9(4)        COMP.
000468         16  AT-OLD-NO-OF-PMTS           PIC S9(3)        COMP-3.
000469         16  AT-OLD-PAID-THRU-DT         PIC XX.
000470         16  AT-LAST-PMT-MADE-DT         PIC XX.
000471         16  FILLER                      PIC X(26).
000472         16  AT-OLD-DIAG-CODE            PIC X(6).
000473         16  AT-TRAILER-CNT-AT-CHG       PIC S9(4)        COMP.
000474         16  AT-OLD-ITD-PAID-EXPENSE     PIC S9(5)V99     COMP-3.
000475         16  AT-OLD-CHARGABLE-EXPENSE    PIC S9(5)V99     COMP-3.
000476         16  AT-OLD-INIT-MAN-RESV        PIC S9(7)V99     COMP-3.
000477         16  AT-OLD-CURRENT-MAN-RESV     PIC S9(7)V99     COMP-3.
000478         16  AT-OLD-ADDL-MAN-RESV        PIC S9(7)V99     COMP-3.
000479         16  AT-OLD-DIAG-DESCRIP         PIC X(60).
000480         16  AT-OLD-ICD-CODE-1           PIC X(8).
000481         16  AT-OLD-ICD-CODE-2           PIC X(8).
000482         16  FILLER                      PIC X(9).
000483         16  AT-INCURRED-LAST-UPDATED-BY PIC X(4).
000484
000485     12  AT-FORM-CONTROL-TR  REDEFINES  AT-TRAILER-BODY.
000486         16  AT-FORM-SEND-ON-DT          PIC XX.
000487         16  AT-FORM-FOLLOW-UP-DT        PIC XX.
000488         16  AT-FORM-RE-SEND-DT          PIC XX.
000489         16  AT-FORM-ANSWERED-DT         PIC XX.
000490         16  AT-FORM-PRINTED-DT          PIC XX.
000491         16  AT-FORM-REPRINT-DT          PIC XX.
000492         16  AT-FORM-TYPE                PIC X.
000493             88  INITIAL-FORM                  VALUE '1'.
000494             88  PROGRESS-FORM                 VALUE '2'.
000495         16  AT-INSTRUCT-LN-1            PIC X(28).
000496         16  AT-INSTRUCT-LN-2            PIC X(28).
000497         16  AT-INSTRUCT-LN-3            PIC X(28).
000498         16  AT-FORM-ADDR-SEQ-NO         PIC S9(4)      COMP.
000499         16  AT-FORM-ADDRESS             PIC X.
000500             88  FORM-TO-INSURED              VALUE 'I'.
000501             88  FORM-TO-ACCOUNT              VALUE 'A'.
000502             88  FORM-TO-OTHER-1              VALUE 'O'.
000503             88  FORM-TO-OTHER-2              VALUE 'Q'.
000504         16  AT-RELATED-1.
000505             20 AT-REL-CARR-1            PIC X.
000506             20 AT-REL-CLAIM-1           PIC X(7).
000507             20 AT-REL-CERT-1            PIC X(11).
000508         16  AT-RELATED-2.
000509             20 AT-REL-CARR-2            PIC X.
000510             20 AT-REL-CLAIM-2           PIC X(7).
000511             20 AT-REL-CERT-2            PIC X(11).
000512         16  AT-EMP-FORM-SEND-ON-DT      PIC XX.
000513         16  AT-PHY-FORM-SEND-ON-DT      PIC XX.
000514         16  AT-EMP-FORM-ANSWERED-DT     PIC XX.
000515         16  AT-PHY-FORM-ANSWERED-DT     PIC XX.
000516         16  AT-FORM-REM-PRINT-DT        PIC XX.
000517         16  AT-STOP-FORM-DT             PIC X(2).
000518
000519         16  FILLER                      PIC X(09).
000520         16  AT-FORM-LAST-MAINT-DT       PIC XX.
000521         16  AT-FORM-LAST-UPDATED-BY     PIC X(4).
000522******************************************************************
      *<<((file: ELCTRLR))
001022*                                COPY ELCCERT.
      *>>((file: ELCCERT))
000001******************************************************************
000002*                                                                *
000003*                            ELCCERT.                            *
000004*           COPYBOOK REVIEWED FOR YEAR 2000 COMPLIANCE
000005*                            VMOD=2.013                          *
000006*                                                                *
000007*   FILE DESCRIPTION = CERTIFICATE MASTER                        *
000008*                                                                *
000009*   FILE TYPE = VSAM,KSDS                                        *
000010*   RECORD SIZE = 450  RECFORM = FIXED                           *
000011*                                                                *
000012*   BASE CLUSTER = ELCERT                         RKP=2,LEN=33   *
000013*       ALTERNATE PATH1 = ELCERT2 (BY NAME)       RKP=35,LEN=18  *
000014*       ALTERNATE PATH2 = ELCERT3 (BY SOC SEC NO) RKP=53,LEN=12  *
000015*       ALTERNATE PATH3 = ELCERT5 (BY CERT NO.)   RKP=65,LEN=12  *
000016*       ALTERNATE PATH4 = ELCERT6 (BY MEMBER NO.) RKP=77,LEN=13  *
000017*                                                                *
000018*   LOG = YES                                                    *
000019*   SERVREQ = BROWSE, DELETE, UPDATE, NEWREC                     *
000020******************************************************************
000021*                   C H A N G E   L O G
000022*
000023* CHANGES ARE MARKED BY THE CHANGE EFFECTIVE DATE.
000024*-----------------------------------------------------------------
000025*  CHANGE   CHANGE REQUEST PGMR  DESCRIPTION OF CHANGE
000026* EFFECTIVE    NUMBER
000027*-----------------------------------------------------------------
000028* 122002                   PEMA  ADD MONTHLY PRODUCT PROCESSING
000029* 040504  CR2003080800002  PEMA  ADD DEALER INCENTIVE PROCESSING
000030* 061405  CR2005060300001  PEMA  ADD CLP STATE PROCESS FOR DCC
000031* 110105    2005071200004  PEMA  INCREASE SIZE OF LOAN OFFICER
000032* 072308  CR2007110500003  PEMA  ADD NH REFUND INTEREST PROCESSING
000033* 102109  CR2008100900003  AJRA  ADD CLAIM CERT NOTE IND
000034* 011410  CR2009050700003  PEMA  ADD SPP DEALER DIRECT
000035* 032612  CR2011110200001  PEMA  AHL CHANGES
000036* 090314  CR2014081300001  PEMA  LOAD CERTS INVOLVED IN THAO
000037* 010716  CR2015082500001  PEMA CHG POLICY FEE TO CANCEL FEE
000038* 062017  CR2015091000001  PEMA RENAME INTEREST FIELD
000039******************************************************************
000040
000041 01  CERTIFICATE-MASTER.
000042     12  CM-RECORD-ID                      PIC XX.
000043         88  VALID-CM-ID                      VALUE 'CM'.
000044
000045     12  CM-CONTROL-PRIMARY.
000046         16  CM-COMPANY-CD                 PIC X.
000047         16  CM-CARRIER                    PIC X.
000048         16  CM-GROUPING.
000049             20  CM-GROUPING-PREFIX        PIC X(3).
000050             20  CM-GROUPING-PRIME         PIC X(3).
000051         16  CM-STATE                      PIC XX.
000052         16  CM-ACCOUNT.
000053             20  CM-ACCOUNT-PREFIX         PIC X(4).
000054             20  CM-ACCOUNT-PRIME          PIC X(6).
000055         16  CM-CERT-EFF-DT                PIC XX.
000056         16  CM-CERT-NO.
000057             20  CM-CERT-PRIME             PIC X(10).
000058             20  CM-CERT-SFX               PIC X.
000059
000060     12  CM-CONTROL-BY-NAME.
000061         16  CM-COMPANY-CD-A1              PIC X.
000062         16  CM-INSURED-LAST-NAME          PIC X(15).
000063         16  CM-INSURED-INITIALS.
000064             20  CM-INSURED-INITIAL1       PIC X.
000065             20  CM-INSURED-INITIAL2       PIC X.
000066
000067     12  CM-CONTROL-BY-SSN.
000068         16  CM-COMPANY-CD-A2              PIC X.
000069         16  CM-SOC-SEC-NO.
000070             20  CM-SSN-STATE              PIC XX.
000071             20  CM-SSN-ACCOUNT            PIC X(6).
000072             20  CM-SSN-LN3.
000073                 25  CM-INSURED-INITIALS-A2.
000074                     30 CM-INSURED-INITIAL1-A2   PIC X.
000075                     30 CM-INSURED-INITIAL2-A2   PIC X.
000076                 25 CM-PART-LAST-NAME-A2         PIC X.
000077
000078     12  CM-CONTROL-BY-CERT-NO.
000079         16  CM-COMPANY-CD-A4              PIC X.
000080         16  CM-CERT-NO-A4                 PIC X(11).
000081
000082     12  CM-CONTROL-BY-MEMB.
000083         16  CM-COMPANY-CD-A5              PIC X.
000084         16  CM-MEMBER-NO.
000085             20  CM-MEMB-STATE             PIC XX.
000086             20  CM-MEMB-ACCOUNT           PIC X(6).
000087             20  CM-MEMB-LN4.
000088                 25  CM-INSURED-INITIALS-A5.
000089                     30 CM-INSURED-INITIAL1-A5   PIC X.
000090                     30 CM-INSURED-INITIAL2-A5   PIC X.
000091                 25 CM-PART-LAST-NAME-A5         PIC XX.
000092
000093     12  CM-INSURED-PROFILE-DATA.
000094         16  CM-INSURED-FIRST-NAME.
000095             20  CM-INSURED-1ST-INIT       PIC X.
000096             20  FILLER                    PIC X(9).
000097         16  CM-INSURED-ISSUE-AGE          PIC 99.
000098         16  CM-INSURED-SEX                PIC X.
000099             88  CM-SEX-MALE                  VALUE 'M'.
000100             88  CM-SEX-FEMAL                 VALUE 'F'.
000101         16  CM-INSURED-JOINT-AGE          PIC 99.
000102         16  CM-JOINT-INSURED-NAME.
000103             20  CM-JT-LAST-NAME           PIC X(15).
000104             20  CM-JT-FIRST-NAME.
000105                 24  CM-JT-1ST-INIT        PIC X.
000106                 24  FILLER                PIC X(9).
000107             20  CM-JT-INITIAL             PIC X.
000108
000109     12  CM-LIFE-DATA.
000110         16  CM-LF-BENEFIT-CD              PIC XX.
000111         16  CM-LF-ORIG-TERM               PIC S999      COMP-3.
000112         16  CM-LF-CRITICAL-PERIOD         PIC S999      COMP-3.
000113         16  CM-LF-TERM-IN-DAYS            PIC S9(5)     COMP-3.
000114         16  CM-LF-DEV-CODE                PIC XXX.
000115         16  CM-LF-DEV-PCT                 PIC S9V9(6)   COMP-3.
000116         16  CM-LF-BENEFIT-AMT             PIC S9(9)V99  COMP-3.
000117         16  CM-LF-PREMIUM-AMT             PIC S9(7)V99  COMP-3.
000118         16  CM-LF-ALT-BENEFIT-AMT         PIC S9(9)V99  COMP-3.
000119         16  CM-LF-ALT-PREMIUM-AMT         PIC S9(7)V99  COMP-3.
000120         16  CM-LF-NSP-PREMIUM-AMT         PIC S9(7)V99  COMP-3.
000121         16  CM-LF-REMAINING-AMT           PIC S9(9)V99  COMP-3.
000122         16  CM-LF-ITD-CANCEL-AMT          PIC S9(7)V99  COMP-3.
000123         16  CM-LF-ITD-DEATH-AMT           PIC S9(9)V99  COMP-3.
000124         16  CM-LF-PREMIUM-RATE            PIC S99V9(5)  COMP-3.
000125         16  CM-LF-POLICY-FEE              PIC S9(3)V99  COMP-3.
000126         16  CM-LF-ALT-PREMIUM-RATE        PIC S99V9(5)  COMP-3.
000127         16  cm-temp-epiq                  pic xx.
000128             88  EPIQ-CLASS                  value 'EQ'.
000129*        16  FILLER                        PIC XX.
000130
000131     12  CM-AH-DATA.
000132         16  CM-AH-BENEFIT-CD              PIC XX.
000133         16  CM-AH-ORIG-TERM               PIC S999      COMP-3.
000134         16  CM-AH-CRITICAL-PERIOD         PIC S999      COMP-3.
000135         16  CM-AH-DEV-CODE                PIC XXX.
000136         16  CM-AH-DEV-PCT                 PIC S9V9(6)   COMP-3.
000137         16  CM-AH-BENEFIT-AMT             PIC S9(7)V99  COMP-3.
000138         16  CM-AH-PREMIUM-AMT             PIC S9(7)V99  COMP-3.
000139         16  CM-AH-NSP-PREMIUM-AMT         PIC S9(7)V99  COMP-3.
000140         16  CM-AH-ITD-CANCEL-AMT          PIC S9(7)V99  COMP-3.
000141         16  CM-AH-ITD-LUMP-PMT            PIC S9(7)V99  COMP-3.
000142         16  CM-AH-ITD-AH-PMT              PIC S9(9)V99  COMP-3.
000143         16  CM-AH-PAID-THRU-DT            PIC XX.
000144             88  NO-AH-CLAIMS-PAID            VALUE LOW-VALUE.
000145         16  CM-AH-PREMIUM-RATE            PIC S99V9(5)  COMP-3.
000146         16  CM-CANCEL-FEE                 PIC S9(3)V99  COMP-3.
000147         16  CM-AH-CEDED-BENEFIT           PIC S9(7)V99  COMP-3.
000148         16  FILLER                        PIC X.
000149
000150     12  CM-LOAN-INFORMATION.
000151         16  CM-LIVES                      PIC S9(7)     COMP-3.
000152         16  CM-DDF-IU-RATE-UP REDEFINES CM-LIVES
000153                                           PIC S9(5)V99  COMP-3.
000154         16  CM-BILLED                     PIC S9(7)     COMP-3.
000155         16  CM-LOAN-APR                   PIC S999V9(4) COMP-3.
000156         16  CM-PAY-FREQUENCY              PIC S99.
000157         16  CM-LOAN-TERM                  PIC S999      COMP-3.
000158         16  CM-RATE-CLASS                 PIC XX.
000159         16  CM-BENEFICIARY                PIC X(25).
000160         16  CM-POLICY-FORM-NO             PIC X(12).
000161         16  CM-PMT-EXTENSION-DAYS         PIC S999      COMP-3.
000162         16  CM-LAST-ADD-ON-DT             PIC XX.
000163         16  CM-DEDUCTIBLE-AMOUNTS.
000164             20  CM-CLAIM-DEDUCT-WITHHELD  PIC S9(5)V99  COMP-3.
000165             20  CM-CANCEL-DEDUCT-WITHHELD PIC S9(5)V99  COMP-3.
000166         16  CM-RESIDENT-RATE REDEFINES CM-DEDUCTIBLE-AMOUNTS.
000167             20  CM-RESIDENT-STATE         PIC XX.
000168             20  CM-RATE-CODE              PIC X(4).
000169             20  FILLER                    PIC XX.
000170         16  FILLER REDEFINES CM-DEDUCTIBLE-AMOUNTS.
000171             20  CM-LOAN-OFFICER           PIC X(5).
000172             20  FILLER                    PIC XXX.
000173         16  CM-CSR-CODE                   PIC XXX.
000174         16  CM-UNDERWRITING-CODE          PIC X.
000175             88  CM-POLICY-UNDERWRITTEN       VALUE 'Y'.
000176         16  CM-POST-CARD-IND              PIC X.
000177         16  CM-REF-INTERFACE-SW           PIC X.
000178         16  CM-PREMIUM-TYPE               PIC X.
000179             88  CM-SING-PRM                  VALUE '1'.
000180             88  CM-O-B-COVERAGE              VALUE '2'.
000181             88  CM-OPEN-END                  VALUE '3'.
000182         16  CM-IND-GRP-TYPE               PIC X.
000183             88  CM-INDIVIDUAL                VALUE 'I'.
000184             88  CM-GROUP                     VALUE 'G'.
000185         16  CM-SKIP-CODE                  PIC X.
000186             88  NO-MONTHS-SKIPPED            VALUE SPACE.
000187             88  SKIP-JULY                    VALUE '1'.
000188             88  SKIP-AUGUST                  VALUE '2'.
000189             88  SKIP-SEPTEMBER               VALUE '3'.
000190             88  SKIP-JULY-AUG                VALUE '4'.
000191             88  SKIP-AUG-SEPT                VALUE '5'.
000192             88  SKIP-JULY-AUG-SEPT           VALUE '6'.
000193             88  SKIP-JUNE-JULY-AUG           VALUE '7'.
000194             88  SKIP-JUNE                    VALUE '8'.
000195             88  SKIP-JUNE-JULY               VALUE '9'.
000196             88  SKIP-AUG-SEPT-OCT            VALUE 'A'.
000197             88  SKIP-BI-WEEKLY-3RD-PMT       VALUE 'X'.
000198         16  CM-PAYMENT-MODE               PIC X.
000199             88  PAY-MONTHLY                  VALUE SPACE.
000200             88  PAY-WEEKLY                   VALUE '1'.
000201             88  PAY-SEMI-MONTHLY             VALUE '2'.
000202             88  PAY-BI-WEEKLY                VALUE '3'.
000203             88  PAY-SEMI-ANUALLY             VALUE '4'.
000204         16  CM-LOAN-NUMBER                PIC X(8).
000205         16  CM-LOAN-BALANCE               PIC S9(7)V99  COMP-3.
000206         16  CM-OLD-LOF                    PIC XXX.
000207*        16  CM-LOAN-OFFICER               PIC XXX.
000208         16  CM-REIN-TABLE                 PIC XXX.
000209         16  CM-SPECIAL-REIN-CODE          PIC X.
000210         16  CM-LF-LOAN-EXPIRE-DT          PIC XX.
000211         16  CM-AH-LOAN-EXPIRE-DT          PIC XX.
000212         16  CM-LOAN-1ST-PMT-DT            PIC XX.
000213
000214     12  CM-STATUS-DATA.
000215         16  CM-ENTRY-STATUS               PIC X.
000216         16  CM-ENTRY-DT                   PIC XX.
000217
000218         16  CM-LF-STATUS-AT-CANCEL        PIC X.
000219         16  CM-LF-CANCEL-DT               PIC XX.
000220         16  CM-LF-CANCEL-EXIT-DT          PIC XX.
000221
000222         16  CM-LF-STATUS-AT-DEATH         PIC X.
000223         16  CM-LF-DEATH-DT                PIC XX.
000224         16  CM-LF-DEATH-EXIT-DT           PIC XX.
000225
000226         16  CM-LF-CURRENT-STATUS          PIC X.
000227             88  CM-LF-POLICY-IS-ACTIVE       VALUE '1' '2' '3'
000228                                                'M' '4' '5' '9'.
000229             88  CM-LF-NORMAL-ENTRY           VALUE '1'.
000230             88  CM-LF-POLICY-PENDING         VALUE '2'.
000231             88  CM-LF-POLICY-IS-RESTORE      VALUE '3'.
000232             88  CM-LF-CONVERSION-ENTRY       VALUE '4'.
000233             88  CM-LF-POLICY-IS-REISSUE      VALUE '5'.
000234             88  CM-LF-POLICY-IS-CASH         VALUE 'C'.
000235             88  CM-LF-POLICY-IS-MONTHLY      VALUE 'M'.
000236             88  CM-LF-LUMP-SUM-DISAB         VALUE '6'.
000237             88  CM-LF-DEATH-CLAIM-APPLIED    VALUE '7'.
000238             88  CM-LF-CANCEL-APPLIED         VALUE '8'.
000239             88  CM-LF-IS-REIN-ONLY           VALUE '9'.
000240             88  CM-LF-DECLINED               VALUE 'D'.
000241             88  CM-LF-VOIDED                 VALUE 'V'.
000242
000243         16  CM-AH-STATUS-AT-CANCEL        PIC X.
000244         16  CM-AH-CANCEL-DT               PIC XX.
000245         16  CM-AH-CANCEL-EXIT-DT          PIC XX.
000246
000247         16  CM-AH-STATUS-AT-SETTLEMENT    PIC X.
000248         16  CM-AH-SETTLEMENT-DT           PIC XX.
000249         16  CM-AH-SETTLEMENT-EXIT-DT      PIC XX.
000250
000251         16  CM-AH-CURRENT-STATUS          PIC X.
000252             88  CM-AH-POLICY-IS-ACTIVE       VALUE '1' '2' '3'
000253                                                'M' '4' '5' '9'.
000254             88  CM-AH-NORMAL-ENTRY           VALUE '1'.
000255             88  CM-AH-POLICY-PENDING         VALUE '2'.
000256             88  CM-AH-POLICY-IS-RESTORE      VALUE '3'.
000257             88  CM-AH-CONVERSION-ENTRY       VALUE '4'.
000258             88  CM-AH-POLICY-IS-REISSUE      VALUE '5'.
000259             88  CM-AH-POLICY-IS-CASH         VALUE 'C'.
000260             88  CM-AH-POLICY-IS-MONTHLY      VALUE 'M'.
000261             88  CM-AH-LUMP-SUM-DISAB         VALUE '6'.
000262             88  CM-AH-DEATH-CLAIM-APPLIED    VALUE '7'.
000263             88  CM-AH-CANCEL-APPLIED         VALUE '8'.
000264             88  CM-AH-IS-REIN-ONLY           VALUE '9'.
000265             88  CM-AH-DECLINED               VALUE 'D'.
000266             88  CM-AH-VOIDED                 VALUE 'V'.
000267
000268         16  CM-CLAIM-INTERFACE-SW         PIC X.
000269             88  NO-CLAIM-ATTACHED            VALUE SPACE.
000270             88  CERT-AND-CLAIM-ONLINE        VALUE '1'.
000271             88  CERT-WAS-CREATED-FOR-CLAIM   VALUE '2'.
000272         16  CM-CLAIM-ATTACHED-COUNT       PIC S9(4)     COMP.
000273
000274         16  CM-ENTRY-BATCH                PIC X(6).
000275         16  CM-LF-EXIT-BATCH              PIC X(6).
000276         16  CM-AH-EXIT-BATCH              PIC X(6).
000277         16  CM-LAST-MONTH-END             PIC XX.
000278
000279     12  CM-NOTE-SW                        PIC X.
000280         88  CERT-NOTES-ARE-NOT-PRESENT       VALUE ' '.
000281         88  CERT-NOTES-PRESENT               VALUE '1'.
000282         88  BILLING-NOTES-PRESENT            VALUE '2'.
000283         88  CERT-BILLING-NOTES-PRESENT       VALUE '3'.
000284         88  CLAIM-NOTES-PRESENT              VALUE '4'.
000285         88  CLAIM-CERT-NOTES-PRESENT         VALUE '5'.
000286         88  CLAIM-BILLING-NOTES-PRESENT      VALUE '6'.
000287         88  CLAIM-CERT-BILL-NOTES-PRESENT    VALUE '7'.
000288     12  CM-COMP-EXCP-SW                   PIC X.
000289         88  COMPENSATION-SAME-AS-ACCT        VALUE ' '.
000290         88  THIS-CERT-HAS-ERCOMM-ENTRY       VALUE '1'.
000291     12  CM-INSURED-ADDRESS-SW             PIC X.
000292         88  INSURED-ADDR-NOT-PRESENT         VALUE ' '.
000293         88  INSURED-ADDR-PRESENT             VALUE '1'.
000294
000295*    12  CM-LF-CEDED-BENEFIT               PIC S9(7)V99   COMP-3.
000296     12  CM-LF-CLP                         PIC S9(5)V99   COMP-3.
000297     12  FILLER                            PIC X.
000298
000299*    12  CM-ISS-MICROFILM-NO               PIC S9(9)      COMP-3.
000300     12  CM-AH-CLP                         PIC S9(5)V99   COMP-3.
000301     12  FILLER                            PIC X.
000302*    12  CM-CAN-MICROFILM-NO               PIC S9(9)      COMP-3.
000303     12  CM-INT-ON-REFS                    PIC S9(7)V99   COMP-3.
000304
000305     12  CM-CREDIT-INTERFACE-SW-1          PIC X.
000306         88  CERT-ADDED-BATCH                 VALUE ' '.
000307         88  CERT-ADDED-ONLINE                VALUE '1'.
000308         88  CERT-PEND-ISSUE-ERROR            VALUE '2'.
000309         88  CERT-PURGED-OFFLINE              VALUE '3'.
000310         88  CERT-PEND-ISSUE-RETURNED         VALUE '4'.
000311     12  CM-CREDIT-INTERFACE-SW-2          PIC X.
000312         88  CERT-AS-LOADED                   VALUE ' '.
000313         88  CERT-CANCELLED-ONLINE            VALUE '1'.
000314         88  CERT-CLAIM-ONLINE                VALUE '2'.
000315         88  CERT-CLAIM-CANCEL-ONLINE         VALUE '3'.
000316         88  CERT-PEND-CANCEL-ERROR           VALUE '4'.
000317         88  CERT-PEND-CANCEL-VOID            VALUE '5'.
000318         88  CERT-PEND-CAN-VOID-ERROR         VALUE '6'.
000319         88  CERT-PEND-CANCEL-RETURNED        VALUE '7'.
000320
000321     12  CM-ACCOUNT-COMM-PCTS.
000322         16  CM-LIFE-COMM-PCT              PIC SV9(5)    COMP-3.
000323         16  CM-AH-COMM-PCT                PIC SV9(5)    COMP-3.
000324
000325     12  CM-USER-FIELD                     PIC X.
000326     12  CM-ADDL-CLP                       PIC S9(5)V99  COMP-3.
000327     12  CM-CLP-STATE                      PIC XX.
000328     12  CM-LF-CLASS-CD REDEFINES CM-CLP-STATE PIC XX.
000329     12  CM-USER-RESERVED                  PIC XXX.
000330     12  FILLER REDEFINES CM-USER-RESERVED.
000331         16  CM-AH-CLASS-CD                PIC XX.
000332         16  F                             PIC X.
000333******************************************************************
      *<<((file: ELCCERT))
001023*                                COPY ERCACCT.
      *>>((file: ERCACCT))
000001******************************************************************
000002*                                                                *
000003*                                                                *
000004*                            ERCACCT                             *
000005*           COPYBOOK REVIEWED FOR YEAR 2000 COMPLIANCE
000006*                            VMOD=2.031                          *
000007*                                                                *
000008*   CREDIT SYSTEM ACCOUNT MASTER FILE                            *
000009*                                                                *
000010*   THIS COPYBOOK IS USED FOR BOTH THE ONLINE AND BATCH          *
000011*   VSAM ACCOUNT MASTER FILES.                                   *
000012*                                                                *
000013*   FILE DESCRIPTION = ACCOUNT OR PRODUCER FILES                 *
000014*                                                                *
000015*   FILE TYPE = VSAM,KSDS                                        *
000016*   RECORD SIZE = 2000  RECFORM = FIX                            *
000017*                                                                *
000018*   BASE CLUSTER NAME = ERACCT                    RKP=2,LEN=26   *
000019*       ALTERNATE PATH1 = ERACCT2 (ALT GROUPING) RKP=28,LEN=26   *
000020*                                                                *
000021*   LOG = NO                                                     *
000022*   SERVREQ = BROWSE, DELETE, UPDATE, NEWREC                     *
000023*                                                                *
000024*                                                                *
000025******************************************************************
000026*                   C H A N G E   L O G
000027*
000028* CHANGES ARE MARKED BY THE CHANGE EFFECTIVE DATE.
000029*-----------------------------------------------------------------
000030*  CHANGE   CHANGE REQUEST PGMR  DESCRIPTION OF CHANGE
000031* EFFECTIVE    NUMBER
000032*-----------------------------------------------------------------
000033* 102004    2003031400002  PEMA  ADD NEW STATUS CODE
000034* 092705    2005050300006  PEMA  ADD SPP LEASES
000035* 022808    2007083100002  PEMA  ADD FREEZE STATUS
000036* 011410  CR2009050700003  PEMA  ADD SPP DEALER DIRECT
000037* 030211  CR2010012100001  PEMA  ADD EMAILS FROM RDS
000038* 031811  CR2011012700001  PEMA  ADD ACCT STATUS S - SUSPENDED
000039* 101711  CR2011092000001  PEMA  ADD UNEARNED FACTOR STATE FOR DCC
000040* 021916  CR2014010900001  TANA  ADD NEW STATUS CODE VALUES
000041******************************************************************
000042
000043 01  ACCOUNT-MASTER.
000044     12  AM-RECORD-ID                      PIC XX.
000045         88  VALID-AM-ID                      VALUE 'AM'.
000046
000047     12  AM-CONTROL-PRIMARY.
000048         16  AM-COMPANY-CD                 PIC X.
000049         16  AM-MSTR-CNTRL.
000050             20  AM-CONTROL-A.
000051                 24  AM-CARRIER            PIC X.
000052                 24  AM-GROUPING.
000053                     28 AM-GROUPING-PREFIX PIC XXX.
000054                     28 AM-GROUPING-PRIME  PIC XXX.
000055                 24  AM-STATE              PIC XX.
000056                 24  AM-ACCOUNT.
000057                     28  AM-ACCOUNT-PREFIX PIC X(4).
000058                     28  AM-ACCOUNT-PRIME  PIC X(6).
000059             20  AM-CNTRL-1   REDEFINES   AM-CONTROL-A
000060                                           PIC X(19).
000061             20  AM-CNTRL-B.
000062                 24  AM-EXPIRATION-DT      PIC XX.
000063                 24  FILLER                PIC X(4).
000064             20  AM-CNTRL-2 REDEFINES AM-CNTRL-B.
000065                 24  AM-EXPIRE-DT          PIC 9(11)  COMP-3.
000066
000067     12  AM-CONTROL-BY-VAR-GRP.
000068         16  AM-COMPANY-CD-A1              PIC X.
000069         16  AM-VG-CARRIER                 PIC X.
000070         16  AM-VG-GROUPING                PIC X(6).
000071         16  AM-VG-STATE                   PIC XX.
000072         16  AM-VG-ACCOUNT                 PIC X(10).
000073         16  AM-VG-DATE.
000074             20  AM-VG-EXPIRATION-DT       PIC XX.
000075             20  FILLER                    PIC X(4).
000076         16  AM-VG-EXP-DATE REDEFINES AM-VG-DATE
000077                                           PIC 9(11)      COMP-3.
000078     12  FILLER REDEFINES AM-CONTROL-BY-VAR-GRP.
000079         16  FILLER                        PIC X(10).
000080         16  AM-VG-KEY3.
000081             20  AM-VG3-ACCOUNT            PIC X(10).
000082             20  AM-VG3-EXP-DT             PIC XX.
000083         16  FILLER                        PIC X(4).
000084     12  AM-MAINT-INFORMATION.
000085         16  AM-LAST-MAINT-DT              PIC XX.
000086         16  AM-LAST-MAINT-HHMMSS          PIC S9(7)      COMP-3.
000087         16  AM-LAST-MAINT-USER            PIC X(4).
000088         16  FILLER                        PIC XX.
000089
000090     12  AM-EFFECTIVE-DT                   PIC XX.
000091     12  AM-EFFECT-DT                      PIC 9(11)      COMP-3.
000092
000093     12  AM-PREV-DATES  COMP-3.
000094         16  AM-PREV-EXP-DT                PIC 9(11).
000095         16  AM-PREV-EFF-DT                PIC 9(11).
000096
000097     12  AM-REPORT-CODE-1                  PIC X(10).
000098     12  AM-REPORT-CODE-2                  PIC X(10).
000099
000100     12  AM-CITY-CODE                      PIC X(4).
000101     12  AM-COUNTY-PARISH                  PIC X(6).
000102
000103     12  AM-NAME                           PIC X(30).
000104     12  AM-PERSON                         PIC X(30).
000105     12  AM-ADDRS                          PIC X(30).
000106     12  AM-CITY.
000107         16  AM-ADDR-CITY                  PIC X(28).
000108         16  AM-ADDR-STATE                 PIC XX.
000109     12  AM-ZIP.
000110         16  AM-ZIP-PRIME.
000111             20  AM-ZIP-PRI-1ST            PIC X.
000112                 88  AM-CANADIAN-POST-CODE    VALUE 'A' THRU 'Z'.
000113             20  FILLER                    PIC X(4).
000114         16  AM-ZIP-PLUS4                  PIC X(4).
000115     12  AM-CANADIAN-POSTAL-CODE  REDEFINES  AM-ZIP.
000116         16  AM-CAN-POSTAL-1               PIC XXX.
000117         16  AM-CAN-POSTAL-2               PIC XXX.
000118         16  FILLER                        PIC XXX.
000119     12  AM-TEL-NO.
000120         16  AM-AREA-CODE                  PIC 999.
000121         16  AM-TEL-PRE                    PIC 999.
000122         16  AM-TEL-NBR                    PIC 9(4).
000123     12  AM-TEL-LOC                        PIC X.
000124         88  AM-TEL-AT-HOME                   VALUE 'H'.
000125         88  AM-TEL-AT-BUSINESS               VALUE 'B'.
000126
000127     12  AM-COMM-STRUCTURE.
000128         16  AM-DEFN-1.
000129             20  AM-AGT-COMMS       OCCURS 10 TIMES.
000130                 24  AM-AGT.
000131                     28  AM-AGT-PREFIX     PIC X(4).
000132                     28  AM-AGT-PRIME      PIC X(6).
000133                 24  AM-COM-TYP            PIC X.
000134                 24  AM-L-COM              PIC SV9(5)     COMP-3.
000135                 24  AM-J-COM              PIC SV9(5)     COMP-3.
000136                 24  AM-A-COM              PIC SV9(5)     COMP-3.
000137                 24  AM-RECALC-LV-INDIC    PIC X.
000138                 24  AM-RETRO-LV-INDIC     PIC X.
000139                 24  AM-GL-CODES           PIC X.
000140                 24  AM-COMM-CHARGEBACK    PIC 9(02).
000141                 24  FILLER                PIC X(01).
000142         16  AM-DEFN-2   REDEFINES   AM-DEFN-1.
000143             20  AM-COM-TBLS        OCCURS 10 TIMES.
000144                 24  FILLER                PIC X(11).
000145                 24  AM-L-COMA             PIC XXX.
000146                 24  AM-J-COMA             PIC XXX.
000147                 24  AM-A-COMA             PIC XXX.
000148                 24  FILLER                PIC X(6).
000149
000150     12  AM-COMM-CHANGE-STATUS             PIC X.
000151         88  AM-COMMISSIONS-CHANGED           VALUE '*'.
000152
000153     12  AM-CSR-CODE                       PIC X(4).
000154
000155     12  AM-BILLING-STATUS                 PIC X.
000156         88  AM-ACCOUNT-BILLED                VALUE 'B'.
000157         88  AM-ACCOUNT-NOT-BILLED            VALUE ' '.
000158     12  AM-AUTO-REFUND-SW                 PIC X.
000159         88  AUTO-REFUNDS-USED                VALUE 'Y'.
000160         88  AUTO-REFUNDS-NOT-USED            VALUE 'N' ' '.
000161     12  AM-GPCD                           PIC 99.
000162     12  AM-IG                             PIC X.
000163         88  AM-HAS-INDIVIDUAL                VALUE '1'.
000164         88  AM-HAS-GROUP                     VALUE '2'.
000165     12  AM-STATUS                         PIC X.
000166         88  AM-ACCOUNT-ACTIVE                VALUE '0'.
000167         88  AM-ACCOUNT-INACTIVE              VALUE '1'.
000168         88  AM-ACCOUNT-TRANSFERRED           VALUE '2'.
000169         88  AM-ACCOUNT-CANCELLED             VALUE '3'.
000170         88  AM-ACCOUNT-FROZEN                VALUE '4'.
000171         88  AM-ACCOUNT-SUSPENDED             VALUE '5'.
000172         88  AM-ACCOUNT-DROPPED               VALUE '6'.
000173         88  AM-ACCOUNT-LAPSED                VALUE '7'.
000174         88  AM-ACCOUNT-RUN-OFF               VALUE '8'.
000175         88  AM-ACCOUNT-PENDING               VALUE '9'.
000176     12  AM-REMIT-TO                       PIC 99.
000177     12  AM-ID-NO                          PIC X(11).
000178
000179     12  AM-CAL-TABLE                      PIC XX.
000180     12  AM-LF-DEVIATION                   PIC XXX.
000181     12  AM-AH-DEVIATION                   PIC XXX.
000182     12  AM-LF-DEVIATION-PCT               PIC S9V9(6)    COMP-3.
000183     12  AM-AH-DEVIATION-PCT               PIC S9V9(6)    COMP-3.
000184     12  AM-LF-OB-RATE                     PIC S99V9(5)   COMP-3.
000185     12  AM-AH-OB-RATE                     PIC S99V9(5)   COMP-3.
000186     12  AM-LF-OB-RATE-JNT                 PIC S99V9(5)   COMP-3.
000187     12  AM-AH-OB-RATE-JNT                 PIC S99V9(5)   COMP-3.
000188
000189     12  AM-USER-FIELDS.
000190         16  AM-FLD-1                      PIC XX.
000191         16  AM-FLD-2                      PIC XX.
000192         16  AM-FLD-3                      PIC XX.
000193         16  AM-FLD-4                      PIC XX.
000194         16  AM-FLD-5                      PIC XX.
000195
000196     12  AM-1ST-PROD-DATE.
000197         16  AM-1ST-PROD-YR                PIC XX.
000198         16  AM-1ST-PROD-MO                PIC XX.
000199         16  AM-1ST-PROD-DA                PIC XX.
000200     12  AM-ANNIVERSARY-DATE               PIC 9(11)  COMP-3.
000201     12  AM-CERTS-PURGED-DATE.
000202         16  AM-PUR-YR                     PIC XX.
000203         16  AM-PUR-MO                     PIC XX.
000204         16  AM-PUR-DA                     PIC XX.
000205     12  AM-HI-CERT-DATE                   PIC 9(11)  COMP-3.
000206     12  AM-LO-CERT-DATE                   PIC 9(11)  COMP-3.
000207     12  AM-ENTRY-DATE                     PIC 9(11)  COMP-3.
000208     12  AM-INACTIVE-DATE.
000209         16  AM-INA-MO                     PIC 99.
000210         16  AM-INA-DA                     PIC 99.
000211         16  AM-INA-YR                     PIC 99.
000212     12  AM-AR-HI-CERT-DATE                PIC XX.
000213
000214     12  AM-LF-PSI-FACTOR                  PIC S9V9(6)    COMP-3.
000215     12  AM-AH-PSI-FACTOR                  PIC S9V9(6)    COMP-3.
000216
000217     12  AM-OB-PAYMENT-MODE                PIC X.
000218         88  AM-OB-PAID-MONTHLY               VALUE 'M' ' '.
000219         88  AM-OB-PAID-QUARTERLY             VALUE 'Q'.
000220         88  AM-OB-PAID-SEMI-ANNUALLY         VALUE 'S'.
000221         88  AM-OB-PAID-ANNUALLY              VALUE 'A'.
000222
000223     12  AM-AH-ONLY-INDICATOR              PIC X.
000224         88  AM-AH-ONLY-ALLOWED               VALUE 'Y' ' '.
000225         88  AM-NO-AH-ONLY                    VALUE 'N'.
000226
000227     12  AM-EDIT-LOAN-OFC                  PIC X(01).
000228
000229     12  AM-OVER-SHORT.
000230         16 AM-OVR-SHT-AMT                 PIC S999V99    COMP-3.
000231         16 AM-OVR-SHT-PCT                 PIC S9V9(4)    COMP-3.
000232
000233     12  AM-DCC-PRODUCT-CODE               PIC XXX.
000234     12  AM-DCC-CLP-STATE                  PIC XX.
000235
000236     12  AM-RECALC-COMM                    PIC X.
000237     12  AM-RECALC-REIN                    PIC X.
000238
000239     12  AM-REI-TABLE                      PIC XXX.
000240     12  AM-REI-ET-LF                      PIC X.
000241     12  AM-REI-ET-AH                      PIC X.
000242     12  AM-REI-PE-LF                      PIC X.
000243     12  AM-REI-PE-AH                      PIC X.
000244     12  AM-REI-PRT-ST                     PIC X.
000245     12  AM-REI-FEE-LF                     PIC S9V9999    COMP-3.
000246     12  AM-REI-FEE-AH                     PIC S9V9999    COMP-3.
000247     12  AM-REI-LF-TAX                     PIC S9V9999    COMP-3.
000248     12  AM-REI-GROUP-A                    PIC X(6).
000249     12  AM-REI-MORT                       PIC X(4).
000250     12  AM-REI-PRT-OW                     PIC X.
000251     12  AM-REI-PR-PCT                     PIC S9V9999    COMP-3.
000252     12  AM-REI-78-PCT                     PIC S9V9999    COMP-3.
000253     12  AM-REI-AH-TAX                     PIC S9V9999    COMP-3.
000254     12  AM-REI-GROUP-B                    PIC X(6).
000255
000256     12  AM-TRUST-TYPE                     PIC X(2).
000257
000258     12  AM-EMPLOYER-STMT-USED             PIC X.
000259     12  AM-GROUPED-CHECKS-Y-N             PIC X.
000260
000261     12  AM-STD-AH-TYPE                    PIC XX.
000262     12  AM-EARN-METHODS.
000263         16  AM-EARN-METHOD-R              PIC X.
000264             88 AM-REF-RL-R78                 VALUE 'R'.
000265             88 AM-REF-RL-PR                  VALUE 'P'.
000266             88 AM-REF-RL-MEAN                VALUE 'M'.
000267             88 AM-REF-RL-ANTICIPATION        VALUE 'A'.
000268         16  AM-EARN-METHOD-L              PIC X.
000269             88 AM-REF-LL-R78                 VALUE 'R'.
000270             88 AM-REF-LL-PR                  VALUE 'P'.
000271             88 AM-REF-LL-MEAN                VALUE 'M'.
000272             88 AM-REF-LL-ANTICIPATION        VALUE 'A'.
000273         16  AM-EARN-METHOD-A              PIC X.
000274             88 AM-REF-AH-R78                 VALUE 'R'.
000275             88 AM-REF-AH-PR                  VALUE 'P'.
000276             88 AM-REF-AH-MEAN                VALUE 'M'.
000277             88 AM-REF-AH-ANTICIPATION        VALUE 'A'.
000278             88 AM-REF-AH-CALIF-SPEC          VALUE 'C'.
000279             88 AM-REF-AH-NET                 VALUE 'N'.
000280
000281     12  AM-TOL-PREM                       PIC S999V99    COMP-3.
000282     12  AM-TOL-REF                        PIC S999V99    COMP-3.
000283     12  AM-TOL-CLM                        PIC S999V99    COMP-3.
000284
000285     12  AM-RET-Y-N                        PIC X.
000286     12  AM-RET-P-E                        PIC X.
000287     12  AM-LF-RET                         PIC S9V9999    COMP-3.
000288     12  AM-AH-RET                         PIC S9V9999    COMP-3.
000289     12  AM-RET-GRP                        PIC X(6).
000290     12  AM-RETRO-POOL  REDEFINES  AM-RET-GRP.
000291         16  AM-POOL-PRIME                 PIC XXX.
000292         16  AM-POOL-SUB                   PIC XXX.
000293     12  AM-RETRO-EARNINGS.
000294         16  AM-RET-EARN-R                 PIC X.
000295         16  AM-RET-EARN-L                 PIC X.
000296         16  AM-RET-EARN-A                 PIC X.
000297     12  AM-RET-ST-TAX-USE                 PIC X.
000298         88  CHARGE-ST-TAXES-ON-RETRO         VALUE 'Y' 'E' 'P'.
000299         88  TAXES-NOT-IN-RETRO               VALUE 'N' ' '.
000300     12  AM-RETRO-BEG-EARNINGS.
000301         16  AM-RET-BEG-EARN-R             PIC X.
000302         16  AM-RET-BEG-EARN-L             PIC X.
000303         16  AM-RET-BEG-EARN-A             PIC X.
000304     12  AM-RET-MIN-LOSS-L                 PIC SV999      COMP-3.
000305     12  AM-RET-MIN-LOSS-A                 PIC SV999      COMP-3.
000306
000307     12  AM-USER-SELECT-OPTIONS.
000308         16  AM-USER-SELECT-1              PIC X(10).
000309         16  AM-USER-SELECT-2              PIC X(10).
000310         16  AM-USER-SELECT-3              PIC X(10).
000311         16  AM-USER-SELECT-4              PIC X(10).
000312         16  AM-USER-SELECT-5              PIC X(10).
000313
000314     12  AM-LF-RPT021-EXP-PCT              PIC S9(3)V9(4) COMP-3.
000315
000316     12  AM-AH-RPT021-EXP-PCT              PIC S9(3)V9(4) COMP-3.
000317
000318     12  AM-RPT045A-SWITCH                 PIC X.
000319         88  RPT045A-OFF                   VALUE 'N'.
000320
000321     12  AM-INSURANCE-LIMITS.
000322         16  AM-MAX-MON-BEN                PIC S9(7)      COMP-3.
000323         16  AM-MAX-TOT-BEN                PIC S9(7)      COMP-3.
000324
000325     12  AM-PROFILE-CHANGE-SWITCH          PIC X.
000326         88  AM-PROFILE-DATA-CHANGED          VALUE '*'.
000327
000328     12  AM-DISMBR-COVERAGE-SW             PIC X.
000329         88  AM-DISMBR-COVERAGE               VALUE 'Y'.
000330         88  AM-NO-DISMBR-COVERAGE            VALUE 'N'.
000331
000332     12  AM-CANCEL-FEE                     PIC S9(3)V9(2) COMP-3.
000333
000334     12  AM-TOL-REF-PCT                    PIC S9V9(4)    COMP-3.
000335     12  AM-CLP-TOL-PCT                    PIC S9V9(4)    COMP-3.
000336     12  AM-SPP-LEASE-COMM                 PIC S9(5)V99   COMP-3.
000337     12  AM-DCC-MAX-MARKETING-FEE          PIC S9(5)      COMP-3.
000338     12  AM-DCC-UEF-STATE                  PIC XX.
000339     12  FILLER                            PIC XXX.
000340     12  AM-REPORT-CODE-3                  PIC X(10).
000341*    12  FILLER                            PIC X(22).
000342
000343     12  AM-RESERVE-DATE.
000344         16  AM-TARGET-LOSS-RATIO          PIC S9V9(4) COMP-3.
000345         16  AM-LIFE-IBNR-PCT              PIC S9V9(4) COMP-3.
000346         16  AM-CRDT-MODIFICATION-PCT      PIC S9V9(4) COMP-3.
000347
000348     12  AM-3RD-PARTY-NOTIF-LEVEL          PIC 99.
000349     12  AM-NOTIFICATION-TYPES.
000350         16  AM-NOTIF-OF-LETTERS           PIC X.
000351         16  AM-NOTIF-OF-PAYMENTS          PIC X.
000352         16  AM-NOTIF-OF-REPORTS           PIC X.
000353         16  AM-NOTIF-OF-STATUS            PIC X.
000354
000355     12  AM-BENEFIT-TABLE-USAGE            PIC X.
000356         88  AM-BENEFIT-TABLE-USED            VALUE 'Y'.
000357         88  AM-USE-DEVIATIONS-ONLY           VALUE 'D'.
000358         88  AM-EDIT-BENEFITS-ONLY            VALUE 'E'.
000359         88  AM-EDITS-NOT-USED                VALUE ' '  'N'.
000360
000361     12  AM-BENEFIT-CONTROLS.
000362         16  AM-ALLOWABLE-BENEFITS  OCCURS  20  TIMES.
000363             20  AM-BENEFIT-CODE           PIC XX.
000364             20  AM-BENEFIT-TYPE           PIC X.
000365             20  AM-BENEFIT-REVISION       PIC XXX.
000366             20  AM-BENEFIT-REM-TERM       PIC X.
000367             20  AM-BENEFIT-RETRO-Y-N      PIC X.
000368             20  FILLER                    PIC XX.
000369         16  FILLER                        PIC X(80).
000370
000371     12  AM-TRANSFER-DATA.
000372         16  AM-TRANSFERRED-FROM.
000373             20  AM-TRNFROM-CARRIER        PIC X.
000374             20  AM-TRNFROM-GROUPING.
000375                 24  AM-TRNFROM-GRP-PREFIX PIC XXX.
000376                 24  AM-TRNFROM-GRP-PRIME  PIC XXX.
000377             20  AM-TRNFROM-STATE          PIC XX.
000378             20  AM-TRNFROM-ACCOUNT.
000379                 24  AM-TRNFROM-ACCT-PREFIX PIC X(4).
000380                 24  AM-TRNFROM-ACCT-PRIME PIC X(6).
000381             20  AM-TRNFROM-DTE            PIC XX.
000382         16  AM-TRANSFERRED-TO.
000383             20  AM-TRNTO-CARRIER          PIC X.
000384             20  AM-TRNTO-GROUPING.
000385                 24  AM-TRNTO-GRP-PREFIX   PIC XXX.
000386                 24  AM-TRNTO-GRP-PRIME    PIC XXX.
000387             20  AM-TRNTO-STATE            PIC XX.
000388             20  AM-TRNTO-ACCOUNT.
000389                 24  AM-TRNTO-ACCT-PREFIX  PIC X(4).
000390                 24  AM-TRNTO-ACCT-PRIME   PIC X(6).
000391             20  AM-TRNTO-DTE              PIC XX.
000392         16  FILLER                        PIC X(10).
000393
000394     12  AM-SAVED-REMIT-TO                 PIC 99.
000395
000396     12  AM-COMM-STRUCTURE-SAVED.
000397         16  AM-DEFN-1-SAVED.
000398             20  AM-AGT-COMMS-SAVED    OCCURS 10 TIMES.
000399                 24  AM-AGT-SV             PIC X(10).
000400                 24  AM-COM-TYP-SV         PIC X.
000401                 24  AM-L-COM-SV           PIC SV9(5)     COMP-3.
000402                 24  AM-J-COM-SV           PIC SV9(5)     COMP-3.
000403                 24  AM-A-COM-SV           PIC SV9(5)     COMP-3.
000404                 24  AM-RECALC-LV-INDIC-SV PIC X.
000405                 24  FILLER                PIC X.
000406                 24  AM-GL-CODES-SV        PIC X.
000407                 24  AM-COM-CHARGEBACK-SV  PIC 99.
000408                 24  FILLER                PIC X.
000409         16  AM-DEFN-2-SAVED   REDEFINES   AM-DEFN-1-SAVED.
000410             20  AM-COM-TBLS-SAVED    OCCURS 10 TIMES.
000411                 24  FILLER                PIC X(11).
000412                 24  AM-L-COMA-SV          PIC XXX.
000413                 24  AM-J-COMA-SV          PIC XXX.
000414                 24  AM-A-COMA-SV          PIC XXX.
000415                 24  FILLER                PIC X(6).
000416
000417     12  AM-FLC-NET-PREMIUM-ALLOWANCE.
000418         16 AM-ACCOUNT-ALLOWANCE OCCURS  5 TIMES.
000419            20  AM-ALLOW-BEGIN-RANGE       PIC S9(5)      COMP-3.
000420            20  AM-ALLOW-END-RANGE         PIC S9(5)      COMP-3.
000421            20  AM-ALLOWANCE-AMT           PIC S9(5)V99   COMP-3.
000422
000423     12  AM-ORIG-DEALER-NO                 PIC X(10).
000424     12  FILLER                            PIC X(120).
000425
000426     12  AM-ACCOUNT-EXECUTIVE-DATA.
000427         16  AM-CONTROL-NAME               PIC X(30).
000428         16  AM-EXECUTIVE-ONE.
000429             20  AM-EXEC1-NAME             PIC X(15).
000430             20  AM-EXEC1-DIS-PERCENT      PIC S9(01)V9(04)
000431                                                          COMP-3.
000432             20  AM-EXEC1-LIFE-PERCENT     PIC S9(01)V9(04)
000433                                                          COMP-3.
000434         16  AM-EXECUTIVE-TWO.
000435             20  AM-EXEC2-NAME             PIC X(15).
000436             20  AM-EXEC2-DIS-PERCENT      PIC S9(01)V9(04)
000437                                                          COMP-3.
000438             20  AM-EXEC2-LIFE-PERCENT     PIC S9(01)V9(04)
000439                                                          COMP-3.
000440
000441     12  AM-RETRO-ADDITIONAL-DATA.
000442         16  AM-RETRO-QUALIFY-LIMIT        PIC S9(7)      COMP-3.
000443         16  AM-RETRO-PREM-P-E             PIC X.
000444         16  AM-RETRO-CLMS-P-I             PIC X.
000445         16  AM-RETRO-RET-BRACKET-LF.
000446             20  AM-RETRO-RET-METHOD-LF    PIC X.
000447                 88  AM-RETRO-USE-PCT-LF      VALUE 'P' ' '.
000448                 88  AM-RETRO-USE-SCALE-LF    VALUE 'S'.
000449             20  AM-RETRO-RET-BASIS-LF     PIC X.
000450                 88  AM-RETRO-EARN-BASIS-LF   VALUE 'E' ' '.
000451                 88  AM-RETRO-PAID-BASIS-LF   VALUE 'P'.
000452             20  AM-RETRO-BRACKETS-LF  OCCURS  3 TIMES.
000453                 24  AM-RETRO-RET-PCT-LF   PIC S9V9999    COMP-3.
000454                 24  AM-RETRO-RET-THRU-LF  PIC S9(7)      COMP-3.
000455         16  AM-RETRO-RET-BRACKET-AH.
000456             20  AM-RETRO-RET-METHOD-AH    PIC X.
000457                 88  AM-RETRO-USE-PCT-AH      VALUE 'P' ' '.
000458                 88  AM-RETRO-USE-SCALE-AH    VALUE 'S'.
000459                 88  AM-RETRO-USE-LIFE-METHOD VALUE 'L'.
000460             20  AM-RETRO-RET-BASIS-AH     PIC X.
000461                 88  AM-RETRO-EARN-BASIS-AH   VALUE 'E' ' '.
000462                 88  AM-RETRO-PAID-BASIS-AH   VALUE 'P'.
000463             20  AM-RETRO-BRACKETS-AH  OCCURS  3 TIMES.
000464                 24  AM-RETRO-RET-PCT-AH   PIC S9V9999    COMP-3.
000465                 24  AM-RETRO-RET-THRU-AH  PIC S9(7)      COMP-3.
000466
000467     12  AM-COMMENTS.
000468         16  AM-COMMENT-LINE           PIC X(50)   OCCURS 5 TIMES.
000469
000470     12  AM-CLIENT-OVERLAY-FLI   REDEFINES   AM-COMMENTS.
000471         16  AM-FLI-RETRO-SHARE-CODE       PIC X.
000472         16  AM-FLI-BILLING-CODE           PIC X.
000473         16  AM-FLI-ALT-STATE-CODE         PIC XX.
000474         16  AM-FLI-UNITED-IDENT           PIC X.
000475         16  AM-FLI-INTEREST-LOST-DATA.
000476             20  AM-FLI-BANK-NO            PIC X(5).
000477             20  AM-FLI-BANK-BALANCE       PIC S9(9)V99   COMP-3.
000478             20  AM-FLI-BANK-1ST-6-PREM    PIC S9(9)V99   COMP-3.
000479             20  AM-FLI-BANK-CAP-AMT       PIC S9(9)V99   COMP-3.
000480         16  AM-FLI-ALT-AGENT-CODES   OCCURS 10 TIMES.
000481             20  AM-FLI-AGT                PIC X(9).
000482             20  AM-FLI-AGT-COMM-ACC       PIC X.
000483             20  AM-FLI-AGT-SHARE-PCT      PIC S9V99      COMP-3.
000484         16  FILLER                        PIC X(102).
000485
000486     12  AM-CLIENT-OVERLAY-DMD   REDEFINES   AM-COMMENTS.
000487         16  AM-ALLOWABLE-DMD-BENEFITS  OCCURS 30 TIMES.
000488             20  AM-BENEFIT-DMD-CODE         PIC XX.
000489             20  AM-BENEFIT-DMD-TYPE         PIC X.
000490             20  AM-BENEFIT-DMD-REVISION     PIC XXX.
000491             20  AM-BENEFIT-DMD-REM-TERM     PIC X.
000492             20  AM-BENEFIT-DMD-RETRO-Y-N    PIC X.
000493         16  FILLER                          PIC X(10).
000494******************************************************************
      *<<((file: ERCACCT))
001024*                                COPY ELCBENE.
      *>>((file: ELCBENE))
000001******************************************************************
000002*                                                                *
000003*                            ELCBENE.                            *
000004*           COPYBOOK REVIEWED FOR YEAR 2000 COMPLIANCE
000005*                            VMOD=2.006                          *
000006*                                                                *
000007*   FILE DESCRIPTION = BENEFICIARY FILE                          *
000008*                                                                *
000009*   FILE TYPE = VSAM,KSDS                                        *
000010*   RECORD SIZE = 500   RECFORM = FIX                            *
000011*                                                                *
000012*   BASE CLUSTER NAME = ELBENE                   RKP=2,LEN=12    *
000013*     ALTERNATE PATH1 = ELBENE2 (ALT BY NAME)    RKP=14,LEN=42   *
000014*                                                                *
000015*   LOG = YES                                                    *
000016*   SERVREQ = BROWSE, DELETE, UPDATE, NEWREC                     *
000017*                                                                *
000018*  NO  CID  MODS  TO  COPYBOOK  ELCBENE                          *
000019******************************************************************
000020*                   C H A N G E   L O G
000021*
000022* CHANGES ARE MARKED BY THE CHANGE EFFECTIVE DATE.
000023*-----------------------------------------------------------------
000024*  CHANGE   CHANGE REQUEST PGMR  DESCRIPTION OF CHANGE
000025* EFFECTIVE    NUMBER
000026*-----------------------------------------------------------------
000027* 013017  CR2016053100001  PEMA  ACH PROCESSING
000028* 082317  CR2017082100003  PEMA  Add sub type
000029* 032019  CR2019011400002  PEMA  Add email address for ach report
000030******************************************************************
000031
000032 01  BENEFICIARY-MASTER.
000033     12  BE-RECORD-ID                PIC XX.
000034         88  VALID-BE-ID                VALUE 'BE'.
000035
000036     12  BE-CONTROL-PRIMARY.
000037         16  BE-COMPANY-CD           PIC X.
000038         16  BE-RECORD-TYPE          PIC X.
000039             88  BENEFICIARY-RECORD  VALUE 'B'.
000040             88  ADJUSTOR-RECORD     VALUE 'A'.
000041         16  BE-BENEFICIARY          PIC X(10).
000042     12  BE-CONTROL-BY-NAME.
000043         16  BE-COMPANY-CD-A1        PIC X.
000044         16  BE-RECORD-TYPE-A1       PIC X.
000045         16  BE-MAIL-TO-NAME-A1      PIC X(30).
000046         16  BE-ALTERNATE-PRIME-A1   PIC X(10).
000047
000048     12  BE-LAST-MAINT-DT            PIC XX.
000049     12  BE-LAST-MAINT-BY            PIC X(4).
000050     12  BE-LAST-MAINT-HHMMSS        PIC S9(6)     COMP-3.
000051
000052     12  BE-ADDRESS-DATA.
000053         16  BE-MAIL-TO-NAME         PIC X(30).
000054         16  BE-ADDRESS-LINE-1       PIC X(30).
000055         16  BE-ADDRESS-LINE-2       PIC X(30).
000056         16  BE-ADDRESS-LINE-3       PIC X(30).
000057         16  BE-CITY-STATE.
000058             20  BE-CITY             PIC X(28).
000059             20  BE-STATE            PIC XX.
000060         16  BE-ZIP-CODE.
000061             20  BE-ZIP-PRIME.
000062                 24  BE-ZIP-1ST      PIC X.
000063                     88  BE-CANADIAN-POST-CODE
000064                                         VALUE 'A' THRU 'Z'.
000065                 24  FILLER          PIC X(4).
000066             20  BE-ZIP-PLUS4        PIC X(4).
000067         16  BE-CANADIAN-POSTAL-CODE  REDEFINES  BE-ZIP-CODE.
000068             20  BE-CAN-POSTAL-1     PIC XXX.
000069             20  BE-CAN-POSTAL-2     PIC XXX.
000070             20  FILLER              PIC XXX.
000071         16  BE-PHONE-NO             PIC 9(11)     COMP-3.
000072         16  BE-GROUP-CHECKS-Y-N     PIC X.
000073
000074******************************************************************
000075*    THE BE-CARRIER FIELD IS USED BY 'AIG' TO DETERMINE HOW TO   *
000076*    SET THE CARRIER CODE IN THE PENDING CLAIM FILE.             *
000077******************************************************************
000078     12  BE-CARRIER                  PIC X.
000079
000080     12  BE-ADDRESS-DATA2.
000081         16  BE-MAIL-TO-NAME2        PIC X(30).
000082         16  BE-ADDRESS-LINE-12      PIC X(30).
000083         16  BE-ADDRESS-LINE-22      PIC X(30).
000084         16  BE-ADDRESS-LINE-32      PIC X(30).
000085         16  BE-CITY-STATE2.
000086             20  BE-CITY2            PIC X(28).
000087             20  BE-STATE2           PIC XX.
000088         16  BE-ZIP-CODE2.
000089             20  BE-ZIP-PRIME2.
000090                 24  BE-ZIP-1ST2     PIC X.
000091                     88  BE-CANADIAN-POST-CODE2
000092                                         VALUE 'A' THRU 'Z'.
000093                 24  FILLER          PIC X(4).
000094             20  BE-ZIP-PLUS42       PIC X(4).
000095         16  BE-CANADIAN-POSTAL-CODE2 REDEFINES  BE-ZIP-CODE2.
000096             20  BE-CAN-POSTAL-12    PIC XXX.
000097             20  BE-CAN-POSTAL-22    PIC XXX.
000098             20  FILLER              PIC XXX.
000099         16  BE-PHONE-NO2            PIC 9(11)     COMP-3.
000100         16  BE-ACH-DATA.
000101             20  BE-ACH-YES-OR-NO    PIC X.
000102                 88  BE-ON-ACH       VALUE 'Y'.
000103                 88  BE-NOT-ON-ACH   VALUE 'N' ' '.
000104             20  BE-ACH-ABA-ROUTING-NUMBER
000105                                     PIC X(15).
000106             20  BE-ACH-BANK-ACCOUNT-NUMBER
000107                                     PIC X(20).
000108             20  BE-ACH-SUB-TYPE     PIC XX.
000109             20  BE-ACH-EMAIL-YN     PIC X.
000110                 88  BE-EMAIL-ACH-RPT  VALUE 'Y'.
000111             20  be-ach-email-addr   PIC X(40).
000112         16  BE-BILLING-STMT-DATA.
000113*            20  BE-BSR-PHONE-NUM    PIC 9(11)     COMP-3.
000114             20  BE-BSR-FAX-NUM      PIC 9(11)     COMP-3.
000115             20  BE-OUTPUT-TYPE      PIC X.
000116                 88  BE-FAX-OUTPUT         VALUE 'F'.
000117                 88  BE-PRINT-OUTPUT       VALUE 'P' ' '.
000118
000119     12  filler                      PIC X(16).
000120******************************************************************
      *<<((file: ELCBENE))
001025
001026 01  tran-data-line1             pic x(80) value spaces.
001027 01  tran-data-line2             pic x(80) value spaces.
001028 01  soc-CLIENT-IN-DATA.
001029     05  soc-client-comp-id      pic xxx.
001030     05  soc-CLIENT-CAR          PIC X.
001031     05  soc-CLIENT-CLAIM-NO     PIC X(7).
001032     05  soc-CLIENT-CERT-NO      PIC X(11).
001033     05  soc-client-proc-id      pic x(4).
001034     05  soc-client-full-partial pic x.
001035
001036 01  filler                      pic x(100) value low-values.
001037
      ****************************************************************
      *                                                               
      * Copyright (c) 2016-2020 NTT DATA, Inc.                        
      * All rights reserved.                                          
      *                                                               
      ****************************************************************
       01  DFHEIV.                                                    
         02  DFHEIV0               PIC X(35).                         
         02  DFHEIV1               PIC X(08).                         
         02  DFHEIV2               PIC X(08).                         
         02  DFHEIV3               PIC X(08).                         
         02  DFHEIV4               PIC X(06).                         
         02  DFHEIV5               PIC X(04).                         
         02  DFHEIV6               PIC X(04).                         
         02  DFHEIV7               PIC X(02).                         
         02  DFHEIV8               PIC X(02).                         
         02  DFHEIV9               PIC X(01).                         
         02  DFHEIV10              PIC S9(7) COMP-3.                  
         02  DFHEIV11              PIC S9(4) COMP SYNC.               
         02  DFHEIV12              PIC S9(4) COMP SYNC.               
         02  DFHEIV13              PIC S9(4) COMP SYNC.               
         02  DFHEIV14              PIC S9(4) COMP SYNC.               
         02  DFHEIV15              PIC S9(4) COMP SYNC.               
         02  DFHEIV16              PIC S9(9) COMP SYNC.               
         02  DFHEIV17              PIC X(04).                         
         02  DFHEIV18              PIC X(04).                         
         02  DFHEIV19              PIC X(04).                         
         02  DFHEIV20              USAGE IS POINTER.                  
         02  DFHEIV21              USAGE IS POINTER.                  
         02  DFHEIV22              USAGE IS POINTER.                  
         02  DFHEIV23              USAGE IS POINTER.                  
         02  DFHEIV24              USAGE IS POINTER.                  
         02  DFHEIV25              PIC S9(9) COMP SYNC.               
         02  DFHEIV26              PIC S9(9) COMP SYNC.               
         02  DFHEIV27              PIC S9(9) COMP SYNC.               
         02  DFHEIV28              PIC S9(9) COMP SYNC.               
         02  DFHEIV29              PIC S9(9) COMP SYNC.               
         02  DFHEIV30              PIC S9(9) COMP SYNC.               
         02  DFHEIV31              PIC S9(9) COMP SYNC.               
         02  DFHEIV32              PIC S9(4) COMP SYNC.               
         02  DFHEIV33              PIC S9(4) COMP SYNC.               
         02  DFHEIV34              PIC S9(4) COMP SYNC.               
         02  DFHEIV35              PIC S9(4) COMP SYNC.               
         02  DFHEIV97              PIC S9(7) COMP-3 VALUE ZERO.       
         02  DFHEIV98              PIC S9(4) COMP SYNC VALUE ZERO.    
         02  FILLER                PIC X(02).                         
         02  DFHEIV99              PIC X(08) VALUE SPACE.             
         02  DFHEIVL0              PIC X(48) VALUE SPACE.             
         02  DFHEIVL1              PIC X(48) VALUE SPACE.             
         02  DFHEIVL2              PIC X(48) VALUE SPACE.             
         02  DFHEIVL3              PIC X(48) VALUE SPACE.             
         02  DFHEIVL4              PIC X(255) VALUE SPACE.            
         02  DFHEIVL5              PIC X(255) VALUE SPACE.            
       LINKAGE  SECTION.
      *****************************************************************
      *                                                               *
      * Copyright (c) 2016-2020 NTT DATA, Inc.                        *
      * All rights reserved.                                          *
      *                                                               *
      *****************************************************************
       01  dfheiblk.
           02  eibtime          pic s9(7) comp-3.
           02  eibdate          pic s9(7) comp-3.
           02  eibtrnid         pic x(4).
           02  eibtaskn         pic s9(7) comp-3.
           02  eibtrmid         pic x(4).
           02  dfheigdi         pic s9(4) comp.
           02  eibcposn         pic s9(4) comp.
           02  eibcalen         pic s9(4) comp.
           02  eibaid           pic x(1).
           02  eibfiller1       pic x(1).
           02  eibfn            pic x(2).
           02  eibfiller2       pic x(2).
           02  eibrcode         pic x(6).
           02  eibfiller3       pic x(2).
           02  eibds            pic x(8).
           02  eibreqid         pic x(8).
           02  eibrsrce         pic x(8).
           02  eibsync          pic x(1).
           02  eibfree          pic x(1).
           02  eibrecv          pic x(1).
           02  eibsend          pic x(1).
           02  eibatt           pic x(1).
           02  eibeoc           pic x(1).
           02  eibfmh           pic x(1).
           02  eibcompl         pic x(1).
           02  eibsig           pic x(1).
           02  eibconf          pic x(1).
           02  eiberr           pic x(1).
           02  eibrldbk         pic x(1).
           02  eiberrcd         pic x(4).
           02  eibsynrb         pic x(1).
           02  eibnodat         pic x(1).
           02  eibfiller5       pic x(2).
           02  eibresp          pic s9(8) comp.
           02  eibresp2         pic s9(8) comp.
           02  dfheigdj         pic s9(4) comp.
           02  dfheigdk         pic s9(4) comp.
001039 01  DFHCOMMAREA.
001040     05 GIVE-TAKE-SOCKET         PIC 9(8) COMP.
001041     05 LSTN-NAME                PIC X(8).
001042     05 LSTN-SUBNAME             PIC X(8).
001043**********  SOCK10   ************
001044     05 CLIENT-IN-DATA           pic x(36).
001045**********  SOCK10   ************
001046     05 SOCKADDR-IN-PARM.
001047        15 SIN-FAMILY            PIC 9(4) COMP.
001048        15 SIN-PORT              PIC 9(4) COMP.
001049        15 SIN-ADDRESS           PIC 9(8) COMP.
001050        15 SIN-ZERO              PIC X(8).
001051 01  VAR                         PIC X(30).
001052
       PROCEDURE DIVISION USING DFHEIBLK DFHCOMMAREA.
       0000-DFHEXIT SECTION.
           MOVE FUNCTION WHEN-COMPILED TO DFHEIVL0(1:21).
           MOVE '9#                    %   ' TO DFHEIV0.
           MOVE 'SOCK10' TO DFHEIV1.
           CALL 'kxdfhei1' USING DFHEIV0 DFH-START DFHEIV DFHEIV1
                DFHEIVL0.
001053 VCOBOL-DUMMY-PROCEDURE.
001054
001055     set P to address of KIXSYS
001056     CALL "getenv" using by value P returning var-ptr
001057     if var-ptr = null then
001058        display ' kixsys not set '
001059     else
001060        set address of var to var-ptr
001061        move 0 to env-var-len
001062        inspect var tallying env-var-len
001063          for characters before X'00'
001064        unstring var (1:env-var-len) delimited by '/'
001065           into WS-KIX-FIL1 WS-KIX-APPS WS-KIX-ENV WS-KIX-MYENV
001066              WS-KIX-SYS
001067        end-unstring
001068     end-if
001069
001070     display ' My env is ' ws-kix-myenv
001071
001072* when calling a C function the function returns its value
001073* in the system variable return code.
001074
001075*    display 'SOCK10:transaction data =', CLIENT-IN-DATA '**'
001076*    display 'SOCK10:socket number    =', GIVE-TAKE-SOCKET.
001077*    display 'SOCK10:socket name      =', lstn-name ' '
001078*       lstn-subname
001079*    display 'SOCK10:socket family    =', sin-family
001080*    display 'SOCK10:socket port      =', sin-port
001081*    display 'SOCK10:socket address   =', sin-address
001082*    display 'SOCK10:socket zero      =', sin-zero
001083
001084     
      * exec cics
001085*       asktime
001086*    end-exec
      *    MOVE '0"                    "   #00005820' TO DFHEIV0
           MOVE X'302220202020202020202020' &
                X'202020202020202020202220' &
                X'2020233030303035383230' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK
001087
001088     MOVE EIBDATE               TO DC-JULIAN-YYDDD.
001089     MOVE '5'                   TO DC-OPTION-CODE.
001090     PERFORM 8100-DATE-RTN  THRU  8100-EXIT.
001091     MOVE DC-GREG-DATE-1-EDIT   TO  SAVE-DATE.
001092     MOVE DC-BIN-DATE-1         TO  SAVE-BIN-DATE.
001093
001094     perform 0000-init-contact   thru 0000-exit
001095     perform 0010-receive        thru 0010-exit
001096     PERFORM 4000-INITIALIZE     THRU 4000-EXIT
001097     PERFORM 0021-PROCESS-SOC    THRU 0021-EXIT
001098
001099     .
001100 0000-end.
001101
001102     perform 1000-send-buffer    thru 1000-exit
001103     close CLM-STAT-EXT-OUT
001104     perform 1100-close-socket   thru 1100-exit
001105     
      * goback

           MOVE '9%                    "   ' TO DFHEIV0
           MOVE 'SOCK10' TO DFHEIV1
           CALL 'kxdfhei1' USING DFHEIV0 DFHEIV1
           goback
001106
001107     .
001108 0000-init-contact.
001109
001110     move spaces                 to ws-return-stuff
001111     if client-in-data (1:8) = 'SOCKET10'
001112        continue
001113     else
001114        display ' Unknown origin ' client-in-data
001115        go to 1100-close-socket
001116     end-if
001117
001118     move 'SOCKET10READY'        to ws-send-buf
001119     move +25                    to ws-send-msg-size
001120
001121*    display 'SOCK10:sequence number  =', ws-seq-num.
001122*    display 'SOCK10:send buffer      =', ws-send-buf(1:25).
001123
001124     call "send" using by value GIVE-TAKE-SOCKET,
001125         by reference ws-send-buf,
001126         by value ws-send-msg-size,
001127         by value ws-flags
001128
001129     if return-code <= zero
001130        display 'SOCK10:send error ' return-code
001131        go to 1000-socket-error
001132     end-if
001133
001134*    display 'SOCK10:About to recv '
001135
001136     .
001137 0000-exit.
001138     exit.
001139
001140 0010-receive.
001141
001142     call "recv" using by value GIVE-TAKE-SOCKET
001143         by reference ws-recv-buf
001144         by value ws-recv-msg-size
001145         by value ws-flags.
001146
001147     if return-code < zero
001148        display 'SOCK10:recv error ' return-code
001149        go to 1000-socket-error
001150     end-if
001151
001152     if return-code = zero
001153        display 'SOCK10:client disconnected',
001154        go to 1000-socket-error
001155     end-if
001156
001157*    display 'SOCK10:Good recv  '
001158*    display 'SOCK10:return code      = ', return-code
001159*    display 'SOCK10:receive buffer   = ', ws-recv-buf(1:60)
001160
001161     move +256                   to ws-send-msg-size
001162
001163     move ws-recv-buf (1:27)     to soc-client-in-data
001164
001165     move soc-client-comp-id     to ws-comp-id
001166
001167     evaluate true
001168        when ws-comp-id = 'DCC'
001169           move X'05'            to ws-comp-cd
001170        when ws-comp-id = 'AHL'
001171           MOVE X'06'            TO ws-comp-cd
001172        when ws-comp-id = 'VPP'
001173           move X'07'            to ws-comp-cd
001174        when ws-comp-id = 'FNL'
001175           move X'08'            to ws-comp-cd
001176        when other
001177           move X'04'            to ws-comp-cd
001178     end-evaluate
001179
001180     .
001181 0010-exit.
001182     exit.
001183
001184 0021-PROCESS-SOC.
001185
001186     MOVE WS-COMP-ID             TO WS-CF-COMPANY-ID
001187     MOVE SPACES                 TO WS-CF-PROCESSOR
001188     MOVE ZEROS                  TO WS-CF-SEQUENCE-NO
001189     MOVE '1'                    TO WS-CF-RECORD-TYPE
001190
001191     MOVE SPACES                 TO WS-CNTL-ERROR-SW
001192     PERFORM 1300-READ-CNTL      THRU 1300-EXIT
001193
001194     IF NO-COMPANY-RECORD
001195        MOVE 'Invalid company ID '
001196                                 to ws-return-stuff
001197        go to 0021-exit
001198     end-if
001199
001200     MOVE CF-CL-MAIL-TO-NAME      TO WS-UNALIGNED-FIELD.
001201     MOVE SPACES                  TO WS-ALIGNED-FIELD.
001202     MOVE +30                     TO WS-NAME-LENGTH.
001203     PERFORM ELCALGNP              THRU ELCALGNP-EXIT.
001204     MOVE WS-ALIGNED-FIELD         TO HEAD-COMPANY.
001205
001206     MOVE SPACES TO   END-OC-TABLE-SW
001207                      END-AD-TABLE-SW
001208                      END-AP-TABLE-SW.
001209
001210     MOVE 'CLAIM STA'            TO HEAD-REPORT-NO
001211
001212*       BUILD TRAILER KEY AND MSTR KEY
001213     MOVE ws-comp-cd         TO  WS-AT-COMPANY-CD
001214                                 WS-CL-COMPANY-CD.
001215     MOVE soc-client-car     TO  WS-AT-CARRIER
001216                                 WS-CL-CARRIER.
001217     MOVE soc-client-claim-no TO  WS-AT-CLAIM-NO
001218                                 WS-CL-CLAIM-NO.
001219     MOVE soc-client-cert-no TO  WS-AT-CERT-NO
001220                                 WS-CL-CERT-NO.
001221     MOVE ZEROS              TO  WS-AT-SEQ-NO.
001222
001223     IF soc-client-full-partial <> 'P'
001224        MOVE 'X'                 TO WS-FULL-PRINT-SW
001225     end-if
001226
001227     PERFORM 0022-PROCESS-3-FILES
001228                                 THRU 0022-EXIT
001229     .
001230 0021-EXIT.
001231      EXIT.
001232
001233 0022-PROCESS-3-FILES.
001234
001235     PERFORM 1550-READ-MSTR      THRU 1550-EXIT
001236
001237     IF MSTR-READ-ERROR
001238        MOVE    ' Claim not found '
001239                                 to ws-return-stuff
001240        MOVE ' '                 TO WS-MSTR-READ-ERROR-SW
001241        GO TO 0022-EXIT
001242     end-if
001243
001244     MOVE SPACES                 TO P-CAUSE-DIAG
001245     MOVE WS-CL-CONTROL-PRIMARY  TO WS-AT-CONTROL-PRIMARY
001246     MOVE +90                    TO WS-AT-SEQ-NO
001247
001248     
      * EXEC CICS READ
001249*         DATASET ('ELTRLR')
001250*         into    (ACTIVITY-TRAILERS)
001251*         RIDFLD  (WS-AT-CONTROL-PRIMARY)
001252*         resp    (ws-response)
001253*    END-EXEC
           MOVE LENGTH OF
            ACTIVITY-TRAILERS
             TO DFHEIV11
           MOVE 'ELTRLR' TO DFHEIV1
      *    MOVE '&"IL       E          (  N#00005984' TO DFHEIV0
           MOVE X'2622494C2020202020202045' &
                X'202020202020202020202820' &
                X'204E233030303035393834' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 ACTIVITY-TRAILERS, 
                 DFHEIV11, 
                 WS-AT-CONTROL-PRIMARY, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99
           MOVE EIBRESP  TO ws-response
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK
001254     if resp-normal
001255        MOVE AT-INFO-LINE-1      TO P-CAUSE-DIAG
001256     end-if
001257
001258     MOVE 0 TO WS-PAGE-CNT.
001259
001260     SET AP-INDEX   TO 1.
001261     SET AD-INDEX   TO 1.
001262     SET OC-INDEX   TO 1.
001263
001264     MOVE +0    TO WS-AT-SEQ-NO.
001265     PERFORM 2110-MOVE-CLAIM-INFO
001266                                 THRU 2110-EXIT
001267
001268***  BUILDIN CERT KEY
001269
001270     MOVE CL-COMPANY-CD      TO  WS-CM-COMPANY-CD
001271     MOVE CL-CERT-KEY-DATA   TO  WS-CM-CERT-DATA
001272     MOVE CL-CERT-NO         TO  WS-CM-CERT-NO.
001273
001274***  READ CERT
001275
001276     PERFORM 1600-READ-CERT   THRU 1600-EXIT.
001277
001278     IF CERT-READ-ERROR
001279        PERFORM 2120-NO-CERT-INFO  THRU 2120-EXIT
001280     ELSE
001281        PERFORM 2130-MOVE-CERT-INFO THRU 2130-EXIT.
001282
001283     PERFORM  1700-BROWSE-TRLR   THRU 1700-EXIT.
001284
001285     IF TRLR-BROWSE-ERROR
001286        GO TO 0022-BYPASS-TRLRS.
001287
001288*      TRAILER 0 IS THE FIRST REC AFTER START
001289     PERFORM  1750-READNEXT-TRLR   THRU 1750-EXIT.
001290
001291     PERFORM 2150-MOVE-TR0-INFO    THRU 2150-EXIT.
001292
001293***  NOW ALL 3 FILES HAVE BEEN READ
001294
001295 0022-BYPASS-TRLRS.
001296
001297     PERFORM 2300-PRINT-TO-LINE-26  THRU 2300-EXIT.
001298
001299     MOVE AT-CONTROL-PRIMARY TO WS-AT-CONTROL-SAVED.
001300     MOVE SPACE              TO WS-TRAILER-KEY-CHG-SW.
001301
001302     IF NOT TRLR-BROWSE-ERROR
001303        PERFORM 2500-PROCESS-N-PRINT-TRAILERS
001304                                 THRU 2500-EXIT until
001305           TRAILER-KEY-CHANGED
001306     ELSE
001307        MOVE '* TRLRS HAVE BEEN PURGED    *'
001308                                 TO CLM-STAT-EXT-OUT-RECORD
001309        perform 5000-write-a-line
001310                                 thru 5000-exit
001311        go to 0022-end
001312     end-if
001313
001314******     BUILD ERACCT/EMPROD KEY
001315
001316     IF NOT CERT-READ-ERROR
001317        IF FULL-PRINT-REQUIRED
001318           MOVE CM-CONTROL-PRIMARY
001319                                 TO WS-AM-CONTROL-PRIMARY
001320           PERFORM 1100-READ-AND-BUILD-ACCT
001321                                 THRU 1149-EXIT
001322        end-if
001323     end-if
001324
001325*******     BUILD ELBENE KEY
001326     IF FULL-PRINT-REQUIRED
001327        MOVE CL-COMPANY-CD  TO WS-BE-COMPANY-CD
001328        MOVE 'B'            TO WS-BE-RECORD-TYPE
001329        MOVE CL-BENEFICIARY TO WS-BE-BENEFICIARY
001330        PERFORM 1200-READ-AND-BUILD-BENE THRU 1299-EXIT.
001331
001332     IF FULL-PRINT-REQUIRED
001333         PERFORM 2700-PRINT-OPEN-CLOSE-HISTORY THRU 2700-EXIT.
001334
001335 0022-END.
001336     IF NOT TRLR-BROWSE-ERROR
001337        PERFORM  1701-ENDBR-TRLR      THRU 1701-EXIT.
001338
001339 0022-EXIT.
001340      EXIT.
001341
001342     EJECT
001343 1100-READ-AND-BUILD-ACCT.
001344     
      * EXEC CICS  HANDLE CONDITION
001345*           NOTFND  (1140-ENDBR)
001346*           ENDFILE (1140-ENDBR)
001347*    END-EXEC.
      *    MOVE '"$I''                  ! " #00006080' TO DFHEIV0
           MOVE X'222449272020202020202020' &
                X'202020202020202020202120' &
                X'2220233030303036303830' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
001348
001349     
      * EXEC CICS  STARTBR
001350*           DATASET  ('ERACCT')
001351*           RIDFLD   (WS-AM-CONTROL-PRIMARY)
001352*           GTEQ
001353*    END-EXEC.
           MOVE 'ERACCT' TO DFHEIV1
           MOVE 0
             TO DFHEIV11
      *    MOVE '&,         G          &   #00006085' TO DFHEIV0
           MOVE X'262C20202020202020202047' &
                X'202020202020202020202620' &
                X'2020233030303036303835' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 WS-AM-CONTROL-PRIMARY, 
                 DFHEIV99, 
                 DFHEIV11, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
001354
001355     MOVE 'X'         TO WS-ACCT-BROWSE-SW.
001356
001357 1110-READ-NEXT.
001358     
      * EXEC CICS  READNEXT
001359*           into     (ACCOUNT-MASTER)
001360*           DATASET  ('ERACCT')
001361*           RIDFLD   (WS-AM-CONTROL-PRIMARY)
001362*    END-EXEC.
           MOVE LENGTH OF
            ACCOUNT-MASTER
             TO DFHEIV12
           MOVE 'ERACCT' TO DFHEIV1
           MOVE 0
             TO DFHEIV11
      *    MOVE '&.IL                  )   #00006094' TO DFHEIV0
           MOVE X'262E494C2020202020202020' &
                X'202020202020202020202920' &
                X'2020233030303036303934' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 ACCOUNT-MASTER, 
                 DFHEIV12, 
                 WS-AM-CONTROL-PRIMARY, 
                 DFHEIV99, 
                 DFHEIV11, 
                 DFHEIV99, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
001363
001364 1120-CHECK-IF-EQUAL.
001365     IF CM-COMPANY-CD = AM-COMPANY-CD AND
001366        CM-CARRIER    = AM-CARRIER    AND
001367        CM-GROUPING   = AM-GROUPING   AND
001368        CM-STATE      = AM-STATE      AND
001369        CM-ACCOUNT    = AM-ACCOUNT
001370           NEXT SENTENCE
001371     ELSE
001372        GO TO 1149-EXIT.
001373
001374     IF CM-CERT-EFF-DT NOT LESS THAN AM-EXPIRATION-DT
001375        GO TO 1110-READ-NEXT.
001376
001377     IF CM-CERT-EFF-DT NOT LESS THAN AM-EFFECTIVE-DT
001378        NEXT SENTENCE
001379     ELSE
001380        GO TO 1110-READ-NEXT.
001381
001382 1130-BUILD-ERACCT-ADDR.
001383     MOVE 'X' TO END-AD-TABLE-SW.
001384     MOVE '8'                    TO AD-TBL-TYPE   (AD-INDEX).
001385     MOVE AM-NAME                TO AD-TBL-NAME   (AD-INDEX).
001386     MOVE AM-ADDRS               TO AD-TBL-ADDR-1 (AD-INDEX).
001387     MOVE SPACES                 TO AD-TBL-ADDR-2 (AD-INDEX).
001388     MOVE SPACES                 TO AD-TBL-CITY   (AD-INDEX).
001389     STRING AM-ADDR-CITY ' ' AM-ADDR-STATE
001390        DELIMITED BY '  ' INTO AD-TBL-CITY (AD-INDEX)
001391     END-STRING
001392
001393     MOVE SPACES                 TO WS-ZIP-WORK.
001394     IF AM-CANADIAN-POST-CODE
001395         MOVE AM-CAN-POSTAL-1    TO WS-CAN-POSTAL-1
001396         MOVE AM-CAN-POSTAL-2    TO WS-CAN-POSTAL-2
001397     ELSE
001398         MOVE AM-ZIP-PRIME       TO WS-ZIP-PRIME
001399         IF AM-ZIP-PLUS4 NOT = SPACES  AND  ZEROS
001400             MOVE '-'            TO WS-ZIP-DASH
001401             MOVE AM-ZIP-PLUS4   TO WS-ZIP-PLUS4.
001402     MOVE WS-ZIP-WORK            TO AD-TBL-ZIP    (AD-INDEX).
001403
001404     MOVE AM-TEL-NO              TO WS-WORK-PHONE.
001405     INSPECT WS-WORK-PHONE CONVERTING SPACES TO '0'.
001406     MOVE WS-NUMERIC-PHONE       TO AD-TBL-PHONE (AD-INDEX).
001407     SET AD-INDEX UP BY 1.
001408
001409 1140-ENDBR.
001410     IF ACCT-BROWSE-OKAY
001411        
      * EXEC CICS  ENDBR
001412*            DATASET  ('ERACCT')
001413*       END-EXEC.
           MOVE 'ERACCT' TO DFHEIV1
           MOVE 0
             TO DFHEIV11
      *    MOVE '&2                    $   #00006147' TO DFHEIV0
           MOVE X'263220202020202020202020' &
                X'202020202020202020202420' &
                X'2020233030303036313437' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 DFHEIV11, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
001414
001415 1149-EXIT.
001416      EXIT.
001417
001418     EJECT
001419 1200-READ-AND-BUILD-BENE.
001420     
      * EXEC CICS  HANDLE CONDITION
001421*           NOTFND  (1299-EXIT)
001422*           ENDFILE (1299-EXIT)
001423*    END-EXEC.
      *    MOVE '"$I''                  ! # #00006156' TO DFHEIV0
           MOVE X'222449272020202020202020' &
                X'202020202020202020202120' &
                X'2320233030303036313536' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
001424
001425 1210-READ.
001426     
      * EXEC CICS  READ
001427*           into     (BENEFICIARY-MASTER)
001428*           DATASET  ('ELBENE')
001429*           RIDFLD   (WS-BE-CONTROL-PRIMARY)
001430*           EQUAL
001431*    END-EXEC.
           MOVE LENGTH OF
            BENEFICIARY-MASTER
             TO DFHEIV11
           MOVE 'ELBENE' TO DFHEIV1
      *    MOVE '&"IL       E          (   #00006162' TO DFHEIV0
           MOVE X'2622494C2020202020202045' &
                X'202020202020202020202820' &
                X'2020233030303036313632' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 BENEFICIARY-MASTER, 
                 DFHEIV11, 
                 WS-BE-CONTROL-PRIMARY, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
001432
001433 1220-BUILD-CLBENE-ADDR.
001434     MOVE 'X' TO END-AD-TABLE-SW.
001435     MOVE '9'                    TO AD-TBL-TYPE   (AD-INDEX).
001436     MOVE BE-MAIL-TO-NAME        TO AD-TBL-NAME   (AD-INDEX).
001437     MOVE BE-ADDRESS-LINE-1      TO AD-TBL-ADDR-1 (AD-INDEX).
001438     MOVE BE-ADDRESS-LINE-2      TO AD-TBL-ADDR-2 (AD-INDEX).
001439     MOVE SPACES                 TO AD-TBL-CITY   (AD-INDEX).
001440     STRING BE-CITY ' ' BE-STATE
001441        DELIMITED BY '  ' INTO AD-TBL-CITY (AD-INDEX)
001442     END-STRING
001443
001444     MOVE SPACES                 TO WS-ZIP-WORK.
001445     IF BE-CANADIAN-POST-CODE
001446         MOVE BE-CAN-POSTAL-1    TO WS-CAN-POSTAL-1
001447         MOVE BE-CAN-POSTAL-2    TO WS-CAN-POSTAL-2
001448     ELSE
001449         MOVE BE-ZIP-PRIME       TO WS-ZIP-PRIME
001450         IF BE-ZIP-PLUS4 NOT = SPACES  AND  ZEROS
001451             MOVE '-'            TO WS-ZIP-DASH
001452             MOVE BE-ZIP-PLUS4   TO WS-ZIP-PLUS4.
001453     MOVE WS-ZIP-WORK            TO AD-TBL-ZIP    (AD-INDEX).
001454
001455     IF BE-PHONE-NO NOT NUMERIC
001456        MOVE ZEROS TO BE-PHONE-NO.
001457     MOVE BE-PHONE-NO            TO AD-TBL-PHONE  (AD-INDEX).
001458
001459 1299-EXIT.
001460      EXIT.
001461     EJECT
001462 1300-READ-CNTL.
001463******************************************************************
001464***          I/O REQUESTS AGAINST THE CONTROL FILE             ***
001465******************************************************************
001466
001467     
      * EXEC CICS  READ
001468*       into     (CONTROL-FILE)
001469*       DATASET  ('ELCNTL')
001470*       RIDFLD   (WS-CF-CONTROL-PRIMARY)
001471*       resp     (ws-response)
001472*    END-EXEC
           MOVE LENGTH OF
            CONTROL-FILE
             TO DFHEIV11
           MOVE 'ELCNTL' TO DFHEIV1
      *    MOVE '&"IL       E          (  N#00006203' TO DFHEIV0
           MOVE X'2622494C2020202020202045' &
                X'202020202020202020202820' &
                X'204E233030303036323033' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 CONTROL-FILE, 
                 DFHEIV11, 
                 WS-CF-CONTROL-PRIMARY, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99
           MOVE EIBRESP  TO ws-response
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK
001473
001474     if not resp-normal
001475        MOVE 'X'                 TO WS-CNTL-ERROR-SW
001476     end-if
001477
001478     .
001479 1300-EXIT.
001480      EXIT.
001481
001482 1550-READ-MSTR.
001483******************************************************************
001484***       I/O REQUESTS AGAINST THE CLAIM MASTER FILE           ***
001485******************************************************************
001486
001487     
      * EXEC CICS  READ
001488*       into     (CLAIM-MASTER)
001489*       DATASET  ('ELMSTR')
001490*       RIDFLD   (WS-CL-CONTROL-PRIMARY)
001491*       resp     (ws-response)
001492*    END-EXEC
           MOVE LENGTH OF
            CLAIM-MASTER
             TO DFHEIV11
           MOVE 'ELMSTR' TO DFHEIV1
      *    MOVE '&"IL       E          (  N#00006223' TO DFHEIV0
           MOVE X'2622494C2020202020202045' &
                X'202020202020202020202820' &
                X'204E233030303036323233' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 CLAIM-MASTER, 
                 DFHEIV11, 
                 WS-CL-CONTROL-PRIMARY, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99
           MOVE EIBRESP  TO ws-response
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK
001493
001494     if not resp-normal
001495        move 'X'                 to ws-mstr-read-error-sw
001496     end-if
001497
001498     .
001499 1550-EXIT.
001500      EXIT.
001501
001502 1600-READ-CERT.
001503******************************************************************
001504***   I/O REQUESTS AGAINST THE CERTIFICATE MASTER FILE         ***
001505******************************************************************
001506
001507     
      * EXEC CICS  READ
001508*       into (CERTIFICATE-MASTER)
001509*       DATASET  ('ELCERT')
001510*       RIDFLD   (WS-CM-CONTROL-PRIMARY)
001511*       resp     (ws-response)
001512*    END-EXEC
           MOVE LENGTH OF
            CERTIFICATE-MASTER
             TO DFHEIV11
           MOVE 'ELCERT' TO DFHEIV1
      *    MOVE '&"IL       E          (  N#00006243' TO DFHEIV0
           MOVE X'2622494C2020202020202045' &
                X'202020202020202020202820' &
                X'204E233030303036323433' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 CERTIFICATE-MASTER, 
                 DFHEIV11, 
                 WS-CM-CONTROL-PRIMARY, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99
           MOVE EIBRESP  TO ws-response
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK
001513
001514     if not resp-normal
001515        move 'X'                 to ws-cert-read-error-sw
001516     end-if
001517
001518     .
001519 1600-EXIT.
001520      EXIT.
001521
001522 1700-BROWSE-TRLR.
001523******************************************************************
001524***       I/O REQUESTS AGAINST THE ACTIVITY TRAILER FILE       ***
001525******************************************************************
001526
001527     
      * EXEC CICS  STARTBR
001528*       DATASET  ('ELTRLR')
001529*       RIDFLD   (WS-AT-CONTROL-PRIMARY)
001530*       EQUAL
001531*    END-EXEC
           MOVE 'ELTRLR' TO DFHEIV1
           MOVE 0
             TO DFHEIV11
      *    MOVE '&,         E          &   #00006263' TO DFHEIV0
           MOVE X'262C20202020202020202045' &
                X'202020202020202020202620' &
                X'2020233030303036323633' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 WS-AT-CONTROL-PRIMARY, 
                 DFHEIV99, 
                 DFHEIV11, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK
001532
001533     if resp-normal
001534        MOVE SPACE               TO WS-TRLR-BROWSE-ERROR-SW
001535     else
001536        MOVE 'X'                 TO WS-TRLR-BROWSE-ERROR-SW
001537     end-if
001538
001539     .
001540 1700-EXIT.
001541      EXIT.
001542
001543 1701-ENDBR-TRLR.
001544     
      * EXEC CICS  ENDBR
001545*       DATASET  ('ELTRLR')
001546*    END-EXEC.
           MOVE 'ELTRLR' TO DFHEIV1
           MOVE 0
             TO DFHEIV11
      *    MOVE '&2                    $   #00006280' TO DFHEIV0
           MOVE X'263220202020202020202020' &
                X'202020202020202020202420' &
                X'2020233030303036323830' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 DFHEIV11, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
001547
001548 1701-EXIT.
001549      EXIT.
001550
001551 1750-READNEXT-TRLR.
001552     
      * EXEC CICS  HANDLE CONDITION
001553*           ENDFILE (1752-ENDFILE)
001554*    END-EXEC.
      *    MOVE '"$''                   ! $ #00006288' TO DFHEIV0
           MOVE X'222427202020202020202020' &
                X'202020202020202020202120' &
                X'2420233030303036323838' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
001555
001556     
      * EXEC CICS  READNEXT
001557*           DATASET  ('ELTRLR')
001558*           RIDFLD   (WS-AT-CONTROL-PRIMARY)
001559*           INTO     (ACTIVITY-TRAILERS)
001560*    END-EXEC.
           MOVE LENGTH OF
            ACTIVITY-TRAILERS
             TO DFHEIV12
           MOVE 'ELTRLR' TO DFHEIV1
           MOVE 0
             TO DFHEIV11
      *    MOVE '&.IL                  )   #00006292' TO DFHEIV0
           MOVE X'262E494C2020202020202020' &
                X'202020202020202020202920' &
                X'2020233030303036323932' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 ACTIVITY-TRAILERS, 
                 DFHEIV12, 
                 WS-AT-CONTROL-PRIMARY, 
                 DFHEIV99, 
                 DFHEIV11, 
                 DFHEIV99, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
001561
001562     GO TO 1750-EXIT.
001563
001564 1752-ENDFILE.
001565     MOVE  'E'  TO WS-ELTRLR-EOF-SW.
001566
001567 1750-EXIT.
001568      EXIT.
001569
001570     EJECT
001571
001572     EJECT
001573*ALIGN-RTN.                      COPY ELCALGNP.
001574 ALIGN-RTN.
001575*    COPY ELCALGNP.
      *>>((file: ELCALGNP))
000001******************************************************************
000002*                                                                *
000003*                            ELCALGNP.                           *
000004*                            VMOD=2.002                          *
000005*                                                                *
000006*   NO  CID  MODS  IN  COPYBOOK ELCALGNP                         *
000007******************************************************************
000008
000009******************************************************************
000010***                 -ELCALGNP-
000011***     COPY MEMBER FOR FIELD ALIGNMENT ROUTINE                  *
000012***     THIS ROUTINE WILL ACCEPT AN ALPHABETIC FIELD AND AFTER   *
000013***      ALIGNING THE CONTENTS IN THE CENTER, RETURNS THE ALIGNED*
000014***      FIELD IN A SEPARATE AREA.
000015***     THIS ROUTINE TO BE USED ONLY WITH ACCOMPANIMENT          *
000016***      OF THE WORKING-STORAGE COPY MEMBER ( ELCALGND )         *
000017***     THE HOST PROGRAM MUST INITIALIZE THE FOLLOWING 2 FIELDS  *
000018***      FROM THE ABOVE COPY MEMBER FOR THIS PROCEDURE TO BE     *
000019***      SUCCESSFUL.                                             *
000020***       WS-UNALIGNED-FIELD   PIC X(30)
000021***                         THE ALPHANUMERIC FIELD TO BE ALIGNED
000022***       WS-NAME-LENGTH       PIC S9(4)
000023***                         THE NUMERIC LENGTH OF THE ABOVE FIELD
000024***                         DEFAULT VALUE IS 30
000025******************************************************************
000026 ELCALGNP.
000027     MOVE SPACES   TO WS-ALIGNED-FIELD.
000028
000029     IF WS-UNALIGNED-FIELD = SPACES
000030         GO TO ELCALGNP-EXIT.
000031
000032     MOVE  ZEROS     TO WS-HALF-BLANKS
000033                        WS-ACTUAL-NAME-LENGTH
000034                        WS-SPACE-COUNTER.
000035
000036     MOVE LOW-VALUES TO WS-LENGTH-FOUND-SW.
000037     SET NAME-IND    TO WS-NAME-LENGTH.
000038
000039     PERFORM S1-FIND-SPACE-LENGTH  THRU S1-EXIT
000040                                    UNTIL  LENGTH-FOUND.
000041
000042     IF WS-SPACE-COUNTER LESS 2
000043         MOVE WS-UNALIGNED-FIELD  TO WS-ALIGNED-FIELD
000044         GO TO ELCALGNP-EXIT.
000045
000046     SUBTRACT WS-SPACE-COUNTER FROM WS-NAME-LENGTH
000047                                    GIVING WS-ACTUAL-NAME-LENGTH.
000048
000049     DIVIDE  WS-SPACE-COUNTER BY 2  GIVING WS-HALF-BLANKS.
000050     SET  NAME-IND-A TO 1.
000051     PERFORM  S2-MOVE-LEADING-SPACE  THRU S2-EXIT
000052                                    WS-HALF-BLANKS  TIMES.
000053     SET  NAME-IND   TO 1.
000054     PERFORM S3-MOVE-ALPHA           THRU S3-EXIT
000055                                    WS-ACTUAL-NAME-LENGTH  TIMES.
000056 ELCALGNP-EXIT.
000057     EXIT.
000058
000059 S1-FIND-SPACE-LENGTH.
000060     IF  WS-UNALIGNED-BYTE (NAME-IND) = SPACES
000061         ADD 1  TO WS-SPACE-COUNTER
000062     ELSE
000063         MOVE HIGH-VALUES TO WS-LENGTH-FOUND-SW
000064         GO TO S1-EXIT.
000065
000066     SET NAME-IND  DOWN BY 1.
000067     IF NAME-IND NOT  GREATER THAN ZERO
000068         MOVE  HIGH-VALUES TO WS-LENGTH-FOUND-SW.
000069
000070 S1-EXIT.
000071     EXIT.
000072
000073 S2-MOVE-LEADING-SPACE.
000074     MOVE SPACE   TO WS-UNALIGNED-BYTE-A (NAME-IND-A)
000075     SET NAME-IND-A  UP  BY 1.
000076
000077 S2-EXIT.
000078     EXIT.
000079
000080 S3-MOVE-ALPHA.
000081     MOVE  WS-UNALIGNED-BYTE (NAME-IND) TO
000082                         WS-UNALIGNED-BYTE-A (NAME-IND-A).
000083     SET NAME-IND   UP BY 1.
000084     SET NAME-IND-A UP BY 1.
000085
000086 S3-EXIT.
000087     EXIT.
000088
      *<<((file: ELCALGNP))
001576     EJECT
001577 2110-MOVE-CLAIM-INFO.
001578
001579     MOVE CL-CLAIM-NO          TO P-CLAIM-NO.
001580     MOVE CL-CARRIER           TO P-CARR.
001581     MOVE CL-CERT-NO           TO P-CERT-NO.
001582     MOVE CL-CCN               TO HEAD-CREDIT-CARD.
001583     MOVE CL-INSURED-SEX-CD    TO P-INSURED-SEX.
001584     MOVE SPACES               TO P-STATUS     P-TYPE.
001585
001586     EVALUATE TRUE
001587
001588        WHEN CL-CLAIM-TYPE = 'A'
001589           MOVE ' AH '
001590                                 TO P-TYPE
001591
001592        WHEN CL-CLAIM-TYPE = 'I'
001593           MOVE ' IU '            TO P-TYPE
001594
001595        WHEN CL-CLAIM-TYPE = 'G'
001596           MOVE 'GAP '            TO P-TYPE
001597
001598        WHEN CL-CLAIM-TYPE = 'F'
001599           MOVE 'FAM '            TO P-TYPE
001600
001601        WHEN CL-CLAIM-TYPE = 'L'
001602           MOVE 'LIFE'
001603                                 TO P-TYPE
001604
001605     END-EVALUATE
001606
001607     IF CLAIM-IS-CLOSED
001608         MOVE 'CLOSED'  TO P-STATUS.
001609
001610     IF CLAIM-IS-OPEN
001611         MOVE 'OPEN'    TO P-STATUS.
001612
001613     PERFORM 2111-ARRANGE-NAME  THRU 2111-EXIT.
001614
001615     MOVE CL-PROCESSOR-ID TO P-PROCESSOR.
001616     MOVE CL-LAST-PMT-AMT TO P-LAST-PMT-AMT.
001617
001618     IF CL-PAID-THRU-DT  = LOW-VALUES OR SPACES
001619         MOVE SPACE TO P-PAID-THRU-DT
001620         IF PI-USES-PAID-TO
001621            MOVE 'PAID  TO   - ' TO L-12-PD-THRU
001622         ELSE
001623            MOVE 'PAID THRU  - ' TO L-12-PD-THRU
001624     ELSE
001625         IF NOT PI-USES-PAID-TO
001626            MOVE CL-PAID-THRU-DT TO DC-BIN-DATE-1
001627            MOVE ' '             TO DC-OPTION-CODE
001628            PERFORM 8100-DATE-RTN  THRU 8100-EXIT
001629            MOVE DC-GREG-DATE-1-EDIT  TO P-PAID-THRU-DT
001630         ELSE
001631            MOVE 'PAID  TO   - ' TO L-12-PD-THRU
001632            MOVE CL-PAID-THRU-DT TO DC-BIN-DATE-1
001633            MOVE +1  TO DC-ELAPSED-DAYS
001634            MOVE +0  TO DC-ELAPSED-MONTHS
001635            MOVE '6' TO DC-OPTION-CODE
001636            PERFORM 8100-DATE-RTN  THRU 8100-EXIT
001637            MOVE DC-GREG-DATE-1-EDIT  TO P-PAID-THRU-DT.
001638
001639     IF CL-LAST-PMT-DT = LOW-VALUES OR SPACES
001640         MOVE SPACE TO P-LAST-PMT-DT
001641     ELSE
001642         MOVE CL-LAST-PMT-DT  TO DC-BIN-DATE-1
001643         MOVE ' '             TO DC-OPTION-CODE
001644         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
001645         MOVE DC-GREG-DATE-1-EDIT  TO P-LAST-PMT-DT.
001646
001647     IF CL-INCURRED-DT = LOW-VALUES OR SPACES
001648         MOVE SPACE TO P-INCURRED-DT
001649     ELSE
001650         MOVE CL-INCURRED-DT  TO DC-BIN-DATE-1
001651         MOVE ' '             TO DC-OPTION-CODE
001652         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
001653         MOVE DC-GREG-DATE-1-EDIT  TO P-INCURRED-DT.
001654
001655     IF CL-REPORTED-DT = LOW-VALUES OR SPACES
001656         MOVE SPACE TO P-REPORTED-DT
001657     ELSE
001658         MOVE CL-REPORTED-DT TO DC-BIN-DATE-1
001659         MOVE ' '            TO DC-OPTION-CODE
001660         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
001661         MOVE DC-GREG-DATE-1-EDIT  TO P-REPORTED-DT
001662
001663     IF CL-FILE-ESTABLISH-DT = LOW-VALUES OR SPACES
001664         MOVE SPACE TO P-ESTAB-DT
001665     ELSE
001666         MOVE CL-FILE-ESTABLISH-DT TO DC-BIN-DATE-1
001667         MOVE ' '                  TO DC-OPTION-CODE
001668         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
001669         MOVE DC-GREG-DATE-1-EDIT    TO P-ESTAB-DT.
001670
001671     IF CL-NEXT-AUTO-PAY-DT = LOW-VALUES OR SPACES
001672         MOVE SPACES   TO P-NEXT-AUTO-DT
001673     ELSE
001674         IF PI-USES-PAID-TO
001675             MOVE CL-NEXT-AUTO-PAY-DT    TO  DC-BIN-DATE-1
001676             MOVE '6'                    TO  DC-OPTION-CODE
001677             MOVE +1                     TO  DC-ELAPSED-DAYS
001678             MOVE +0                     TO  DC-ELAPSED-MONTHS
001679             PERFORM 8100-DATE-RTN      THRU 8100-EXIT
001680             IF NO-CONVERSION-ERROR
001681                 MOVE DC-GREG-DATE-1-EDIT TO P-NEXT-AUTO-DT
001682             ELSE
001683                 MOVE SPACES             TO  P-NEXT-AUTO-DT
001684         ELSE
001685             MOVE CL-NEXT-AUTO-PAY-DT    TO  DC-BIN-DATE-1
001686             MOVE ' '                    TO  DC-OPTION-CODE
001687             MOVE +0                     TO  DC-ELAPSED-DAYS
001688                                            DC-ELAPSED-MONTHS
001689             PERFORM 8100-DATE-RTN       THRU 8100-EXIT
001690             IF NO-CONVERSION-ERROR
001691                 MOVE DC-GREG-DATE-1-EDIT TO P-NEXT-AUTO-DT
001692             ELSE
001693                 MOVE SPACES             TO  P-NEXT-AUTO-DT.
001694
001695     MOVE CL-NO-OF-PMTS-MADE     TO P-PMTS-MADE.
001696
001697     MOVE SPACES  TO P-PREM-TYPE.
001698     IF SINGLE-PREMIUM
001699         MOVE 'SINGLE'           TO P-PREM-TYPE.
001700
001701     IF O-B-COVERAGE
001702         MOVE 'OB COVG'          TO P-PREM-TYPE.
001703
001704     IF OPEN-END-COVERAGE
001705         MOVE 'OPN END'          TO P-PREM-TYPE.
001706
001707     MOVE CL-TOTAL-PAID-AMT      TO P-TOT-PAID.
001708
001709     MOVE SPACES              TO P-PURGED-STMT
001710                                 P-PURGED-DATE.
001711
001712     IF CL-PURGED-DT NOT EQUAL LOW-VALUES
001713        MOVE CL-PURGED-DT         TO DC-BIN-DATE-1
001714        MOVE ' '                  TO DC-OPTION-CODE
001715        MOVE +0                   TO DC-ELAPSED-DAYS
001716                                     DC-ELAPSED-MONTHS
001717        PERFORM 8100-DATE-RTN  THRU 8100-EXIT
001718        MOVE 'PURGED DATE  - '    TO P-PURGED-STMT
001719        MOVE DC-GREG-DATE-1-EDIT  TO P-PURGED-DATE.
001720
001721 2110-EXIT.
001722      EXIT.
001723
001724     EJECT
001725 2111-ARRANGE-NAME.
001726     MOVE SPACES                TO P-NAME-GRP.
001727     MOVE CL-INSURED-LAST-NAME  TO WS-LAST-NAME.
001728     MOVE CL-INSURED-1ST-NAME   TO WS-FIRST-NAME.
001729
001730     SET L-IND  TO 1.
001731     SET F-IND  TO 1.
001732     SET P-IND  TO 1.
001733
001734     MOVE SPACES  TO WS-LN-SW
001735                     WS-FN-SW
001736                     PREVIOUS-BYTE.
001737
001738     IF WS-LAST-NAME = SPACE
001739         NEXT SENTENCE
001740     ELSE
001741         PERFORM 2111A-LOAD-LAST-NAME  THRU 2111A-EXIT
001742          UNTIL  LAST-NAME-LOADED
001743          OR     L-IND  GREATER THAN 15.
001744
001745     MOVE ',' TO P-NAME (P-IND).
001746     SET P-IND  UP  BY 2.
001747     IF WS-FIRST-NAME = SPACE
001748         NEXT SENTENCE
001749     ELSE
001750         PERFORM 2111B-LOAD-FIRST-NAME  THRU 2111B-EXIT
001751          UNTIL  FIRST-NAME-LOADED
001752          OR     F-IND  GREATER THAN 12.
001753
001754     IF CL-INSURED-MID-INIT NOT = SPACES
001755         MOVE ','  TO P-NAME (P-IND)
001756         SET P-IND  UP BY 1
001757         MOVE CL-INSURED-MID-INIT  TO P-NAME (P-IND)
001758     ELSE
001759         NEXT SENTENCE.
001760
001761 2111-EXIT.
001762      EXIT.
001763
001764 2111A-LOAD-LAST-NAME.
001765     IF  WS-L-BYTE (L-IND) = SPACE
001766         IF PREVIOUS-BYTE = SPACE
001767             MOVE 'X' TO WS-LN-SW
001768             SET P-IND  DOWN  BY 1
001769             GO TO 2111A-EXIT
001770         ELSE
001771             MOVE SPACE TO PREVIOUS-BYTE
001772     ELSE
001773         MOVE WS-L-BYTE (L-IND)  TO P-NAME (P-IND)
001774                                    PREVIOUS-BYTE.
001775
001776     SET L-IND  UP BY 1.
001777     SET P-IND  UP BY 1.
001778
001779 2111A-EXIT.
001780       EXIT.
001781
001782 2111B-LOAD-FIRST-NAME.
001783     IF  WS-F-BYTE (F-IND) = SPACE
001784         IF PREVIOUS-BYTE = SPACE
001785             MOVE 'X' TO WS-FN-SW
001786             SET P-IND  DOWN BY 1
001787             GO TO 2111B-EXIT
001788         ELSE
001789             MOVE SPACE TO PREVIOUS-BYTE
001790     ELSE
001791         MOVE WS-F-BYTE (F-IND)  TO P-NAME (P-IND)
001792                                    PREVIOUS-BYTE.
001793
001794     SET F-IND  UP BY 1.
001795     SET P-IND  UP BY 1.
001796
001797 2111B-EXIT.
001798       EXIT.
001799
001800     EJECT
001801 2120-NO-CERT-INFO.
001802     MOVE SPACES     TO P-COVERAGE
001803                        P-EXPIRE
001804                        WS-CANC-DT
001805                        P-CERT-ISSUE-DT
001806                        P-CERT-ENTRY-MM  P-CERT-SL
001807                        P-CERT-ENTRY-YY.
001808     MOVE ZERO       TO P-TERM
001809                        P-REM.
001810     MOVE SPACES     TO P-CERT-STAT
001811                        P-ACCT
001812                        P-STATE
001813                        P-GROUP
001814                        P-REIN-CODE
001815                        P-CERT-CANC-DT
001816                        P-MEMBER-NO
001817                        P-CERT-BATCH.
001818     MOVE ZERO       TO P-ORIG-BENEF-AMT.
001819
001820 2120-EXIT.
001821      EXIT.
001822
001823     EJECT
001824 2130-MOVE-CERT-INFO.
001825     MOVE ZEROS                    TO WS-BEN-CODE.
001826     MOVE CM-INSURED-ISSUE-AGE     TO P-INSURED-AGE.
001827     MOVE CM-USER-FIELD            TO P-USER-CODE.
001828
001829     IF CM-LF-ALT-BENEFIT-AMT NOT NUMERIC
001830         MOVE ZEROS                TO CM-LF-ALT-BENEFIT-AMT.
001831
001832     IF CL-CLAIM-TYPE = 'A' OR 'I' OR 'G' OR 'F'
001833         MOVE  CM-AH-BENEFIT-CD      TO  WS-BEN-CODE
001834         MOVE  '5'                   TO  WS-CF-RECORD-TYPE
001835         MOVE  CM-AH-ORIG-TERM       TO  P-TERM
001836                                         CP-ORIGINAL-TERM
001837         MOVE CM-AH-LOAN-EXPIRE-DT   TO  DC-BIN-DATE-1
001838         MOVE  CM-AH-BENEFIT-AMT     TO  P-ORIG-BENEF-AMT
001839         MOVE  CM-AH-CURRENT-STATUS  TO  WS-STATUS
001840         MOVE WS-BIN-CURRENT-DT      TO  CP-VALUATION-DT
001841     ELSE
001842         MOVE  CM-LF-BENEFIT-CD      TO  WS-BEN-CODE
001843         MOVE  '4'                   TO  WS-CF-RECORD-TYPE
001844         MOVE  CM-LF-ORIG-TERM       TO  P-TERM
001845                                         CP-ORIGINAL-TERM
001846         MOVE CM-LF-LOAN-EXPIRE-DT   TO  DC-BIN-DATE-1
001847         COMPUTE P-ORIG-BENEF-AMT =
001848                CM-LF-BENEFIT-AMT + CM-LF-ALT-BENEFIT-AMT
001849         MOVE  CM-LF-CURRENT-STATUS  TO  WS-STATUS
001850         MOVE CL-INCURRED-DT         TO  CP-VALUATION-DT
001851     END-IF
001852
001853     MOVE ' '                       TO DC-OPTION-CODE.
001854     PERFORM 8100-DATE-RTN  THRU 8100-EXIT.
001855     MOVE DC-GREG-DATE-1-EDIT       TO P-EXPIRE.
001856
001857     MOVE CM-CERT-EFF-DT           TO CP-CERT-EFF-DT
001858
001859     MOVE 'CERT ENTRY    - '        TO L22-ENTRY-LIT.
001860     IF CM-ENTRY-DT = LOW-VALUES OR SPACES
001861         MOVE SPACES TO    P-CERT-ENTRY-YY   P-CERT-SL
001862                           P-CERT-ENTRY-MM
001863     ELSE
001864         MOVE CM-ENTRY-DT           TO DC-BIN-DATE-1
001865         MOVE ' '                   TO DC-OPTION-CODE
001866         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
001867         MOVE DC-GREG-DATE-1-MDY    TO WS-MM-DD-YY
001868         MOVE WS-MM                 TO P-CERT-ENTRY-MM
001869         MOVE WS-YY                 TO P-CERT-ENTRY-YY
001870         MOVE '/' TO P-CERT-SL.
001871
001872     MOVE 'CERT ISSUE   - '         TO L15-ISSUE-LIT.
001873     MOVE CM-CERT-EFF-DT            TO DC-BIN-DATE-1.
001874     MOVE ' '                       TO DC-OPTION-CODE.
001875     PERFORM 8100-DATE-RTN  THRU 8100-EXIT.
001876     MOVE DC-GREG-DATE-1-EDIT       TO P-CERT-ISSUE-DT.
001877
001878     MOVE CM-LOAN-1ST-PMT-DT        TO CP-FIRST-PAY-DATE.
001879
001880**     READ CNTL RECORD TO OBTAIN FREE LOOK DAYS
001881
001882     MOVE WS-COMP-ID             TO WS-CF-COMPANY-ID.
001883     MOVE cm-STATE                  TO WS-CF-PROCESSOR.
001884     MOVE ZEROS                     TO WS-CF-SEQUENCE-NO.
001885     MOVE '3'                       TO WS-CF-RECORD-TYPE.
001886     MOVE SPACES                    TO WS-CNTL-ERROR-SW.
001887
001888     PERFORM 1300-READ-CNTL  THRU 1300-EXIT.
001889
001890     IF NO-COMPANY-RECORD
001891        MOVE '*** ERROR NO STATE REC ***' TO WS-return-stuff
001892        GO TO 0000-end
001893     ELSE
001894        MOVE CF-ST-FREE-LOOK-PERIOD TO CP-FREE-LOOK.
001895
001896     MOVE '1'                       TO CP-REM-TRM-CALC-OPTION.
001897     MOVE WS-COMP-ID             TO CP-COMPANY-ID.
001898     MOVE '4'                       TO CP-REM-TERM-METHOD.
001899     PERFORM 9800-LINK-REM-TERM THRU 9800-EXIT.
001900
001901     IF CP-REMAINING-TERM-3 NOT GREATER THAN ZEROS
001902        MOVE ZEROS      TO  P-REM
001903       ELSE
001904        MOVE CP-REMAINING-TERM-3 TO  P-REM.
001905
001906     MOVE SPACES           TO P-CERT-STAT.
001907
001908     IF WS-STATUS = '1' OR '4'
001909        IF CP-REMAINING-TERM-3  NOT GREATER THAN ZEROS
001910           MOVE 'EXPIRED'  TO P-CERT-STAT
001911          ELSE
001912           MOVE 'ACTIVE'   TO P-CERT-STAT.
001913
001914     IF WS-STATUS = '2'
001915         MOVE 'PEND'     TO P-CERT-STAT.
001916
001917     IF WS-STATUS = '3'
001918         MOVE 'RESTORE ' TO P-CERT-STAT.
001919
001920     IF WS-STATUS = '5'
001921         MOVE 'REISSUE ' TO P-CERT-STAT.
001922
001923     IF WS-STATUS = '6'
001924         MOVE 'LMP DIS'  TO P-CERT-STAT.
001925
001926     IF WS-STATUS = '7'
001927         MOVE 'DEATH'    TO P-CERT-STAT.
001928
001929     IF WS-STATUS = '8'
001930         MOVE 'CANCEL'   TO P-CERT-STAT.
001931
001932     IF WS-STATUS = '9'
001933         MOVE 'RE-ONLY ' TO P-CERT-STAT.
001934
001935     IF WS-STATUS = 'D'
001936         MOVE 'DECLINE'  TO P-CERT-STAT.
001937
001938     IF WS-STATUS = 'V'
001939         MOVE 'VOID'     TO P-CERT-STAT.
001940
001941     MOVE SPACES                 TO WS-CANC-DT.
001942
001943     IF CL-CLAIM-TYPE = 'A' OR 'I' OR 'G' OR 'F'
001944        GO TO 2130-AH-CHECK
001945     END-IF
001946
001947     IF CM-LF-CURRENT-STATUS = '8'
001948        IF CM-LF-CANCEL-DT NOT = LOW-VALUES
001949            MOVE CM-LF-CANCEL-DT TO WS-CANC-DT.
001950
001951     IF CM-LF-CURRENT-STATUS = '7'
001952        IF CM-LF-DEATH-DT NOT = LOW-VALUES
001953            MOVE CM-LF-DEATH-DT     TO WS-CANC-DT.
001954
001955     GO TO 2130-CONV-DATE.
001956
001957 2130-AH-CHECK.
001958     IF CM-AH-CURRENT-STATUS = '8'
001959        IF CM-AH-CANCEL-DT NOT = LOW-VALUES
001960            MOVE CM-AH-CANCEL-DT TO WS-CANC-DT.
001961
001962     IF CM-AH-CURRENT-STATUS = '6' OR '7'
001963        IF CM-AH-SETTLEMENT-DT NOT = LOW-VALUES
001964            MOVE CM-AH-SETTLEMENT-DT TO WS-CANC-DT.
001965
001966 2130-CONV-DATE.
001967     MOVE 'CERT CANCEL-'       TO L21-CANC-LIT.
001968     IF WS-CANC-DT = LOW-VALUES OR SPACES  OR ZEROS
001969         MOVE SPACES TO P-CERT-CANC-DT
001970     ELSE
001971         MOVE WS-CANC-DT TO DC-BIN-DATE-1
001972         MOVE ' '        TO DC-OPTION-CODE
001973         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
001974         MOVE DC-GREG-DATE-1-EDIT   TO P-CERT-CANC-DT.
001975
001976     MOVE 'ACCOUNT       - '        TO L19-ACCT-LIT.
001977     MOVE CM-ACCOUNT     TO P-ACCT.
001978     MOVE CM-STATE       TO P-STATE.
001979     MOVE CM-GROUPING    TO P-GROUP.
001980     MOVE CM-REIN-TABLE  TO P-REIN-CODE.
001981     MOVE CM-ENTRY-BATCH TO P-CERT-BATCH.
001982     MOVE CM-MEMBER-NO   TO P-MEMBER-NO.
001983
001984 2130-GET-BENEFIT-DESC.
001985     IF WS-BEN-CODE = ZERO
001986         MOVE '** NONE **' TO P-COVERAGE
001987         GO TO 2130-EXIT.
001988
001989     MOVE WS-ACCESS            TO WS-CF-PROCESSOR.
001990     MOVE WS-COMP-ID        TO WS-CF-COMPANY-ID.
001991     MOVE +0                   TO WS-CF-SEQUENCE-NO.
001992     MOVE SPACES               TO WS-CNTL-ERROR-SW.
001993
001994     
      * EXEC CICS HANDLE CONDITION
001995*         ENDFILE (2130-EXIT)
001996*         NOTFND  (2130-EXIT)
001997*    END-EXEC.
      *    MOVE '"$''I                  ! % #00006820' TO DFHEIV0
           MOVE X'222427492020202020202020' &
                X'202020202020202020202120' &
                X'2520233030303036383230' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
001998
001999     
      * EXEC CICS READ
002000*         DATASET ('ELCNTL')
002001*         into    (CONTROL-FILE)
002002*         RIDFLD  (WS-CF-CONTROL-PRIMARY)
002003*         GTEQ
002004*    END-EXEC.
           MOVE LENGTH OF
            CONTROL-FILE
             TO DFHEIV11
           MOVE 'ELCNTL' TO DFHEIV1
      *    MOVE '&"IL       G          (   #00006825' TO DFHEIV0
           MOVE X'2622494C2020202020202047' &
                X'202020202020202020202820' &
                X'2020233030303036383235' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 CONTROL-FILE, 
                 DFHEIV11, 
                 WS-CF-CONTROL-PRIMARY, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
002005
002006     IF WS-CF-COMPANY-ID  NOT = CF-COMPANY-ID  OR
002007        WS-CF-RECORD-TYPE NOT = CF-RECORD-TYPE
002008             GO TO 2130-EXIT.
002009
002010     PERFORM 2135-DUMMY THRU 2135-EXIT
002011         VARYING SUB1 FROM 1 BY 1 UNTIL
002012         ((SUB1 GREATER 8) OR
002013              (CF-BENEFIT-CODE (SUB1) = WS-BEN-CODE)).
002014
002015     IF SUB1 NOT = 9
002016         MOVE CF-BENEFIT-DESCRIP (SUB1) TO P-COVERAGE
002017     ELSE
002018         MOVE 'CD MISSING'   TO P-COVERAGE.
002019
002020 2130-EXIT.
002021      EXIT.
002022
002023 2135-DUMMY.
002024 2135-EXIT.
002025      EXIT.
002026      EJECT
002027 2150-MOVE-TR0-INFO.
002028     IF NOT RESERVE-EXPENSE-TR
002029         MOVE  '* TRAILER 0 NOT FIRST, ABORT*' TO WS-PASSED-DATA
002030         GO TO 9999-FINALIZE
002031     ELSE
002032         MOVE AT-ITD-PAID-EXPENSES      TO  P-TOT-EXPENSE
002033         MOVE AT-INITIAL-MANUAL-RESERVE TO  P-ORIG-MANUAL
002034         MOVE AT-ITD-CHARGEABLE-EXPENSE TO  P-CHG-EXPENSE
002035         MOVE AT-CURRENT-MANUAL-RESERVE TO  P-REM-MANUAL
002036         MOVE AT-ITD-ADDITIONAL-RESERVE TO  P-ADD-RESERVE.
002037
002038     IF FULL-PRINT-REQUIRED
002039         PERFORM  2510-MOVE-OC-HISTORY  THRU 2510-EXIT.
002040
002041 2150-EXIT.
002042      EXIT.
002043
002044     EJECT
002045 2300-PRINT-TO-LINE-26.
002046
002047     MOVE  ZEROS  TO WS-PAGE-CNT.
002048     PERFORM 4013-HEADING-RTN  THRU 4013-EXIT.
002049
002050     MOVE HEAD-LINE-7            TO CLM-STAT-EXT-OUT-RECORD
002051     perform 5000-write-a-line   thru 5000-exit
002052
002053     MOVE LINE-9                 TO CLM-STAT-EXT-OUT-RECORD
002054     perform 5000-write-a-line   thru 5000-exit
002055
002056     MOVE HEAD-LINE-10           TO CLM-STAT-EXT-OUT-RECORD
002057     perform 5000-write-a-line   thru 5000-exit
002058
002059     MOVE LINE-12                TO CLM-STAT-EXT-OUT-RECORD
002060     perform 5000-write-a-line   thru 5000-exit
002061
002062     MOVE LINE-13                TO CLM-STAT-EXT-OUT-RECORD
002063     perform 5000-write-a-line   thru 5000-exit
002064
002065     MOVE LINE-14                TO CLM-STAT-EXT-OUT-RECORD
002066     perform 5000-write-a-line   thru 5000-exit
002067
002068     MOVE LINE-15                TO CLM-STAT-EXT-OUT-RECORD
002069     perform 5000-write-a-line   thru 5000-exit
002070
002071     MOVE LINE-16                TO CLM-STAT-EXT-OUT-RECORD
002072     perform 5000-write-a-line   thru 5000-exit
002073
002074     MOVE LINE-17                TO CLM-STAT-EXT-OUT-RECORD
002075     perform 5000-write-a-line   thru 5000-exit
002076
002077     MOVE LINE-19                TO CLM-STAT-EXT-OUT-RECORD
002078     perform 5000-write-a-line   thru 5000-exit
002079
002080     MOVE LINE-20                TO CLM-STAT-EXT-OUT-RECORD
002081     perform 5000-write-a-line   thru 5000-exit
002082
002083     MOVE LINE-21                TO CLM-STAT-EXT-OUT-RECORD
002084     perform 5000-write-a-line   thru 5000-exit
002085
002086     MOVE LINE-22                TO CLM-STAT-EXT-OUT-RECORD
002087     perform 5000-write-a-line   thru 5000-exit
002088
002089     MOVE LINE-23                TO CLM-STAT-EXT-OUT-RECORD
002090     perform 5000-write-a-line   thru 5000-exit
002091
002092     MOVE LINE-23A               TO CLM-STAT-EXT-OUT-RECORD
002093     perform 5000-write-a-line   thru 5000-exit
002094
002095     MOVE LINE-25                TO CLM-STAT-EXT-OUT-RECORD
002096     perform 5000-write-a-line   thru 5000-exit
002097
002098     MOVE LINE-26                TO CLM-STAT-EXT-OUT-RECORD
002099     perform 5000-write-a-line   thru 5000-exit
002100
002101     .
002102 2300-EXIT.
002103      EXIT.
002104     EJECT
002105 2500-PROCESS-N-PRINT-TRAILERS.
002106**   ADD  1  TO WS-AT-SEQ-NO.
002107     PERFORM  1750-READNEXT-TRLR  THRU 1750-EXIT.
002108
002109     IF END-OF-TRLR-FILE
002110         MOVE  'X'  TO  WS-TRAILER-KEY-CHG-SW
002111         GO TO 2500-EXIT.
002112
002113     MOVE AT-CONTROL-PRIMARY   TO  WS-NEW-AT-CONTROL-PRIMARY.
002114     IF WS-NEW-AT-CONTROL-WO-SEQ  NOT =
002115                                  WS-AT-CONTROL-SAVED-WO-SEQ
002116         MOVE 'X'  TO WS-TRAILER-KEY-CHG-SW
002117         GO TO 2500-EXIT.
002118
002119*TR2
002120     IF PAYMENT-TR
002121         PERFORM 2520-PROCESS-TR2   THRU 2520-EXIT
002122         GO TO 2500-EXIT.
002123*TR3
002124     IF AUTO-PAY-TR          AND
002125        FULL-PRINT-REQUIRED  AND
002126        AP-INDEX  LESS THAN 11
002127         PERFORM 2530-PROCESS-TR3  THRU 2530-EXIT
002128         GO TO 2500-EXIT.
002129*TR4
002130     IF CORRESPONDENCE-TR
002131         PERFORM 2540-PROCESS-TR4    THRU 2540-EXIT
002132         GO TO 2500-EXIT.
002133*TR5
002134     IF ADDRESS-TR            AND
002135        FULL-PRINT-REQUIRED   AND
002136        AD-INDEX  LESS THAN 60
002137         PERFORM 2550-PROCESS-TR5    THRU 2550-EXIT
002138         GO TO 2500-EXIT.
002139*TR6
002140     IF GENERAL-INFO-TR
002141         PERFORM 2560-PROCESS-TR6     THRU 2560-EXIT
002142         GO TO 2500-EXIT.
002143*TR7
002144     IF AUTO-PROMPT-TR
002145         PERFORM 2570-PROCESS-TR7     THRU 2570-EXIT
002146         GO TO 2500-EXIT.
002147*TR8
002148     IF DENIAL-TR
002149         PERFORM 2580-PROCESS-TR8    THRU 2580-EXIT
002150         GO TO 2500-EXIT.
002151*TR9
002152     IF INCURRED-CHG-TR
002153         PERFORM 2590-PROCESS-TR9    THRU 2590-EXIT
002154         GO TO 2500-EXIT.
002155*TRA
002156     IF FORM-CONTROL-TR
002157         PERFORM 2600-PROCESS-TRA    THRU 2600-EXIT
002158         GO TO 2500-EXIT.
002159
002160 2500-EXIT.
002161      EXIT.
002162
002163 2510-MOVE-OC-HISTORY.
002164     MOVE  1  TO OC-SUB.
002165     SET  OC-INDEX TO 1.
002166     PERFORM  2511-LOAD-OC-TABLE  THRU 2511-EXIT  6 TIMES.
002167
002168 2510-EXIT.
002169      EXIT.
002170
002171 2511-LOAD-OC-TABLE.
002172     IF AT-OPEN-CLOSE-DATE (OC-SUB) = SPACES OR LOW-VALUES
002173          ADD 1 TO OC-SUB
002174          GO TO 2511-EXIT.
002175
002176     MOVE  'X'  TO END-OC-TABLE-SW.
002177
002178     MOVE AT-OPEN-CLOSE-DATE (OC-SUB)   TO
002179                        OC-TBL-OPCL-DT (OC-INDEX).
002180     MOVE AT-OPEN-CLOSE-TYPE (OC-SUB)   TO
002181                        OC-TBL-OPCL-TYPE (OC-INDEX).
002182     MOVE AT-OPEN-CLOSE-REASON (OC-SUB) TO
002183                        OC-TBL-OPCL-REASON (OC-INDEX).
002184
002185     SET OC-INDEX  UP BY 1.
002186     ADD 1  TO OC-SUB.
002187
002188 2511-EXIT.
002189      EXIT.
002190
002191     EJECT
002192 2520-PROCESS-TR2.
002193******************************************************************
002194***          BUILD PAYMENT INFORMATION                         ***
002195******************************************************************
002196
002197     IF  WS-LINE-CNT  GREATER THAN  50
002198         PERFORM  4013-HEADING-RTN  THRU 4013-EXIT
002199         PERFORM  1014-HEADING-CONT THRU 1014-EXIT.
002200
002201     IF AT-PAYMENT-TYPE = 'T'
002202         MOVE 'TRANSFR PMT' TO P-PAY-ACT-TYPE
002203     ELSE
002204       IF AT-PAYMENT-TYPE = 'I'
002205          MOVE 'INTERST PMT' TO P-PAY-ACT-TYPE
002206       ELSE
002207          MOVE AT-PAYMENT-TYPE TO WS-SUB
002208          IF WS-SUB < 1 OR > 6
002209              MOVE 2 TO WS-SUB
002210          END-IF
002211          MOVE PAY-DESC (WS-SUB) TO P-PAY-ACT-TYPE
002212       END-IF
002213     END-IF.
002214
002215     MOVE AT-PAYEES-NAME   TO P-PAY-PAYEE.
002216     MOVE AT-PAYEE-TYPE-CD TO P-PAY-PAYEE-CD.
002217
002218     IF AT-RECORDED-DT  = LOW-VALUES OR SPACES
002219         MOVE SPACE TO P-PAY-PMT-DT
002220     ELSE
002221         MOVE  AT-RECORDED-DT      TO DC-BIN-DATE-1
002222         MOVE  ' '   TO DC-OPTION-CODE
002223         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002224         MOVE DC-GREG-DATE-1-EDIT  TO P-PAY-PMT-DT.
002225
002226     MOVE AT-RECORDED-BY  TO P-PAY-BY.
002227
002228     IF AT-CHECK-WRITTEN-DT  = LOW-VALUES OR SPACES
002229         MOVE ZEROS TO P-PAY-WRIT-DT
002230     ELSE
002231         MOVE AT-CHECK-WRITTEN-DT TO  DC-BIN-DATE-1
002232         MOVE  ' '                TO DC-OPTION-CODE
002233         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002234         MOVE DC-GREG-DATE-1-EDIT TO  P-PAY-WRIT-DT.
002235
002236     MOVE AT-CHECK-NO         TO  P-PAY-CHECK.
002237     MOVE AT-AMOUNT-PAID      TO  P-PAY-PMT-AMT.
002238     MOVE AT-ADDL-RESERVE     TO  P-PAY-RESERVE.
002239     MOVE AT-EXPENSE-PER-PMT  TO  P-PAY-EXPEN.
002240
002241     IF AT-PMT-ACCEPT-DT  = LOW-VALUES OR SPACES
002242         MOVE SPACES             TO P-PAY-CREDIT-DT
002243     ELSE
002244         MOVE AT-PMT-ACCEPT-DT   TO DC-BIN-DATE-1
002245         MOVE  ' '               TO DC-OPTION-CODE
002246         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002247         MOVE DC-GREG-DATE-1-EDIT TO  P-PAY-CREDIT-DT.
002248
002249     IF AT-VOID-DT = LOW-VALUES OR SPACES
002250         MOVE SPACES              TO  P-PAY-VOID-DT
002251                                      P-PAY-REASON
002252     ELSE
002253         MOVE AT-VOID-DT          TO  DC-BIN-DATE-1
002254         MOVE  ' '                TO DC-OPTION-CODE
002255         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002256         MOVE DC-GREG-DATE-1-EDIT TO  P-PAY-VOID-DT
002257         MOVE AT-VOID-REASON      TO  P-PAY-REASON.
002258
002259     IF AT-PAYMENT-TYPE EQUAL '5' OR '6'
002260        MOVE AT-EXPENSE-TYPE    TO P-EXP-TYPE
002261        GO TO 2521-CONTINUE.
002262
002263     MOVE AT-PAID-FROM-DT     TO DC-BIN-DATE-1
002264     MOVE  ' '                TO DC-OPTION-CODE
002265     PERFORM 8100-DATE-RTN    THRU 8100-EXIT
002266     MOVE DC-GREG-DATE-1-EDIT TO  P-PAY-FROM-DT
002267
002268     IF NOT PI-USES-PAID-TO
002269        MOVE AT-PAID-THRU-DT     TO DC-BIN-DATE-1
002270        MOVE  ' '                TO DC-OPTION-CODE
002271        PERFORM 8100-DATE-RTN    THRU 8100-EXIT
002272        MOVE DC-GREG-DATE-1-EDIT TO  P-PAY-THRU-DT
002273     ELSE
002274        MOVE '  TO  - '          TO L-5B-PD-THRU
002275        MOVE AT-PAID-THRU-DT     TO DC-BIN-DATE-1
002276        MOVE +1                  TO DC-ELAPSED-DAYS
002277        MOVE +0                  TO DC-ELAPSED-MONTHS
002278        MOVE  '6'                TO DC-OPTION-CODE
002279        PERFORM 8100-DATE-RTN    THRU 8100-EXIT
002280        MOVE DC-GREG-DATE-1-EDIT TO  P-PAY-THRU-DT.
002281
002282     MOVE AT-DAYS-IN-PERIOD   TO  P-PAY-DAYS
002283     MOVE AT-DAILY-RATE       TO  P-PAY-RATE.
002284
002285 2521-CONTINUE.
002286
002287     IF ONLINE-MANUAL-PMT
002288          MOVE 'ONLINE'   TO P-PAY-ORIGIN.
002289     IF ONLINE-AUTO-PMT
002290          MOVE 'ONLINE'   TO P-PAY-ORIGIN.
002291     IF OFFLINE-PMT
002292          MOVE 'OFFLINE'  TO P-PAY-ORIGIN.
002293
002294     IF AT-CV-PMT-CODE IS NOT EQUAL TO ' '
002295         GO TO 2522-CONTINUE.
002296
002297     IF PARTIAL-PAYMENT
002298          MOVE 'PARTIAL PAYMENT'         TO P-PAY-TYPE.
002299     IF FINAL-PAYMENT
002300          MOVE 'FINAL PAYMENT'           TO P-PAY-TYPE.
002301     IF LUMP-SUM-PAYMENT
002302          MOVE 'LUMP SUM PAYMENT'        TO P-PAY-TYPE.
002303     IF ADDITIONAL-PAYMENT
002304          MOVE 'ADDITIONAL PAYMENT'      TO P-PAY-TYPE.
002305     IF CHARGEABLE-EXPENSE
002306          MOVE 'CHARGEABLE EXPENSE'      TO P-PAY-TYPE.
002307     IF NON-CHARGEABLE-EXPENSE
002308          MOVE 'NON CHARGEABLE EXPENSE'  TO P-PAY-TYPE.
002309
002310     MOVE P-PAY-LINE-1           TO CLM-STAT-EXT-OUT-RECORD
002311     perform 5000-write-a-line   thru 5000-exit
002312
002313     MOVE P-PAY-LINE-2           TO CLM-STAT-EXT-OUT-RECORD
002314     perform 5000-write-a-line   thru 5000-exit
002315
002316     MOVE P-PAY-LINE-3           TO CLM-STAT-EXT-OUT-RECORD
002317     perform 5000-write-a-line   thru 5000-exit
002318
002319     MOVE P-PAY-LINE-4           TO CLM-STAT-EXT-OUT-RECORD
002320     perform 5000-write-a-line   thru 5000-exit
002321
002322     IF AT-PAYMENT-TYPE = '5' OR '6'
002323        MOVE P-PAY-LINE-5C       TO CLM-STAT-EXT-OUT-RECORD
002324        perform 5000-write-a-line
002325                                 thru 5000-exit
002326     ELSE
002327        IF P-PAY-VOID-DT = SPACES
002328           MOVE P-PAY-LINE-5B    TO CLM-STAT-EXT-OUT-RECORD
002329           perform 5000-write-a-line
002330                                 thru 5000-exit
002331        ELSE
002332           MOVE P-PAY-LINE-5A    TO CLM-STAT-EXT-OUT-RECORD
002333           perform 5000-write-a-line
002334                                 thru 5000-exit
002335           MOVE P-PAY-LINE-5B    TO CLM-STAT-EXT-OUT-RECORD
002336           perform 5000-write-a-line
002337                                 thru 5000-exit
002338        end-if
002339     end-if
002340
002341     GO TO 2520-EXIT.
002342
002343 2522-CONTINUE.
002344
002345     IF AT-CV-PMT-CODE IS EQUAL TO '1'
002346         MOVE 'FULL DEATH PAYMENT'       TO  P-PAY-TYPE.
002347     IF AT-CV-PMT-CODE IS EQUAL TO '2'
002348         MOVE 'HALF DEATH PAYMENT'       TO  P-PAY-TYPE.
002349     IF AT-CV-PMT-CODE IS EQUAL TO '3'
002350         MOVE 'FULL AD&D PAYMENT'        TO  P-PAY-TYPE.
002351     IF AT-CV-PMT-CODE IS EQUAL TO '4'
002352         MOVE 'HALF AD&D PAYMENT'        TO  P-PAY-TYPE.
002353     IF AT-CV-PMT-CODE IS EQUAL TO '5'
002354         MOVE 'FULL RIDER PAYMENT'       TO  P-PAY-TYPE.
002355     IF AT-CV-PMT-CODE IS EQUAL TO '6'
002356         MOVE 'HALF RIDER PAYMENT'       TO  P-PAY-TYPE.
002357     IF AT-CV-PMT-CODE IS EQUAL TO '7'
002358         MOVE 'NON CHARGEABLE EXPENSE'   TO  P-PAY-TYPE.
002359     IF AT-CV-PMT-CODE IS EQUAL TO '8'
002360         MOVE 'ADDITIONAL PAYMENT'       TO  P-PAY-TYPE.
002361
002362     MOVE P-PAY-LINE-1           TO CLM-STAT-EXT-OUT-RECORD
002363     perform 5000-write-a-line   thru 5000-exit
002364
002365     MOVE P-PAY-LINE-2           TO CLM-STAT-EXT-OUT-RECORD
002366     perform 5000-write-a-line   thru 5000-exit
002367
002368     MOVE P-PAY-LINE-3           TO CLM-STAT-EXT-OUT-RECORD
002369     perform 5000-write-a-line   thru 5000-exit
002370
002371     MOVE P-PAY-LINE-4           TO CLM-STAT-EXT-OUT-RECORD
002372     perform 5000-write-a-line   thru 5000-exit
002373
002374     IF AT-CV-PMT-CODE IS EQUAL TO '8'
002375        MOVE P-PAY-LINE-5C       TO CLM-STAT-EXT-OUT-RECORD
002376        perform 5000-write-a-line
002377                                 thru 5000-exit
002378     ELSE
002379        IF P-PAY-VOID-DT IS EQUAL TO SPACES
002380           MOVE P-PAY-LINE-5B    TO CLM-STAT-EXT-OUT-RECORD
002381           perform 5000-write-a-line
002382                                 thru 5000-exit
002383        ELSE
002384           MOVE P-PAY-LINE-5A    TO CLM-STAT-EXT-OUT-RECORD
002385           perform 5000-write-a-line
002386                                 thru 5000-exit
002387           MOVE P-PAY-LINE-5B    TO CLM-STAT-EXT-OUT-RECORD
002388           perform 5000-write-a-line
002389                                 thru 5000-exit
002390        end-if
002391     end-if
002392
002393     .
002394 2520-EXIT.
002395      EXIT.
002396
002397     EJECT
002398 2530-PROCESS-TR3.
002399******************************************************************
002400***          BUILD AUTO PAYMENT SCHEDULE INFORMATION           ***
002401******************************************************************
002402
002403     MOVE  'X'                    TO END-AP-TABLE-SW.
002404     MOVE AT-RECORDED-DT          TO AP-TBL-EST-DT (AP-INDEX).
002405     MOVE AT-RECORDED-BY          TO AP-TBL-EST-BY (AP-INDEX).
002406     MOVE AT-TERMINATED-DT        TO AP-TBL-TERM-DT (AP-INDEX).
002407     MOVE AT-SCHEDULE-START-DT TO
002408                       AP-TBL-SCHED-START-DT (AP-INDEX).
002409     MOVE AT-SCHEDULE-END-DT      TO
002410                       AP-TBL-SCHED-END-DT (AP-INDEX).
002411     MOVE AT-LAST-PMT-TYPE        TO AP-TBL-LAST-TYPE (AP-INDEX).
002412     MOVE AT-FIRST-PMT-AMT        TO AP-TBL-FIRST-AMT (AP-INDEX).
002413     MOVE AT-DAYS-IN-1ST-PMT      TO AP-TBL-FIRST-DAYS (AP-INDEX).
002414     MOVE AT-1ST-PAY-THRU-DT      TO AP-TBL-FIRST-DT (AP-INDEX).
002415     MOVE AT-REGULAR-PMT-AMT      TO AP-TBL-REG-AMT (AP-INDEX).
002416     MOVE AT-INTERVAL-MONTHS      TO AP-TBL-INT-MO (AP-INDEX).
002417     SET  AP-INDEX  UP BY 1.
002418
002419 2530-EXIT.
002420      EXIT.
002421
002422     EJECT
002423 2540-PROCESS-TR4.
002424******************************************************************
002425***          BUILD CORRESPONDENCE INFORMATION                  ***
002426******************************************************************
002427
002428     IF  WS-LINE-CNT  GREATER THAN  50
002429         PERFORM  4013-HEADING-RTN  THRU 4013-EXIT
002430         PERFORM  1014-HEADING-CONT THRU 1014-EXIT.
002431
002432     MOVE AT-RECORDED-DT      TO DC-BIN-DATE-1
002433     MOVE  ' '                TO DC-OPTION-CODE
002434     PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002435     MOVE DC-GREG-DATE-1-EDIT TO  P-LET-LET-DT.
002436     MOVE AT-RECORDED-BY      TO  P-LET-BY.
002437
002438     MOVE AT-ADDRESEE-TYPE           TO P-LET-ADSEE-CD
002439     MOVE AT-STD-LETTER-FORM         TO P-LET-FORM.
002440     MOVE AT-LETTER-ARCHIVE-NO       TO P-LET-ARCH.
002441     MOVE AT-REASON-TEXT             TO P-LET-RE.
002442
002443     IF AT-LETTER-SENT-DT = LOW-VALUES OR SPACES
002444         MOVE 'MAIL RCVD ' TO P-LET-ACT-TYPE
002445         MOVE ZEROS TO P-LET-SENT-DT
002446     ELSE
002447         MOVE 'LETTER    ' TO P-LET-ACT-TYPE
002448         MOVE AT-LETTER-SENT-DT      TO DC-BIN-DATE-1
002449         MOVE  ' '                   TO DC-OPTION-CODE
002450         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002451         MOVE DC-GREG-DATE-1-EDIT TO  P-LET-SENT-DT.
002452
002453     IF AT-AUTO-RE-SEND-DT = LOW-VALUES OR SPACES
002454         MOVE ZEROS TO P-LET-SEND-DT
002455     ELSE
002456         MOVE AT-AUTO-RE-SEND-DT     TO DC-BIN-DATE-1
002457         MOVE  ' '                   TO DC-OPTION-CODE
002458         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002459         MOVE DC-GREG-DATE-1-EDIT TO  P-LET-SEND-DT.
002460
002461     IF AT-RECEIPT-FOLLOW-UP = LOW-VALUES OR SPACES
002462         MOVE SPACE TO P-LET-FOL-DT
002463     ELSE
002464         MOVE AT-RECEIPT-FOLLOW-UP     TO DC-BIN-DATE-1
002465         MOVE  ' '                     TO DC-OPTION-CODE
002466         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002467         MOVE DC-GREG-DATE-1-EDIT TO  P-LET-FOL-DT.
002468
002469     IF AT-LETTER-ANSWERED-DT  = LOW-VALUES OR SPACES
002470         MOVE SPACE TO P-LET-ANS-DT
002471     ELSE
002472         MOVE AT-LETTER-ANSWERED-DT    TO DC-BIN-DATE-1
002473         MOVE  ' '                     TO DC-OPTION-CODE
002474         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002475         MOVE DC-GREG-DATE-1-EDIT TO  P-LET-ANS-DT.
002476
002477     MOVE SPACES  TO P-LET-ORIGIN
002478                     P-LET-ADSEE.
002479
002480     IF  ONLINE-CREATION
002481          MOVE 'ONLINE '       TO P-LET-ORIGIN.
002482     IF  OFFLINE-CREATION
002483          MOVE 'OFFLINE'       TO P-LET-ORIGIN.
002484     IF  INSURED-ADDRESEE
002485          MOVE 'INSURED'       TO P-LET-ADSEE.
002486     IF  BENEFICIARY-ADDRESEE
002487          MOVE 'BENEFICIARY'   TO P-LET-ADSEE.
002488     IF  ACCOUNT-ADDRESEE
002489          MOVE 'ACCOUNT'       TO P-LET-ADSEE.
002490     IF  PHYSICIAN-ADDRESEE
002491          MOVE 'PHYSICIAN'     TO P-LET-ADSEE.
002492     IF  EMPLOYER-ADDRESEE
002493          MOVE 'EMPLOYER'      TO P-LET-ADSEE.
002494     IF  OTHER-ADDRESEE-1
002495          MOVE 'OTHER 1'       TO P-LET-ADSEE.
002496     IF  OTHER-ADDRESEE-2
002497          MOVE 'OTHER 2'       TO P-LET-ADSEE.
002498
002499     MOVE P-LET-LINE-1           TO CLM-STAT-EXT-OUT-RECORD
002500     perform 5000-write-a-line   thru 5000-exit
002501
002502     MOVE P-LET-LINE-2           TO CLM-STAT-EXT-OUT-RECORD
002503     perform 5000-write-a-line   thru 5000-exit
002504
002505     MOVE P-LET-LINE-3           TO CLM-STAT-EXT-OUT-RECORD
002506     perform 5000-write-a-line   thru 5000-exit
002507
002508     MOVE P-LET-LINE-4           TO CLM-STAT-EXT-OUT-RECORD
002509     perform 5000-write-a-line   thru 5000-exit
002510
002511     IF P-LET-RE = SPACES
002512        continue
002513     ELSE
002514        MOVE P-LET-LINE-5        TO CLM-STAT-EXT-OUT-RECORD
002515        perform 5000-write-a-line
002516                                 thru 5000-exit
002517     end-if
002518
002519     .
002520 2540-EXIT.
002521      EXIT.
002522
002523     EJECT
002524 2550-PROCESS-TR5.
002525******************************************************************
002526***          BUILD ADDRESS INFORMATION                         ***
002527******************************************************************
002528
002529     MOVE  'X'                  TO END-AD-TABLE-SW.
002530     MOVE  AT-ADDRESS-TYPE      TO AD-TBL-TYPE    (AD-INDEX).
002531     MOVE  AT-MAIL-TO-NAME      TO AD-TBL-NAME    (AD-INDEX).
002532     MOVE  AT-ADDRESS-LINE-1    TO AD-TBL-ADDR-1  (AD-INDEX).
002533     MOVE  AT-ADDRESS-LINE-2    TO AD-TBL-ADDR-2  (AD-INDEX).
002534     MOVE  SPACES               TO AD-TBL-CITY    (AD-INDEX).
002535     STRING AT-CITY ' ' AT-STATE
002536        DELIMITED BY '  ' INTO AD-TBL-CITY (AD-INDEX)
002537     END-STRING
002538
002539     MOVE SPACES                 TO WS-ZIP-WORK.
002540     IF AT-CANADIAN-POST-CODE
002541         MOVE AT-CAN-POSTAL-1    TO WS-CAN-POSTAL-1
002542         MOVE AT-CAN-POSTAL-2    TO WS-CAN-POSTAL-2
002543     ELSE
002544         MOVE AT-ZIP-CODE        TO WS-ZIP-PRIME
002545         IF AT-ZIP-PLUS4 NOT = SPACES  AND  ZEROS
002546             MOVE '-'            TO WS-ZIP-DASH
002547             MOVE AT-ZIP-PLUS4   TO WS-ZIP-PLUS4.
002548     MOVE WS-ZIP-WORK            TO AD-TBL-ZIP    (AD-INDEX).
002549
002550     MOVE  AT-PHONE-NO          TO AD-TBL-PHONE   (AD-INDEX).
002551     SET AD-INDEX  UP BY 1.
002552
002553 2550-EXIT.
002554      EXIT.
002555
002556     EJECT
002557 2560-PROCESS-TR6.
002558******************************************************************
002559***          BUILD CLAIM NOTES INFORMATION                     ***
002560******************************************************************
002561
002562     IF  WS-LINE-CNT  GREATER THAN  50
002563         PERFORM  4013-HEADING-RTN  THRU 4013-EXIT
002564         PERFORM  1014-HEADING-CONT THRU 1014-EXIT.
002565
002566     IF AT-MAINT-NOTE
002567         MOVE 'MAINT NOTES'     TO P-NOT-ACT-TYPE
002568     ELSE
002569       IF AT-CALL-NOTE
002570          IF AT-PHONE-CALL-IN
002571             MOVE 'CALL  IN   '  TO P-NOT-ACT-TYPE
002572          ELSE
002573             MOVE 'CALL  OUT  '  TO P-NOT-ACT-TYPE
002574          END-IF
002575       ELSE
002576         IF AT-CERT-CHANGE
002577             MOVE 'CERT CHANGE'  TO P-NOT-ACT-TYPE
002578         ELSE
002579           IF AT-APPROVAL-NOTE
002580              MOVE 'APPROVL REV' TO P-NOT-ACT-TYPE
002581           ELSE
002582             IF AT-NOTE-FILE-NOTE
002583                MOVE 'NOTE & FILE' TO P-NOT-ACT-TYPE
002584             ELSE
002585                MOVE 'NOTE       ' TO P-NOT-ACT-TYPE
002586             END-IF
002587           END-IF
002588         END-IF
002589       END-IF
002590     END-IF.
002591
002592     IF AT-SEQUENCE-NO = +90
002593         MOVE 'DIAGNOSIS  '     TO P-NOT-ACT-TYPE
002594     END-IF.
002595
002596     IF AT-SEQUENCE-NO = +91
002597         MOVE 'LOAN INFO  '     TO P-NOT-ACT-TYPE
002598     END-IF.
002599
002600     IF AT-SEQUENCE-NO = +92
002601         MOVE 'SPEC REVIEW'     TO P-NOT-ACT-TYPE
002602     END-IF.
002603
002604     IF AT-SEQUENCE-NO = +93
002605         MOVE 'VERIFY SSN '     TO P-NOT-ACT-TYPE
002606     END-IF.
002607
002608     IF AT-SEQUENCE-NO = +94
002609         MOVE 'CAUSL STATE'     TO P-NOT-ACT-TYPE
002610     END-IF.
002611
002612     MOVE  AT-INFO-LINE-1       TO P-NOT-TEXT-1.
002613     MOVE  AT-INFO-LINE-2       TO P-NOT-TEXT-2.
002614     MOVE  AT-RECORDED-BY       TO P-NOT-BY.
002615
002616     IF AT-RECORDED-DT = LOW-VALUES OR SPACES
002617         MOVE SPACES TO P-NOT-NOTE-DT
002618     ELSE
002619         MOVE  AT-RECORDED-DT    TO DC-BIN-DATE-1
002620         MOVE  ' '               TO DC-OPTION-CODE
002621         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002622         MOVE DC-GREG-DATE-1-EDIT TO  P-NOT-NOTE-DT
002623     end-if
002624
002625     IF (AT-SEQUENCE-NO = +95)
002626        AND (WS-COMP-ID = 'DCC' OR 'VPP')
002627        PERFORM VARYING A1 FROM +1 BY +1 UNTIL
002628           AT-NOTE-ERROR-NO (A1) = SPACES
002629           MOVE AT-NOTE-ERROR-NO (A1)
002630                                 TO EMI-ERROR
002631           MOVE '2'           TO EMI-SWITCH1
002632           IF AT-NOTE-ERROR-NO (A1) = '1653'
002633              EVALUATE TRUE
002634                 WHEN CL-CLAIM-TYPE = 'L'
002635                    MOVE '  LF  '
002636                              TO EMI-CLAIM-TYPE
002637                 WHEN CL-CLAIM-TYPE = 'I'
002638                    MOVE '  IU  '
002639                              TO EMI-CLAIM-TYPE
002640                 WHEN CL-CLAIM-TYPE = 'F'
002641                    MOVE '  FL  '
002642                              TO EMI-CLAIM-TYPE
002643                 WHEN OTHER
002644                    MOVE '  AH  '
002645                              TO EMI-CLAIM-TYPE
002646              END-EVALUATE
002647           END-IF
002648           PERFORM 9900-ERROR-FORMAT
002649                                 THRU 9900-EXIT
002650           MOVE EMI-LINE1 (8:64)
002651                             TO P-NOT-TEXT-1
002652           MOVE SPACES    TO P-NOT-TEXT-2
002653
002654           MOVE P-NOT-LINE-1   TO CLM-STAT-EXT-OUT-RECORD
002655           perform 5000-write-a-line
002656                                 thru 5000-exit
002657
002658           MOVE P-NOT-LINE-2   TO CLM-STAT-EXT-OUT-RECORD
002659           perform 5000-write-a-line
002660                                 thru 5000-exit
002661
002662           MOVE P-NOT-LINE-3   TO CLM-STAT-EXT-OUT-RECORD
002663           perform 5000-write-a-line
002664                                 thru 5000-exit
002665
002666        END-PERFORM
002667     END-IF.
002668
002669     MOVE P-NOT-LINE-1           TO CLM-STAT-EXT-OUT-RECORD
002670     perform 5000-write-a-line   thru 5000-exit
002671
002672     MOVE P-NOT-LINE-2           TO CLM-STAT-EXT-OUT-RECORD
002673     perform 5000-write-a-line   thru 5000-exit
002674
002675     MOVE P-NOT-LINE-3           TO CLM-STAT-EXT-OUT-RECORD
002676     perform 5000-write-a-line   thru 5000-exit
002677
002678     .
002679 2560-EXIT.
002680      EXIT.
002681
002682     EJECT
002683 2570-PROCESS-TR7.
002684******************************************************************
002685***          BUILD AUTO PROMPT INFORMATION                     ***
002686******************************************************************
002687
002688     IF  WS-LINE-CNT  GREATER THAN  50
002689         PERFORM  4013-HEADING-RTN  THRU 4013-EXIT
002690         PERFORM  1014-HEADING-CONT THRU 1014-EXIT.
002691
002692     MOVE  AT-PROMPT-LINE-1     TO P-PRO-TEXT-1.
002693     MOVE  AT-PROMPT-LINE-2     TO P-PRO-TEXT-2.
002694     MOVE  AT-RECORDED-BY       TO P-PRO-BY.
002695
002696     IF AT-RECORDED-DT = LOW-VALUES OR SPACES
002697         MOVE SPACES TO P-PRO-NOTE-DT
002698     ELSE
002699         MOVE  AT-RECORDED-DT    TO DC-BIN-DATE-1
002700         MOVE  ' '               TO DC-OPTION-CODE
002701         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002702         MOVE DC-GREG-DATE-1-EDIT TO  P-PRO-NOTE-DT.
002703
002704     IF AT-PROMPT-START-DT = LOW-VALUES OR SPACES
002705         MOVE SPACE               TO P-PRO-START-DT
002706     ELSE
002707         MOVE AT-PROMPT-START-DT  TO DC-BIN-DATE-1
002708         MOVE  ' '                TO DC-OPTION-CODE
002709         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002710         MOVE DC-GREG-DATE-1-EDIT TO  P-PRO-START-DT.
002711
002712     IF AT-PROMPT-END-DT = LOW-VALUES OR SPACES
002713         MOVE SPACE               TO P-PRO-END-DT
002714     ELSE
002715         MOVE AT-PROMPT-END-DT    TO DC-BIN-DATE-1
002716         MOVE  ' '                TO DC-OPTION-CODE
002717         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002718         MOVE DC-GREG-DATE-1-EDIT TO  P-PRO-END-DT.
002719
002720     MOVE P-PRO-LINE-1           TO CLM-STAT-EXT-OUT-RECORD
002721     perform 5000-write-a-line   thru 5000-exit
002722
002723     MOVE P-PRO-LINE-2           TO CLM-STAT-EXT-OUT-RECORD
002724     perform 5000-write-a-line   thru 5000-exit
002725
002726     MOVE P-PRO-LINE-3           TO CLM-STAT-EXT-OUT-RECORD
002727     perform 5000-write-a-line   thru 5000-exit
002728
002729     .
002730 2570-EXIT.
002731      EXIT.
002732
002733     EJECT
002734 2580-PROCESS-TR8.
002735******************************************************************
002736***          BUILD DENIAL INFORMATION                          ***
002737******************************************************************
002738
002739     IF  WS-LINE-CNT  GREATER THAN  50
002740         PERFORM  4013-HEADING-RTN  THRU 4013-EXIT
002741         PERFORM  1014-HEADING-CONT THRU 1014-EXIT.
002742
002743     IF AT-DENIAL-DT = LOW-VALUES OR SPACES
002744         MOVE SPACE               TO P-DEN-DEN-DT
002745     ELSE
002746         MOVE AT-DENIAL-DT        TO DC-BIN-DATE-1
002747         MOVE  ' '                TO DC-OPTION-CODE
002748         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002749         MOVE DC-GREG-DATE-1-EDIT TO P-DEN-DEN-DT.
002750
002751     MOVE AT-RECORDED-BY          TO P-DEN-BY.
002752
002753     IF AT-RETRACTION-DT = LOW-VALUES OR SPACES
002754         MOVE SPACE                  TO P-DEN-RECON-DT
002755     ELSE
002756         MOVE AT-RETRACTION-DT       TO DC-BIN-DATE-1
002757         MOVE  ' '                    TO DC-OPTION-CODE
002758         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002759         MOVE DC-GREG-DATE-1-EDIT TO  P-DEN-RECON-DT.
002760
002761     MOVE AT-DENIAL-REASON-CODE      TO P-DEN-CODE.
002762     MOVE AT-DENIAL-INFO-1           TO P-DEN-TEXT-1.
002763     MOVE AT-DENIAL-INFO-2           TO P-DEN-TEXT-2.
002764
002765     MOVE P-DEN-LINE-1           TO CLM-STAT-EXT-OUT-RECORD
002766     perform 5000-write-a-line   thru 5000-exit
002767
002768     MOVE P-DEN-LINE-2           TO CLM-STAT-EXT-OUT-RECORD
002769     perform 5000-write-a-line   thru 5000-exit
002770
002771     MOVE P-DEN-LINE-3           TO CLM-STAT-EXT-OUT-RECORD
002772     perform 5000-write-a-line   thru 5000-exit
002773
002774     .
002775 2580-EXIT.
002776      EXIT.
002777
002778 2590-PROCESS-TR9.
002779******************************************************************
002780***          BUILD RESERVE/EXPENSE/HISTORY INFORMATION         ***
002781******************************************************************
002782
002783     IF  WS-LINE-CNT  GREATER THAN  50
002784         PERFORM  4013-HEADING-RTN  THRU 4013-EXIT
002785         PERFORM  1014-HEADING-CONT THRU 1014-EXIT.
002786
002787     MOVE  AT-OLD-INIT-MAN-RESV      TO P-CHG-INIT-RES.
002788     MOVE  AT-OLD-TOTAL-PAID         TO P-CHG-TOT-PD.
002789     MOVE  AT-OLD-CURRENT-MAN-RESV   TO P-CHG-CUR-RES.
002790     MOVE  AT-OLD-ITD-PAID-EXPENSE   TO P-CHG-TOT-EXP.
002791     MOVE  AT-OLD-DAYS-PAID          TO P-CHG-DAYS-PD.
002792     MOVE  AT-OLD-ADDL-MAN-RESV      TO P-CHG-ADD-RES.
002793     MOVE  AT-OLD-CHARGABLE-EXPENSE  TO P-CHG-CHG-EXP.
002794     MOVE  AT-OLD-NO-OF-PMTS         TO P-CHG-PMTS.
002795     MOVE  AT-TRAILER-CNT-AT-CHG     TO P-CHG-TOT-TRLRS.
002796     MOVE  AT-RECORDED-BY            TO P-CHG-BY.
002797
002798     MOVE  AT-RECORDED-DT            TO DC-BIN-DATE-1
002799     MOVE  ' '                       TO DC-OPTION-CODE
002800     PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002801     MOVE DC-GREG-DATE-1-EDIT        TO P-CHG-REC-DT.
002802
002803     IF AT-OLD-INCURRED-DT = LOW-VALUES OR SPACES
002804         MOVE ZEROS                  TO P-CHG-INC-DT
002805     ELSE
002806         MOVE  AT-OLD-INCURRED-DT    TO DC-BIN-DATE-1
002807         MOVE  ' '                   TO DC-OPTION-CODE
002808         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002809         MOVE DC-GREG-DATE-1-EDIT    TO P-CHG-INC-DT.
002810
002811     IF AT-OLD-PAID-THRU-DT = LOW-VALUES OR SPACES
002812        MOVE ZEROS                  TO P-CHG-PAID-TO-DT
002813     ELSE
002814        IF NOT PI-USES-PAID-TO
002815           MOVE  AT-OLD-PAID-THRU-DT   TO DC-BIN-DATE-1
002816           MOVE  ' '                   TO DC-OPTION-CODE
002817           PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002818           MOVE DC-GREG-DATE-1-EDIT    TO P-CHG-PAID-TO-DT
002819        ELSE
002820           MOVE 'PD TO - ' TO L-1-PD-THRU
002821           MOVE  AT-OLD-PAID-THRU-DT   TO DC-BIN-DATE-1
002822           MOVE +1                     TO DC-ELAPSED-DAYS
002823           MOVE +0                     TO DC-ELAPSED-MONTHS
002824           MOVE  '6'                   TO DC-OPTION-CODE
002825           PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002826           MOVE DC-GREG-DATE-1-EDIT    TO P-CHG-PAID-TO-DT.
002827
002828     IF AT-OLD-REPORTED-DT = LOW-VALUES OR SPACES
002829         MOVE ZEROS TO P-CHG-REP-DT
002830     ELSE
002831         MOVE AT-OLD-REPORTED-DT     TO DC-BIN-DATE-1
002832         MOVE  ' '                   TO DC-OPTION-CODE
002833         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002834         MOVE DC-GREG-DATE-1-EDIT    TO P-CHG-REP-DT.
002835
002836     IF AT-OLD-ESTABLISHED-DT = LOW-VALUES OR SPACES
002837         MOVE ZEROS                  TO P-CHG-CREAT-DT
002838     ELSE
002839         MOVE  AT-OLD-ESTABLISHED-DT TO DC-BIN-DATE-1
002840         MOVE  ' '                   TO DC-OPTION-CODE
002841         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002842         MOVE DC-GREG-DATE-1-EDIT    TO P-CHG-CREAT-DT.
002843
002844     IF AT-LAST-PMT-MADE-DT = LOW-VALUES OR SPACES
002845         MOVE ZEROS TO P-CHG-LAST-PMT-DT
002846     ELSE
002847         MOVE  AT-LAST-PMT-MADE-DT   TO DC-BIN-DATE-1
002848         MOVE  ' '                   TO DC-OPTION-CODE
002849         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002850         MOVE DC-GREG-DATE-1-EDIT    TO P-CHG-LAST-PMT-DT.
002851
002852     MOVE P-CHG-LINE-1           TO CLM-STAT-EXT-OUT-RECORD
002853     perform 5000-write-a-line   thru 5000-exit
002854
002855     MOVE P-CHG-LINE-2           TO CLM-STAT-EXT-OUT-RECORD
002856     perform 5000-write-a-line   thru 5000-exit
002857
002858     MOVE P-CHG-LINE-3           TO CLM-STAT-EXT-OUT-RECORD
002859     perform 5000-write-a-line   thru 5000-exit
002860
002861     MOVE P-CHG-LINE-4           TO CLM-STAT-EXT-OUT-RECORD
002862     perform 5000-write-a-line   thru 5000-exit
002863
002864     .
002865 2590-EXIT.
002866      EXIT.
002867
002868     EJECT
002869 2600-PROCESS-TRA.
002870******************************************************************
002871***       BUILD CONTINUING CLAIM FORM INFORMATION              ***
002872******************************************************************
002873
002874     IF WS-LINE-CNT GREATER THAN 50
002875         PERFORM  4013-HEADING-RTN  THRU 4013-EXIT
002876         PERFORM  1014-HEADING-CONT THRU 1014-EXIT.
002877
002878     MOVE AT-RECORDED-DT           TO DC-BIN-DATE-1
002879     MOVE  ' '                     TO DC-OPTION-CODE
002880     PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002881     MOVE DC-GREG-DATE-1-EDIT      TO P-FORM-LET-DT.
002882     MOVE AT-RECORDED-BY           TO P-FORM-BY.
002883     MOVE AT-FORM-ADDRESS          TO P-FORM-ADSEE-CD.
002884
002885     IF INITIAL-FORM
002886        MOVE 'INIT'                TO P-FORM-FORM
002887       ELSE
002888        MOVE 'PROG'                TO P-FORM-FORM.
002889
002890     IF AT-FORM-SEND-ON-DT = LOW-VALUES OR SPACES
002891         MOVE SPACES                  TO P-FORM-SENT-DT
002892     ELSE
002893         MOVE AT-FORM-SEND-ON-DT      TO DC-BIN-DATE-1
002894         MOVE  ' '                    TO DC-OPTION-CODE
002895         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002896         MOVE DC-GREG-DATE-1-EDIT     TO  P-FORM-SENT-DT.
002897
002898
002899     IF AT-FORM-RE-SEND-DT = LOW-VALUES OR SPACES
002900         MOVE SPACES                  TO P-FORM-SEND-DT
002901     ELSE
002902         MOVE AT-FORM-RE-SEND-DT      TO DC-BIN-DATE-1
002903         MOVE  ' '                    TO DC-OPTION-CODE
002904         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002905         MOVE DC-GREG-DATE-1-EDIT     TO  P-FORM-SEND-DT.
002906
002907
002908     IF AT-FORM-FOLLOW-UP-DT = LOW-VALUES OR SPACES
002909         MOVE SPACE                   TO P-FORM-FOL-DT
002910     ELSE
002911         MOVE AT-FORM-FOLLOW-UP-DT    TO DC-BIN-DATE-1
002912         MOVE  ' '                    TO DC-OPTION-CODE
002913         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002914         MOVE DC-GREG-DATE-1-EDIT     TO  P-FORM-FOL-DT.
002915
002916     IF AT-FORM-ANSWERED-DT = LOW-VALUES OR SPACES
002917         MOVE SPACE                   TO P-CLM-FORM-ANS-DT
002918     ELSE
002919         MOVE AT-FORM-ANSWERED-DT     TO DC-BIN-DATE-1
002920         MOVE  ' '                    TO DC-OPTION-CODE
002921         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002922         MOVE DC-GREG-DATE-1-EDIT     TO P-CLM-FORM-ANS-DT.
002923
002924     MOVE SPACES                      TO P-FORM-LINE-4
002925
002926     IF AT-EMP-FORM-ANSWERED-DT = LOW-VALUES OR SPACES
002927         MOVE SPACES                  TO P-EMP-FORM-ANS-DT
002928         MOVE SPACES                  TO P-EMP-FORM-COMM
002929     ELSE
002930         MOVE '   EMP.  ANSWERED - '  TO P-EMP-FORM-COMM
002931         MOVE AT-EMP-FORM-ANSWERED-DT TO DC-BIN-DATE-1
002932         MOVE  ' '                    TO DC-OPTION-CODE
002933         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002934         MOVE DC-GREG-DATE-1-EDIT     TO P-EMP-FORM-ANS-DT.
002935
002936     IF AT-PHY-FORM-ANSWERED-DT = LOW-VALUES OR SPACES
002937         MOVE SPACES                  TO P-PHY-FORM-ANS-DT
002938         MOVE SPACES                  TO P-PHY-FORM-COMM
002939     ELSE
002940         MOVE 'PHY.  ANSWERED - '     TO P-PHY-FORM-COMM
002941         MOVE AT-PHY-FORM-ANSWERED-DT TO DC-BIN-DATE-1
002942         MOVE  ' '                    TO DC-OPTION-CODE
002943         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
002944         MOVE DC-GREG-DATE-1-EDIT     TO P-PHY-FORM-ANS-DT.
002945
002946     MOVE SPACES                      TO P-FORM-ADSEE.
002947
002948     IF  FORM-TO-INSURED
002949          MOVE 'INSURED'              TO P-FORM-ADSEE.
002950     IF  FORM-TO-ACCOUNT
002951          MOVE 'ACCOUNT'              TO P-FORM-ADSEE.
002952     IF  FORM-TO-OTHER-1
002953          MOVE 'OTHER 1'              TO P-FORM-ADSEE.
002954     IF  FORM-TO-OTHER-2
002955          MOVE 'OTHER 2'              TO P-FORM-ADSEE.
002956
002957     IF PROGRESS-FORM
002958        MOVE AT-INSTRUCT-LN-1    TO P-FORM-INSTRUCT
002959        MOVE AT-INSTRUCT-LN-2    TO P-FORM-INSTRUCT-1.
002960
002961     MOVE P-FORM-LINE-1          TO CLM-STAT-EXT-OUT-RECORD
002962     perform 5000-write-a-line   thru 5000-exit
002963
002964     MOVE P-FORM-LINE-2          TO CLM-STAT-EXT-OUT-RECORD
002965     perform 5000-write-a-line   thru 5000-exit
002966
002967     MOVE P-FORM-LINE-3          TO CLM-STAT-EXT-OUT-RECORD
002968     perform 5000-write-a-line   thru 5000-exit
002969
002970     IF P-FORM-LINE-4 NOT EQUAL SPACES
002971        MOVE P-FORM-LINE-4       TO CLM-STAT-EXT-OUT-RECORD
002972        perform 5000-write-a-line
002973                                 thru 5000-exit
002974     end-if
002975
002976     IF INITIAL-FORM OR AT-INSTRUCT-LN-1 = SPACES
002977        GO TO 2600-CHECK-RELATED-CLAIMS.
002978
002979     MOVE P-FORM-LINE-5          TO CLM-STAT-EXT-OUT-RECORD
002980     perform 5000-write-a-line   thru 5000-exit
002981
002982     IF AT-INSTRUCT-LN-2 NOT = SPACES
002983        MOVE P-FORM-LINE-6       TO CLM-STAT-EXT-OUT-RECORD
002984        perform 5000-write-a-line
002985                                 thru 5000-exit
002986     end-if
002987
002988     IF AT-INSTRUCT-LN-3 NOT = SPACES
002989        MOVE AT-INSTRUCT-LN-3    TO P-FORM-INSTRUCT-1
002990        MOVE P-FORM-LINE-6       TO CLM-STAT-EXT-OUT-RECORD
002991        perform 5000-write-a-line
002992                                 thru 5000-exit
002993     end-if
002994
002995     .
002996 2600-CHECK-RELATED-CLAIMS.
002997
002998     IF AT-RELATED-1 NOT = SPACES
002999        MOVE AT-REL-CLAIM-1      TO P-FORM-CLAIM
003000        MOVE AT-REL-CARR-1       TO P-FORM-CARRIER
003001        MOVE AT-REL-CERT-1       TO P-FORM-CERT
003002        MOVE P-FORM-LINE-7       TO CLM-STAT-EXT-OUT-RECORD
003003        perform 5000-write-a-line
003004                                 thru 5000-exit
003005     end-if
003006
003007     IF AT-RELATED-2 NOT = SPACES
003008        MOVE AT-REL-CLAIM-2      TO P-FORM-CLAIM
003009        MOVE AT-REL-CARR-2       TO P-FORM-CARRIER
003010        MOVE AT-REL-CERT-2       TO P-FORM-CERT
003011        MOVE P-FORM-LINE-7       TO CLM-STAT-EXT-OUT-RECORD
003012        perform 5000-write-a-line
003013                                 thru 5000-exit
003014     end-if
003015
003016     .
003017 2600-EXIT.
003018      EXIT.
003019
003020 2700-PRINT-OPEN-CLOSE-HISTORY.
003021     IF OC-TABLE-LOADED  OR
003022        AD-TABLE-LOADED  OR
003023        AP-TABLE-LOADED
003024         NEXT SENTENCE
003025     ELSE
003026         GO TO 2700-EXIT.
003027
003028     PERFORM 4013-HEADING-RTN   THRU 4013-EXIT.
003029     PERFORM 1014-HEADING-CONT  THRU 1014-EXIT.
003030
003031     MOVE P-2-LINE-6             TO CLM-STAT-EXT-OUT-RECORD
003032     perform 5000-write-a-line   thru 5000-exit
003033
003034     MOVE P-2-LINE-8             TO CLM-STAT-EXT-OUT-RECORD
003035     perform 5000-write-a-line   thru 5000-exit
003036
003037     SET  AP-INDEX  TO 1.
003038     SET  AD-INDEX  TO 1.
003039     SET  OC-INDEX  TO 1.
003040
003041     IF OC-TABLE-LOADED
003042        PERFORM  2710-PROCESS-OC  THRU 2710-EXIT
003043           UNTIL  END-OC-TABLE
003044           OR OC-INDEX GREATER THAN 6
003045        MOVE SPACES              TO CLM-STAT-EXT-OUT-RECORD
003046        perform 5000-write-a-line
003047                                 thru 5000-exit
003048     end-if
003049
003050     MOVE SPACES TO END-OC-TABLE-SW.
003051
003052     IF AP-TABLE-LOADED
003053        PERFORM  2720-PROCESS-AP  THRU 2720-EXIT
003054          UNTIL  END-AP-TABLE
003055          OR AP-INDEX GREATER THAN 10
003056        MOVE SPACES              TO CLM-STAT-EXT-OUT-RECORD
003057        perform 5000-write-a-line
003058                                 thru 5000-exit
003059     end-if
003060
003061     MOVE SPACES TO END-AP-TABLE-SW.
003062
003063     IF AD-TABLE-LOADED
003064        PERFORM  2730-PROCESS-AD  THRU 2730-EXIT
003065          UNTIL  END-AD-TABLE
003066          OR AD-INDEX GREATER THAN  60
003067        MOVE SPACES              TO CLM-STAT-EXT-OUT-RECORD
003068        perform 5000-write-a-line
003069                                 thru 5000-exit
003070     end-if
003071     MOVE SPACES                 TO END-AD-TABLE-SW
003072
003073     .
003074 2700-EXIT.
003075      EXIT.
003076
003077 2710-PROCESS-OC.
003078     IF OC-TBL-OPCL-DT (OC-INDEX)  = SPACES OR LOW-VALUES
003079         MOVE   'E'  TO END-OC-TABLE-SW
003080         GO TO 2710-EXIT.
003081
003082     MOVE SPACES    TO P-2-HIS-OPCL.
003083
003084     IF  OC-TBL-OPCL-TYPE (OC-INDEX) = 'O'
003085         MOVE 'OPEN '   TO P-2-HIS-OPCL.
003086     IF  OC-TBL-OPCL-TYPE (OC-INDEX) = 'C'
003087         MOVE 'CLOSE'   TO P-2-HIS-OPCL.
003088
003089     MOVE OC-TBL-OPCL-REASON (OC-INDEX)   TO P-2-HIS-CAUSE.
003090
003091     MOVE OC-TBL-OPCL-DT (OC-INDEX) TO DC-BIN-DATE-1.
003092     MOVE  ' '                      TO DC-OPTION-CODE.
003093     PERFORM 8100-DATE-RTN  THRU 8100-EXIT.
003094     MOVE DC-GREG-DATE-1-EDIT TO  P-2-HIS-DATE.
003095
003096     MOVE P-2-HIS-DETAIL         TO CLM-STAT-EXT-OUT-RECORD
003097     perform 5000-write-a-line   thru 5000-exit.
003098
003099     MOVE SPACES  TO  OC-TBL-OPCL-TYPE   (OC-INDEX)
003100                      OC-TBL-OPCL-DT     (OC-INDEX)
003101                      OC-TBL-OPCL-REASON (OC-INDEX).
003102
003103     SET  OC-INDEX   UP BY 1.
003104
003105 2710-EXIT.
003106      EXIT.
003107
003108     EJECT
003109 2720-PROCESS-AP.
003110     IF AP-TBL-SCHED-START-DT (AP-INDEX) = SPACES
003111         MOVE   'E'  TO END-AP-TABLE-SW
003112         GO TO 2720-EXIT.
003113
003114     IF  WS-LINE-CNT  GREATER THAN  50
003115         PERFORM  4013-HEADING-RTN  THRU 4013-EXIT.
003116
003117     MOVE AP-TBL-EST-BY     (AP-INDEX)    TO P-2-EST-BY.
003118     MOVE AP-TBL-FIRST-DAYS (AP-INDEX)    TO P-2-DAYS-1ST.
003119     MOVE AP-TBL-FIRST-AMT  (AP-INDEX)    TO P-2-1ST-PMT.
003120     MOVE AP-TBL-REG-AMT    (AP-INDEX)    TO P-2-REG-PMT.
003121     MOVE AP-TBL-FIRST-DAYS (AP-INDEX)    TO P-2-DAYS-1ST.
003122
003123     MOVE AP-TBL-EST-DT (AP-INDEX)        TO DC-BIN-DATE-1.
003124     MOVE  ' '                            TO DC-OPTION-CODE.
003125     PERFORM 8100-DATE-RTN  THRU 8100-EXIT.
003126     MOVE DC-GREG-DATE-1-EDIT             TO P-2-EST-DT.
003127
003128     IF AP-TBL-SCHED-START-DT (AP-INDEX)  = LOW-VALUES OR
003129                                            SPACES
003130         MOVE ZEROS TO P-2-EFF-DT
003131     ELSE
003132         MOVE AP-TBL-SCHED-START-DT (AP-INDEX) TO  DC-BIN-DATE-1
003133         MOVE  ' '                           TO  DC-OPTION-CODE
003134         MOVE +0                             TO  DC-ELAPSED-DAYS
003135                                                 DC-ELAPSED-MONTHS
003136         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
003137         IF NO-CONVERSION-ERROR
003138             MOVE DC-GREG-DATE-1-EDIT        TO  P-2-EFF-DT
003139         ELSE
003140             MOVE SPACES                     TO  P-2-EFF-DT.
003141
003142     IF AP-TBL-SCHED-END-DT (AP-INDEX) = LOW-VALUES OR SPACES
003143         MOVE ZEROS                          TO  P-2-END-DT
003144         IF PI-USES-PAID-TO
003145             MOVE 'LAST PAY TO DATE    - '   TO  P-2-LST-PMT-DT
003146         ELSE
003147             MOVE 'LAST PAY THRU DATE  - '   TO  P-2-LST-PMT-DT
003148     ELSE
003149         IF PI-USES-PAID-TO
003150             MOVE 'LAST PAY TO DATE    - '   TO  P-2-LST-PMT-DT
003151             MOVE AP-TBL-SCHED-END-DT (AP-INDEX) TO DC-BIN-DATE-1
003152             MOVE '6'                        TO  DC-OPTION-CODE
003153             MOVE +1                         TO  DC-ELAPSED-DAYS
003154             MOVE +0                         TO  DC-ELAPSED-MONTHS
003155             PERFORM 8100-DATE-RTN THRU 8100-EXIT
003156             IF NO-CONVERSION-ERROR
003157                 MOVE DC-GREG-DATE-1-EDIT    TO  P-2-LST-PMT-ON
003158             ELSE
003159                 MOVE SPACES                 TO  P-2-LST-PMT-ON
003160         ELSE
003161             MOVE 'LAST PAY THRU DATE  - '   TO  P-2-LST-PMT-DT
003162             MOVE AP-TBL-SCHED-END-DT (AP-INDEX) TO DC-BIN-DATE-1
003163             MOVE  ' '                       TO  DC-OPTION-CODE
003164             MOVE +0                         TO  DC-ELAPSED-DAYS
003165                                                 DC-ELAPSED-MONTHS
003166             PERFORM 8100-DATE-RTN  THRU 8100-EXIT
003167             IF NO-CONVERSION-ERROR
003168                 MOVE DC-GREG-DATE-1-EDIT    TO  P-2-LST-PMT-ON
003169             ELSE
003170                 MOVE SPACES                 TO  P-2-LST-PMT-ON.
003171
003172     IF AP-TBL-FIRST-DT (AP-INDEX) = LOW-VALUES OR SPACES
003173         MOVE SPACES                         TO  P-2-1ST-PMT-ON
003174         IF PI-USES-PAID-TO
003175             MOVE 'FIRST PAY TO DATE   - '   TO  P-2-1ST-PMT-DT
003176         ELSE
003177             MOVE 'FIRST PAY THRU DATE - '   TO  P-2-1ST-PMT-DT
003178     ELSE
003179         IF PI-USES-PAID-TO
003180             MOVE 'FIRST PAY TO DATE   - '   TO  P-2-1ST-PMT-DT
003181             MOVE AP-TBL-FIRST-DT (AP-INDEX) TO  DC-BIN-DATE-1
003182             MOVE '6'                        TO  DC-OPTION-CODE
003183             MOVE +1                         TO  DC-ELAPSED-DAYS
003184             MOVE +0                         TO  DC-ELAPSED-MONTHS
003185             PERFORM 8100-DATE-RTN THRU 8100-EXIT
003186             IF NO-CONVERSION-ERROR
003187                 MOVE DC-GREG-DATE-1-EDIT    TO  P-2-1ST-PMT-ON
003188             ELSE
003189                 MOVE SPACES                 TO  P-2-1ST-PMT-ON
003190         ELSE
003191             MOVE 'FIRST PAY THRU DATE - '   TO  P-2-1ST-PMT-DT
003192             MOVE AP-TBL-FIRST-DT (AP-INDEX) TO  DC-BIN-DATE-1
003193             MOVE  ' '                       TO  DC-OPTION-CODE
003194             MOVE +0                         TO  DC-ELAPSED-DAYS
003195                                                 DC-ELAPSED-MONTHS
003196             PERFORM 8100-DATE-RTN  THRU 8100-EXIT
003197             IF NO-CONVERSION-ERROR
003198                 MOVE DC-GREG-DATE-1-EDIT    TO  P-2-1ST-PMT-ON
003199             ELSE
003200                 MOVE SPACES                 TO  P-2-1ST-PMT-ON.
003201
003202     IF AP-TBL-TERM-DT (AP-INDEX) = LOW-VALUES OR SPACES
003203         MOVE SPACES                    TO P-2-END-DT
003204     ELSE
003205         MOVE AP-TBL-TERM-DT (AP-INDEX) TO DC-BIN-DATE-1
003206         MOVE +0                        TO DC-ELAPSED-DAYS
003207                                           DC-ELAPSED-MONTHS
003208         MOVE  ' '                      TO DC-OPTION-CODE
003209         PERFORM 8100-DATE-RTN  THRU 8100-EXIT
003210         MOVE DC-GREG-DATE-1-EDIT       TO P-2-END-DT.
003211
003212     MOVE AP-TBL-INT-MO  (AP-INDEX)    TO P-2-MOS-BET.
003213
003214     MOVE  SPACES   TO  P-2-PAYEE.
003215
003216     IF  INSURED-PAID-AUTO
003217         MOVE  'INSURED PAID AUTO'  TO  P-2-PAYEE.
003218     IF  BENEFICIARY-PAID-AUTO
003219         MOVE  'BENEF-Y PAID AUTO'  TO  P-2-PAYEE.
003220     IF  ACCOUNT-PAID-AUTO
003221         MOVE  'ACCOUNT PAID AUTO'  TO  P-2-PAYEE.
003222     IF  OTHER-1-PAID-AUTO
003223         MOVE  'OTHER-1 PAID AUTO'  TO  P-2-PAYEE.
003224     IF  OTHER-2-PAID-AUTO
003225         MOVE  'OTHER-2 PAID AUTO'  TO  P-2-PAYEE.
003226
003227     IF  AP-TBL-LAST-TYPE (AP-INDEX)  = '1'
003228         MOVE  'YES'   TO P-2-LAST-FINAL
003229     ELSE
003230         MOVE  'NO '   TO P-2-LAST-FINAL
003231
003232     MOVE P-2-AUT-LINE-1         TO CLM-STAT-EXT-OUT-RECORD
003233     perform 5000-write-a-line   thru 5000-exit
003234
003235     MOVE P-2-AUT-LINE-2         TO CLM-STAT-EXT-OUT-RECORD
003236     perform 5000-write-a-line   thru 5000-exit
003237
003238     MOVE P-2-AUT-LINE-3         TO CLM-STAT-EXT-OUT-RECORD
003239     perform 5000-write-a-line   thru 5000-exit
003240
003241     MOVE P-2-AUT-LINE-4         TO CLM-STAT-EXT-OUT-RECORD
003242     perform 5000-write-a-line   thru 5000-exit
003243
003244     MOVE P-2-AUT-LINE-5         TO CLM-STAT-EXT-OUT-RECORD
003245     perform 5000-write-a-line   thru 5000-exit
003246
003247     MOVE P-2-AUT-LINE-6         TO CLM-STAT-EXT-OUT-RECORD
003248     perform 5000-write-a-line   thru 5000-exit
003249
003250     MOVE P-2-AUT-LINE-7         TO CLM-STAT-EXT-OUT-RECORD
003251     perform 5000-write-a-line   thru 5000-exit
003252
003253     MOVE P-2-AUT-LINE-8         TO CLM-STAT-EXT-OUT-RECORD
003254     perform 5000-write-a-line   thru 5000-exit
003255
003256     MOVE SPACES TO AP-TBL-EST-DT         (AP-INDEX)
003257                    AP-TBL-EST-BY         (AP-INDEX)
003258                    AP-TBL-SCHED-START-DT (AP-INDEX)
003259                    AP-TBL-SCHED-END-DT   (AP-INDEX)
003260                    AP-TBL-TERM-DT        (AP-INDEX)
003261                    AP-TBL-LAST-TYPE      (AP-INDEX)
003262                    AP-TBL-FIRST-DT       (AP-INDEX)
003263                    AP-TBL-INT-MO         (AP-INDEX).
003264
003265      MOVE ZEROS  TO AP-TBL-FIRST-AMT     (AP-INDEX)
003266                     AP-TBL-FIRST-DAYS    (AP-INDEX)
003267                     AP-TBL-REG-AMT       (AP-INDEX)
003268                     AP-TBL-REG-MO        (AP-INDEX).
003269
003270     SET  AP-INDEX   UP BY 1.
003271
003272 2720-EXIT.
003273      EXIT.
003274
003275     EJECT
003276 2730-PROCESS-AD.
003277
003278     IF AD-TBL-TYPE (AD-INDEX) = SPACES
003279         MOVE   'E'  TO END-AD-TABLE-SW
003280         GO TO 2730-EXIT.
003281
003282     IF  WS-LINE-CNT  GREATER THAN  50
003283         PERFORM  4013-HEADING-RTN  THRU 4013-EXIT.
003284
003285     MOVE AD-TBL-TYPE   (AD-INDEX)     TO P-2-ADD-CODE.
003286     MOVE AD-TBL-NAME   (AD-INDEX)     TO P-2-ADD-NAME.
003287     MOVE AD-TBL-ADDR-1 (AD-INDEX)     TO P-2-ADD-ADDR-1.
003288     MOVE AD-TBL-ADDR-2 (AD-INDEX)     TO P-2-ADD-ADDR-2.
003289     MOVE AD-TBL-CITY   (AD-INDEX)     TO P-2-ADD-CITY.
003290     MOVE AD-TBL-ZIP    (AD-INDEX)     TO P-2-ADD-ZIP.
003291     MOVE AD-TBL-PHONE  (AD-INDEX)     TO WS-PHONE-BRKDN.
003292     MOVE WS-PH-1                      TO WS-PH-ED-1.
003293     MOVE WS-PH-2                      TO WS-PH-ED-2.
003294     MOVE WS-PH-3                      TO WS-PH-ED-3.
003295     MOVE WS-PHONE-EDIT                TO P-2-ADD-PHONE.
003296
003297     IF AD-TBL-TYPE  (AD-INDEX)   = 'I'
003298         MOVE 'INSURED'        TO P-2-ADD-TYPE.
003299     IF AD-TBL-TYPE  (AD-INDEX)   = 'B'
003300         MOVE 'BENEFICIARY'    TO P-2-ADD-TYPE.
003301     IF AD-TBL-TYPE  (AD-INDEX)   = 'A'
003302         MOVE 'ACCOUNT'        TO P-2-ADD-TYPE.
003303     IF AD-TBL-TYPE  (AD-INDEX)   = 'P'
003304         MOVE 'PHYSICIAN'      TO P-2-ADD-TYPE.
003305     IF AD-TBL-TYPE  (AD-INDEX)   = 'E'
003306         MOVE 'EMPLOYER'       TO P-2-ADD-TYPE.
003307     IF AD-TBL-TYPE  (AD-INDEX)   = 'O'
003308         MOVE 'OTHER 1'        TO P-2-ADD-TYPE.
003309     IF AD-TBL-TYPE  (AD-INDEX)   = 'Q'
003310         MOVE 'OTHER 2'        TO P-2-ADD-TYPE.
003311     IF AD-TBL-TYPE  (AD-INDEX)   = '8'
003312        MOVE 'FROM ACCT MSTR'   TO P-2-ADD-TYPE.
003313     IF AD-TBL-TYPE  (AD-INDEX)   = '9'
003314         MOVE 'FROM BENE MSTR'    TO P-2-ADD-TYPE.
003315
003316     MOVE P-2-ADD-LINE-1         TO CLM-STAT-EXT-OUT-RECORD
003317     perform 5000-write-a-line   thru 5000-exit
003318
003319     MOVE P-2-ADD-LINE-2         TO CLM-STAT-EXT-OUT-RECORD
003320     perform 5000-write-a-line   thru 5000-exit
003321
003322     MOVE P-2-ADD-LINE-3         TO CLM-STAT-EXT-OUT-RECORD
003323     perform 5000-write-a-line   thru 5000-exit
003324
003325     MOVE P-2-ADD-LINE-4         TO CLM-STAT-EXT-OUT-RECORD
003326     perform 5000-write-a-line   thru 5000-exit
003327
003328     MOVE P-2-ADD-LINE-5         TO CLM-STAT-EXT-OUT-RECORD
003329     perform 5000-write-a-line   thru 5000-exit
003330
003331     MOVE P-2-ADD-LINE-6         TO CLM-STAT-EXT-OUT-RECORD
003332     perform 5000-write-a-line   thru 5000-exit
003333
003334     MOVE  SPACES  TO AD-TBL-TYPE   (AD-INDEX)
003335                      AD-TBL-NAME   (AD-INDEX)
003336                      AD-TBL-ADDR-1 (AD-INDEX)
003337                      AD-TBL-ADDR-2 (AD-INDEX)
003338                      AD-TBL-CITY   (AD-INDEX).
003339      MOVE ZEROS TO   AD-TBL-ZIP    (AD-INDEX)
003340                      AD-TBL-PHONE  (AD-INDEX).
003341
003342     SET  AD-INDEX   UP BY 1.
003343
003344 2730-EXIT.
003345      EXIT.
003346
003347     EJECT
003348 4000-INITIALIZE.
003349     MOVE SPACES TO   END-OC-TABLE-SW
003350                      END-AD-TABLE-SW
003351                      END-AP-TABLE-SW
003352                      PI-CLAIM-PAID-THRU-TO.
003353
003354     MOVE SAVE-DATE         TO HEAD-RUN-DATE.
003355
003356     MOVE 0  TO WS-PAGE-CNT.
003357
003358     MOVE +80  TO WS-LINE-LEN.
003359
003360     SET  AP-INDEX   TO 1.
003361     SET  AD-INDEX   TO 1.
003362     SET  OC-INDEX   TO 1.
003363
003364     PERFORM 4001-CLEAR-OC-TABLE  6   TIMES.
003365     PERFORM 4002-CLEAR-AP-TABLE  10  TIMES.
003366     PERFORM 4003-CLEAR-AD-TABLE  60  TIMES.
003367
003368     MOVE SAVE-DATE     TO DC-GREG-DATE-1-EDIT
003369                           HEAD-RUN-DATE.
003370
003371     MOVE '2' TO DC-OPTION-CODE.
003372     PERFORM 8100-DATE-RTN  THRU 8100-EXIT.
003373     MOVE DC-GREG-DATE-1-ALPHA  TO WS-UNALIGNED-FIELD.
003374     MOVE DC-BIN-DATE-1         TO WS-BIN-CURRENT-DT
003375     MOVE +18 TO WS-NAME-LENGTH.
003376     PERFORM ELCALGNP              THRU ELCALGNP-EXIT.
003377     MOVE WS-ALIGNED-FIELD      TO HEAD-RUN-DATE-FULL.
003378
003379*    if ws-kix-myenv = 'cid1p'
003380*       move '/data/seqfiles/'   to ws-work-dir
003381*       move 'cd /apps/prod/cid1p/jcl'
003382*                                to tran-data-line1
003383*       move ws-kix-myenv        to ws-work-env
003384*    else
003385*       move ws-kix-myenv        to ws-work-env
003386**      string
003387**         '/data/test/' delimited by size
003388**         ws-work-env   delimited by space
003389**         '/seqfiles/'  delimited by size
003390**            into ws-work-dir
003391**      end-string
003392*       display ' work dir **' ws-work-dir '**'
003393*       string
003394*          'cd /apps/test/' delimited by size
003395*          ws-work-env      delimited by space
003396*          '/jcl'           delimited by size
003397*             into tran-data-line1
003398*       end-string
003399*       display ' line 1 **' tran-data-line1 '**'
003400*    end-if
003401
003402     move '/export/home/mtpadmin/ftpfiles/'
003403                                 to ws-work-dir
003404     move function upper-case(ws-comp-id)
003405                                 to ws-work-comp-id
003406     move 'cilg201b'             to ws-work-job-name
003407
003408     move spaces                 to ws-file-name
003409
003410     string
003411        soc-client-comp-id
003412        soc-client-car
003413        soc-client-claim-no
003414        soc-client-cert-no(1:10)
003415        soc-client-proc-id
003416        '.txt' delimited by size into ws-work-rpt-out
003417     end-string
003418*    display ' work rpt **' ws-work-rpt-out '**'
003419
003420     string
003421        ws-work-dir delimited by space
003422        ws-work-rpt-out delimited by size
003423           into ws-file-name
003424     end-string
003425*    display ' out file **' ws-file-name '**'
003426
003427     move ws-file-name to rm-filename
003428*    display ' rm string **' ws-rm-string '**'
003429     call "SYSTEM" using ws-rm-string
003430        returning ws-rm-return-cd
003431*    display ' rm return code ' ws-rm-return-cd
003432
003433     move spaces to ws-return-stuff
003434     string
003435        ' Here is the file '
003436        ws-file-name
003437        delimited by size into ws-return-stuff
003438     end-string
003439     string
003440        'unikixjob '     delimited by size
003441        ws-work-job-name delimited by size
003442        ' -k '           delimited by size
003443        ws-work-env      delimited by space
003444           into tran-data-line2
003445     end-string
003446
003447*     display ' svr    ' svr
003448*     display ' user   ' usr
003449*     display ' pw     ' pass
003450*     display ' input  ' ws-written-in
003451*     display ' output ' ws-written-rpt
003452*     display '        '
003453*     display ' line 1 ' tran-data-line1
003454*     display ' line 2 ' tran-data-line2
003455
003456     open output CLM-STAT-EXT-OUT
003457
003458     if ws-ext-file-status not = '00'
003459        display 'error open on output ' ws-ext-file-status
003460        move ' Invalid or missing file '
003461                                 to ws-return-stuff
003462        go to 0000-end
003463     end-if
003464
003465     .
003466 4000-EXIT.
003467      EXIT.
003468
003469 4001-CLEAR-OC-TABLE.
003470     MOVE SPACES  TO  OC-TBL-OPCL-DT     (OC-INDEX)
003471                      OC-TBL-OPCL-TYPE   (OC-INDEX)
003472                      OC-TBL-OPCL-REASON (OC-INDEX).
003473     SET  OC-INDEX   UP BY 1.
003474
003475 4001-EXIT.
003476      EXIT.
003477
003478 4002-CLEAR-AP-TABLE.
003479     MOVE SPACES TO AP-TBL-EST-DT         (AP-INDEX)
003480                    AP-TBL-EST-BY         (AP-INDEX)
003481                    AP-TBL-SCHED-START-DT (AP-INDEX)
003482                    AP-TBL-SCHED-END-DT   (AP-INDEX)
003483                    AP-TBL-TERM-DT        (AP-INDEX)
003484                    AP-TBL-LAST-TYPE      (AP-INDEX)
003485                    AP-TBL-FIRST-DT       (AP-INDEX)
003486                    AP-TBL-INT-MO         (AP-INDEX).
003487
003488      MOVE ZEROS  TO AP-TBL-FIRST-AMT     (AP-INDEX)
003489                     AP-TBL-FIRST-DAYS    (AP-INDEX)
003490                     AP-TBL-REG-AMT       (AP-INDEX)
003491                     AP-TBL-REG-MO        (AP-INDEX).
003492
003493     SET  AP-INDEX   UP BY 1.
003494
003495 4002-EXIT.
003496      EXIT.
003497
003498 4003-CLEAR-AD-TABLE.
003499     MOVE  SPACES  TO AD-TBL-TYPE   (AD-INDEX)
003500                      AD-TBL-NAME   (AD-INDEX)
003501                      AD-TBL-ADDR-1 (AD-INDEX)
003502                      AD-TBL-ADDR-2 (AD-INDEX)
003503                      AD-TBL-CITY   (AD-INDEX).
003504      MOVE ZEROS TO   AD-TBL-ZIP    (AD-INDEX)
003505                      AD-TBL-PHONE  (AD-INDEX).
003506
003507     SET  AD-INDEX   UP BY 1.
003508
003509 4003-EXIT.
003510      EXIT.
003511
003512 4013-HEADING-RTN.
003513
003514     move +1                     to ws-line-cnt
003515     ADD 1 TO WS-PAGE-CNT
003516     MOVE WS-PAGE-CNT            TO HEAD-PAGE-NO
003517
003518     if ws-page-cnt > 1
003519        move X'0C'               to clm-stat-ext-out-record
003520        perform 5000-write-a-line thru 5000-exit
003521     end-if
003522
003523     MOVE HEAD-LINE-2            TO CLM-STAT-EXT-OUT-RECORD
003524     perform 5000-write-a-line   thru 5000-exit
003525
003526     MOVE HEAD-LINE-3            TO CLM-STAT-EXT-OUT-RECORD
003527     perform 5000-write-a-line   thru 5000-exit
003528
003529     MOVE HEAD-LINE-4            TO CLM-STAT-EXT-OUT-RECORD
003530     perform 5000-write-a-line   thru 5000-exit
003531
003532     .
003533 4013-EXIT.
003534      EXIT.
003535
003536 1014-HEADING-CONT.
003537
003538     MOVE LINE-25                TO CLM-STAT-EXT-OUT-RECORD
003539     perform 5000-write-a-line   thru 5000-exit
003540
003541     MOVE  LINE-26               TO CLM-STAT-EXT-OUT-RECORD
003542     perform 5000-write-a-line   thru 5000-exit
003543
003544     .
003545 1014-EXIT.
003546      EXIT.
003547
003548 5000-write-a-line.
003549     write CLM-STAT-EXT-OUT-RECORD
003550
003551     add 1 to ws-line-cnt
003552
003553     .
003554 5000-exit.
003555     exit.
003556
003557      EJECT
003558*PRINT-RTN.  COPY ELPRTCVP.
003559 PRINT-RTN.
003560*    COPY ELPRTCVP.
003561
003562     EJECT
003563 8100-DATE-RTN.
003564     
      * EXEC CICS LINK
003565*           PROGRAM  ('ELDATCV')
003566*           COMMAREA (DATE-CONVERSION-DATA)
003567*           LENGTH   (DC-COMM-LENGTH)
003568*    END-EXEC.
           MOVE 'ELDATCV' TO DFHEIV1
      *    MOVE '."C                   (   #00008390' TO DFHEIV0
           MOVE X'2E2243202020202020202020' &
                X'202020202020202020202820' &
                X'2020233030303038333930' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 DATE-CONVERSION-DATA, 
                 DC-COMM-LENGTH, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
003569
003570 8100-EXIT.
003571      EXIT.
003572
003573 8300-ABEND.
003574     MOVE SPACES                 TO WS-PASSED-DATA.
003575     MOVE DFHEIBLK               TO WS-PASSED-DATA.
003576     
      * EXEC CICS LINK
003577*        PROGRAM   ('EL004')
003578*        COMMAREA  (WS-PASSED-DATA)
003579*        LENGTH    (72)
003580*    END-EXEC.
           MOVE 'EL004' TO DFHEIV1
           MOVE 72
             TO DFHEIV11
      *    MOVE '."C                   (   #00008402' TO DFHEIV0
           MOVE X'2E2243202020202020202020' &
                X'202020202020202020202820' &
                X'2020233030303038343032' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 WS-PASSED-DATA, 
                 DFHEIV11, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
003581
003582     perform 5000-write-a-line   thru 5000-exit
003583     GO TO 9999-FINALIZE.
003584
003585 8900-PGMIDERR.
003586     MOVE '* PROG NOT FOUND, NOTIFY DATA PROCESSING *'
003587                         TO CLM-STAT-EXT-OUT-RECORD
003588     perform 5000-write-a-line   thru 5000-exit
003589     GO TO 9999-FINALIZE.
003590
003591 8900-EXIT.
003592     EJECT
003593
003594 9800-LINK-REM-TERM.
003595     
      * EXEC CICS LINK
003596*        PROGRAM    ('ELRTRM')
003597*        COMMAREA   (CALCULATION-PASS-AREA)
003598*        LENGTH     (CP-COMM-LENGTH)
003599*        END-EXEC.
           MOVE 'ELRTRM' TO DFHEIV1
      *    MOVE '."C                   (   #00008421' TO DFHEIV0
           MOVE X'2E2243202020202020202020' &
                X'202020202020202020202820' &
                X'2020233030303038343231' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 CALCULATION-PASS-AREA, 
                 CP-COMM-LENGTH, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
003600
003601 9800-EXIT.
003602      EXIT.
003603
003604 9900-ERROR-FORMAT.
003605      IF NOT EMI-ERRORS-COMPLETE
003606          
      * EXEC CICS LINK
003607*             PROGRAM    ('EL001')
003608*             COMMAREA   (ERROR-MESSAGE-INTERFACE-BLOCK)
003609*             LENGTH     (EMI-COMM-LENGTH)
003610*         END-EXEC.
           MOVE 'EL001' TO DFHEIV1
      *    MOVE '."C                   (   #00008432' TO DFHEIV0
           MOVE X'2E2243202020202020202020' &
                X'202020202020202020202820' &
                X'2020233030303038343332' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV1, 
                 ERROR-MESSAGE-INTERFACE-BLOCK, 
                 EMI-COMM-LENGTH, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
003611
003612 9900-EXIT.
003613      EXIT.
003614
003615 1000-send-buffer.
003616
003617     move ws-return-stuff        to ws-send-buf
003618*    display 'SOCK10:About to send      '
003619*    display 'SOCK10:sequence number  =', ws-seq-num.
003620*    display ' msg size ' ws-send-msg-size
003621
003622     call "send" using by value GIVE-TAKE-SOCKET,
003623         by reference ws-send-buf,
003624         by value ws-send-msg-size,
003625         by value ws-flags.
003626
003627     if return-code <= zero
003628        display 'SOCK10:send error ',
003629        go to 1000-socket-error
003630     end-if
003631     go to 1000-exit
003632
003633     .
003634 1000-socket-error.
003635     if ws-seq-num <> 0
003636        display "SOCK10:did not complete"
003637     end-if
003638
003639     .
003640 1000-exit.
003641     exit.
003642
003643 1100-close-socket.
003644
003645*    call "close" using by value GIVE-TAKE-SOCKET .
003646*    display 'SOCK10:done'
003647     
      * exec cics return end-exec.
      *    MOVE '.(                    ''   #00008473' TO DFHEIV0
           MOVE X'2E2820202020202020202020' &
                X'202020202020202020202720' &
                X'2020233030303038343733' TO DFHEIV0
           CALL 'kxdfhei1' USING DFHEIV0, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99, 
                 DFHEIV99
           GO TO 9999-DFHEXIT DEPENDING ON DFHEIGDK.
           
003648     
      * goback

           MOVE '9%                    "   ' TO DFHEIV0
           MOVE 'SOCK10' TO DFHEIV1
           CALL 'kxdfhei1' USING DFHEIV0 DFHEIV1
           goback
003649
003650     .
003651 1100-exit.
003652     exit.
003653
003654 9999-FINALIZE.
003655
003656     move spaces TO CLM-STAT-EXT-OUT-RECORD
003657     perform 5000-write-a-line   thru 5000-exit
003658     MOVE 'X'  TO WS-PROG-END.
003659     move spaces TO CLM-STAT-EXT-OUT-RECORD
003660     perform 5000-write-a-line   thru 5000-exit
003661
003662     
      * goback

           MOVE '9%                    "   ' TO DFHEIV0
           MOVE 'SOCK10' TO DFHEIV1
           CALL 'kxdfhei1' USING DFHEIV0 DFHEIV1
           goback
003663
003664     .
003665 9999-EXIT.
003666     
      * GOBACK.
           MOVE '9%                    "   ' TO DFHEIV0
           MOVE 'SOCK10' TO DFHEIV1
           CALL 'kxdfhei1' USING DFHEIV0 DFHEIV1
           GOBACK.

       9999-DFHBACK SECTION.
           MOVE '9%                    "   ' TO DFHEIV0
           MOVE 'SOCK10' TO DFHEIV1
           CALL 'kxdfhei1' USING DFHEIV0 DFHEIV1
           GOBACK.
       9999-DFHEXIT.
           IF DFHEIGDJ EQUAL 0001
               NEXT SENTENCE
           ELSE IF DFHEIGDJ EQUAL 2
               GO TO 1140-ENDBR,
                     1140-ENDBR
               DEPENDING ON DFHEIGDI
           ELSE IF DFHEIGDJ EQUAL 3
               GO TO 1299-EXIT,
                     1299-EXIT
               DEPENDING ON DFHEIGDI
           ELSE IF DFHEIGDJ EQUAL 4
               GO TO 1752-ENDFILE
               DEPENDING ON DFHEIGDI
           ELSE IF DFHEIGDJ EQUAL 5
               GO TO 2130-EXIT,
                     2130-EXIT
               DEPENDING ON DFHEIGDI.
           MOVE '9%                    "   ' TO DFHEIV0
           MOVE 'SOCK10' TO DFHEIV1
           CALL 'kxdfhei1' USING DFHEIV0 DFHEIV1
           GOBACK.
